[
  {
    "id": "23",
    "did": "18-04-30",
    "date": "April 30, 2018<br />",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Data Privacy and Permissions in the Twitter-verse<br />Part II: A Defense of Data Privacy Moderation <br />",
    "post": "<p class=\"firstparagraph\">Fitbit and Wearables' Contribution to Health in Society is clear<sup>1</sup>, yet much of the credit is due to increased social, activity-based networks.  And, new features and benefits depend on relaxed data privacy. Given my <a href=\"#18-04-11\">April 11th post</a> on the upcoming data privacy changes <i>in response to both Cambridge Analytica scandal <strong>and</strong> E.U.'s long-planned Data Privacy regulations.</i></p>\n  \n  <p>So, now is the worst time to clamp down on app permissions, <i>especially as Smart Watches begin to finally make in-roads</i> socially and hardware-wise.  Fitbit's acquirement of Pebble Watch exemplifies the  recent technological hard-ware leap-frogging.  All in all, we can't truly have a socially-connected society without flexible app permissions, so let's hope for fair and flexible data regulations ...  \n  </p>\n  \n  <p class=\"side\">(Side Note: Fitbit's Fashion Wearables' trade-offs betweeen the lighter-weight models versus functional touch-screen. This blogpost bows in reverence to the Apple Watch,<sup>1</sup> whose Series 3 hardly has competitors. I personally reommend the Fitbit Ionic: After three weeks, I'll say the touch accuracy is right on, the graphics are really good, and finally a completely customizable \"dashboard\" with that stats you want. It's draw-backs are minor, every once in a while the watch enters a \"sleep\" mode leading to a few-second delay for the screen to power up.)</p>\n  <p class=\"   cite\">1. <a href=\"https://techcrunch.com/2018/02/13/fitbit-buys-twine-health-in-bid-to-become-a-more-serious-health-care-tool/\" target=\"_blank\">https://techcrunch.com/2018/02/13/fitbit-buys-twine-health-in-bid-to-become-a-more-serious-health-care-tool/</a></p>\n  \n  <p class=\"cite\"><a href=\"https://www.apple.com/apple-watch-series-3/\" target=\"_blank\">https://www.apple.com/apple-watch-series-3/</a></p> "
  },
  {
    "id": "22",
    "did": "18-04-28",
    "date": "April 28-29, 2018<br />Weekend",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Data Privacy and Permissions in the Twitter-verse<br />Part I: Conforming to E.U.s Regulations <br />",
    "post": "   <p class=\"firstparagraph\" >All over, the new <i>Terms &amp; Conditions in Fine(r) Print</i> are alerting social media users to new compliance to ... new laws? I wrote in my <a href=\"#18-04-16\">April 16th post</a> about the upcoming E.U. General Data Privacy Regulations, to which most of social media is unabashedly following. The climate doesn't hurt, but how will our social-media experiences be watered down?  </p>\n  <p>Let's see what Twitter is telling us:<?p><p class=\"quote\">\n  \n  As part of our ongoing commitment to transparency, and in preparation for new data protection laws that take effect next month, we’re updating our Terms of Service and Privacy Policy to empower you to make the best decisions about the information that you share with us. <br />\n  <br />These updates will take effect on May 25, 2018. By using our services on or after that date, you’ll be agreeing to these revisions. You should read the documents in full, but the key updates in our Privacy Policy include:\n  <br /><br />\n  \n  \n     More focus on the controls we offer you over your personal data;\n     <br /><br />\n     More focus on how Twitter shares your public data broadly and instantly, including through our developer tools;\n     <br /><br />\n     More transparency and control over how we share your data with business partners; and\n     <br /><br />\n     More clarity about how we share your data to prevent harm, comply with law, serve the public interest, and keep Twitter safe and welcoming for everyone.<sup>1</sup>\n     </p>\n   <p>This sounds like the least transparent of transparency documents!</p>   \n  <p class=\"cite\">1.<a href=\"https://help.twitter.com/en/rules-and-policies/update-privacy-policy\" target=\"_blank\">https://help.twitter.com/en/rules-and-policies/update-privacy-policy</a></p> \n  <p class=\"cite\">2.<a href=\"https://www.bloomberg.com/news/articles/2018-04-16/facebook-s-zuckerberg-leans-in-to-meet-with-eu-digital-chief\" target=\"_blank\">https://www.bloomberg.com/news/articles/2018-04-16/facebook-s-zuckerberg-leans-in-to-meet-with-eu-digital-chief\n  </a> </p> "
  },
  {
    "id": "21",
    "did": "18-04-27",
    "date": "April 27, 2018<br /> ",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "This Time Baby Ill be Bullet-Proof: Innovation for a 5G World    <br /> --La Roux",
    "post": "<p class=\"firstparagraph\">T-Mobile's potential acquirement of Sprint--for all of its monopoly overtones--may be a very good thing: We, as a society, are at the doorstep of 5G technology, which will fundamentally change every aspect of life. T-Mobile has always been the little engine that could, but has become a powerhouse since last summer with their 8 billion dollar purchase of low bandwidth, which is specifically <i>best for the ubiquity needed for the 5g Revolution</i><sup>2</sup>.  Although Sprint was always in last, 4th place among major carriers, their network infrastructure <i> and Bandwidth Rights</i> can help T-Mobile catch up with AT&amp;T and Verizon's 5G roll-outs.</p>  \n  <p class=\"cite\">1. <a href=\"http://www.businessinsider.com/5g-speed-network-lte-2018-1/\" target=\"_blank\">http://www.businessinsider.com/5g-speed-network-lte-2018-1</a></p>\n  <p class=\"cite\">2. <a href=\"https://www.theverge.com/2017/4/13/15291496/tmobile-fcc-incentive-auction-results-8-billion-airwaves-lte\" target=\"_blank\">https://www.theverge.com/2017/4/13/15291496/tmobile-fcc-incentive-auction-results-8-billion-airwaves-lte</a></p>"
  },
  {
    "id": "20",
    "did": "18-04-26",
    "date": "April 26, 2018<br />",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Romaine Lettuce and the Blockchain:<br /> Part II. Transparent Accuracy of Data",
    "post": "<p class=\"firstparagraph\">Sometimes the safest place to be is no place. So, the beauty of the distributed ledgers is that data is no longer in one place, and is rather in no place at all. Where is it? Spread across each node of the blockchain, and any one change in the data updates each node. Equally, the transaction is secured by a cryptographic hash, which is a unique private key.</p>\n  <p>So, what better way to conceptualize it than read it, here's one of mine on the Ethereum network:</p>\n  <p class=\"quote\">\n  status \t0x1 Transaction mined and execution succeed      <span class=\"green\">  <--status   crypto-contract</span><br /><br />\n  from \t0xca35b7d9TOMTOMef540ade6068dfe2f44e8fa733c         <span class=\"green\"> <--this is my address.</span><br /><br />     \n  to \tbrowser/Tomsfile.sol:tmContract.tmm() 0x692a70d2e424a56d2c6ctomtomd1a86395877b3a <br /><br />\n  gas \t3000000 gas         <br /><br />\n  transaction cost \t32060 gas         <span class=\"green\"> <--pay more, faster transaction validation</span><br /><br /> \n  execution cost \t10788 gas          <span class=\"green\"> <--contract validation isn't free ...</span><br /><br />\n  hash \t0x4daeec5d9db8055c95c2e4eae074b9944e57b6465tomtom239fb601896525587d5fe<br /><br />\n  input \t0x92277933<br /><br />\n  decoded input \t{}<br /><br />\n  decoded output \t{}<br /><br />\n  logs \t[]<br /><br />\n  value \t0 wei<br /><br />\n  </p>\n  <p>We've all seen the Cisco and IBM blockchain supply-chain ads, but how important can it be? In my <a href=\"#18-02-20\">Feb. 20 post</a>, I mention the revolutionary, calibrated <i>freedom and privacy of data</i>, owned and stored with the <i>owner of the data</i>--what a concept! \n  </p>\n  <p class=\"quote\">\n  Jewelry tracing is becoming increasingly important for business, as the younger customer is \"far more skeptical, does more research,\" said Mark Hanna, chief marketing officer at Richline. \"We feel this is an absolute must right now.\"<br /><br />\n  TrustChain has just completed its first proof-of-concept test, in which gold went from a mine in South Dakota to a refinery in Utah, to a fabricator in Massachusetts that converted the gold into casting nuggets and grains. Those then went to a manufacturer in India that made engagement rings and set diamonds in them. The rings went to a distribution facility and then to Helzberg. UL, which helps companies ensure responsible purchases, monitored the transactions throughout the process. \n  <p>Some people call it the <i>Trust Chain</i>, but it's also very much a Transparency Chain, too!   </p>\n  \n  \n  <p class=\"cite\">3. <a href=\"https://www.bloomberg.com/amp/news/articles/2018-04-26/ibm-s-blockchain-tech-to-track-jewels-from-mine-to-retail-stores\" target=\"_blank\">https://www.bloomberg.com/amp/news/articles/2018-04-26/ibm-s-blockchain-tech-to-track-jewels-from-mine-to-retail-stores</a></p>"
  },
  {
    "id": "19",
    "did": "18-04-25",
    "date": "April 25, 2018<br />",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Romaine Lettuce and the Blockchain:<br /> Part I. Instant Access to Data  ",
    "post": "<p class=\"firstparagraph\">E. Coli in the Lettuce supply <sup>1</sup> would make any rabbit apprehensive, but finding the source quickly? Downright disheartening.   However, the ever-evolving potential of blockchain technology presents its solution. The blockchain would provide the complete ledger of a vegetable's journey, across all phases and jurisdictions of the journey. Further, all information can be instantly available from any place (actually no location at all), rather than coordinating information from multiple data sources:\n  </p>\n  <p class=\"quote\">The FDA has identified one farm as the source of the whole-head romaine lettuce that sickened several people at a correctional facility in Alaska. However, the agency has not determined where in the supply chain the contamination occurred. The agency is examining all possibilities, including that contamination may have occurred at any point along the growing, harvesting, packaging, and distribution chain before reaching the Alaska correctional facility where it was served.<sup>2</sup>\n  </p> \n  <p>The beauty of blockchain technology is more than just the crypto-cash or even the new crypto-contracts cropping up in every sector. The distribution of knowledge to all parties, cryptographically sealed and logged from its origin. As it happens, old Watson from IBM fame is taking a crack at it:</p>  \n  \n  <p class=\"quote\"> IBM has also been actively helping form a slew of blockchain-focused companies and industry initiatives around various supply chains. For example, it’s working with companies like retailer Walmart Inc. to trace food products, and earlier this year helped start an effort to track international cargo.<sup>3</sup>\n  </p>\n  <p>The Diamond industry has succeeded already in implementing the blockchain tech to guarantee against blood diamonds.<sup>4</sup> \n  <p class=\"cite\">1. <a href=\"https://www.seattletimes.com/seattle-news/health/wa-state-health-officials-5-people-sick-from-romaine-lettuce-e-coli-outbreak/\" target=\"_blank\">https://www.seattletimes.com/seattle-news/health/wa-state-health-officials-5-people-sick-from-romaine-lettuce-e-coli-outbreak/</a></p>\n  \n  <p class=\"cite\">2. <a href=\"https://www.cdc.gov/ecoli/2018/o157h7-04-18/index.html\" target=\"_blank\">https://www.cdc.gov/ecoli/2018/o157h7-04-18/index.html</a></p>\n  \n  <p class=\"cite\">3. <a href=\"https://www.bloomberg.com/amp/news/articles/2018-04-26/ibm-s-blockchain-tech-to-track-jewels-from-mine-to-retail-stores\" target=\"_blank\">https://www.bloomberg.com/amp/news/articles/2018-04-26/ibm-s-blockchain-tech-to-track-jewels-from-mine-to-retail-stores</a></p> "
  },
  {
    "id": "18",
    "did": "18-04-24",
    "date": "April 24, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "Westworld",
    "post": "<p class=\"firstparagraph\">Westworld's second season premiered this week to cult-like fanfare.<sup>1</sup> Much of the HBO's storyline follows usual near-future AI potential, but brings up moral issues about what separates humankind from the rest of the animal kingdom. The premise of the show, and the current state of A.I., is instinctual learning and behavior of A.I.--i.e. imitating animal-behavior, but not human. </p>\n  <p>I had the good luck of spending the Fall of 2016 in the Silicon Valley of A.I. technology, which is Montr&eacute;al, Qu&eacute;bec (For example, UdeM was awarded $100 million in research money from Facebook). Though I was there for a Sociology PhD, I still got to get involved like any technology groupie would...  The rock-star out there is Universit&eacute de Montr&eacute;al's Dr. Yoshua Bengio,<sup>3</sup> who explains the consciousness elements of A.I, and how those compare with our own representations:\n  </p>\n  <p class=\"quote\">\n  With supervised learning, humans provide the high-level concepts that the computer learns, which can be tedious and limits the ability of computers to discover things by themselves. Unsupervised learning, or what we call reinforcement learning, is when the learner is not merely passively observing the world, or how humans do things, but interacts with the environment and gets feedback. Humans are good at this. Combining unsupervised deep learning and reinforcement learning is one of the things that I am working on.<sup>2</sup>\n  </p> \n  <p>So, here we see how Yoshua Bengio  explains that <i>building of meaning, symbolic representation as the key impediment</i>. To get around this, representations are <i>factorialized</i>, which is a clean way of saying multiple levels/dimensions of classification trees:</p>\n  <p class=\"quote\">For more than a decade, my research has focused on the notion of learning better representations, which is the heart of deep learning, in particular, representations that have a property called disentangled. Disentangled separates the different concepts and different explanations - we call them factors - that explain the data, that explain what the agent sees around it, and that explain how the agent patrols the world. Disentangled captures some of the causality that explains what we are seeing and what the computer is seeing.<sup>2</sup>\n  </p>\n  <p>\n  I think it's exciting subject matter, and perhaps many would be less apprehensive if they thought of A.I. as achieving the behavior and  <i>predictable mind of pets</i>.  Pets and service pets can be a reassuring thought--even for A.I. pessimists like Elon Musk. Pets... Who doesn't imagine a shaggy Saint Bernard, with a first-aid kit and a flask arriving to the rescue on a snowy Alpine mountain slope? I can imagine a mechanical Saint Bernard, and with that in mind I would love to visit Westworld--albeit not without a white hat ... \n  <p class=\"cite\">1. <a href=\"https://www.hbo.com/westworld\" target=\"_blank\" >https://www.hbo.com/westworld</a>\n  </p>\n  \n  <p class=\"cite\">2. <a href=\"http://www.iro.umontreal.ca/~bengioy/yoshua_en/index.html\" target=\"_blank\" >http://www.iro.umontreal.ca/~bengioy/yoshua_en/index.html</a>\n  </p>\n  \n  <p class=\"cite\">3. <a href=\"https://www.forbes.com/sites/peterhigh/2017/11/06/why-montreal-has-emerged-as-an-artificial-intelligence-powerhouse/#7435a66123bd\" target=\"_blank\" >https://www.forbes.com/sites/peterhigh/2017/11/06/why-montreal-has-emerged-as-an-artificial-intelligence-powerhouse/#7435a66123bd</a>\n  </p>"
  },
  {
    "id": "17",
    "did": "18-04-23",
    "date": "April 23, 2018<br /> ",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": " The Bright New Horizon for Tech Jobs",
    "post": "<p class=\"firstparagraph\">The<i> burgeoning Tech Job Market</i> has been one of my favorite blog topics. Two months ago, my <a href=\"#18-02-23\">Feb. 23rd blogpost</a> and again on <a href=\"#18-03-08\">March 8th</a> I mentioned 1.4 million new tech jobs, 20% growth year-over-year. And so, yours truly has decided to enter into this market after a post-graduate period of contracting and free-lance work. Let's face it, there's no substitute for the stability and the fixed schedule, plus the coffee-machine conversations are never short of endearing! </p>\n\n\n  <p>So far on day 2 (Friday, the 21st was my ceremonial first day of \"putting myself out there\"). I've thought to start slow, while I gauge the territory, but Indeed and Linkdin are always safe bets to begin with. All in all, my general take is that this new job front, with hundreds of thousands of jobs month-over-month is for everyone. Most positions offer 9-12 weeeks training -- who ever said changing careers had to be shouldered on our own? HR is there! </p>\n  <p>As I am a night-blogger, therefore my new position--where and whichever it will be, won't interfere with my blogging--after all, I have truly enjoyed watching my readership grow, month-by-month ... so, thank you, dear tech readers. As such, perhaps along the way I can lend a view from the job-front, and any new trends I observe.</p>\n  <p>Examples aren't hard to find. I've noticed that since the last time I've checked out the job market, the pre-assessment tests are a bit more cognitive than previous years, which is good for strong test-takers--especially those that love to calculate the \"arrival times of two separate trains leaving the same station at two different rates of speed ....\". 50 questions in 15 minutes makes for a nice adrenaline rush--on par with a short run!  </p>"
  },
  {
    "id": "16",
    "did": "18-04-21",
    "date": "April 21-22, 2018<br />Weekend  ",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "  Earth needs Technology as much as Tech needs the Earth",
    "post": "<p class=\"firstparagraph\">Palladium, micrograms of Gold and Silver, and of course, the yttrium, the lanthanum, without forgetting good old terbium, then a dusting of neodymium, a dash of gadolinium and and finally a sprinkle of praseodymium. The ingredients for a typical iphone are not a luxury, but a <i>sine qua non</i> necessity, while the irreplaceable, increasingly difficult-to-mine metal supply <i>reminds us we do have a Mother to heed to</i>.<sup>1</sup>  \n  </p>\n  <p>Tech's relationship with the Earth is very symbiotic, in that Earth's problems are increasingly dependent on Tech's promise for scalable, innovative solutions beyond Humankind's reach. So, much like the clean-energy infrastructure will depend on fossil fuels to be built, tech hardware will depend on more difficult mining. But to what end? With growing national and corporate competitiveness on a more crowded, more connected globe, the race is on to achieve sustainability with both.   </p><p>\n  But the story isn't about Tech here on Earth Day - the story is the Earth's, and why the Earth's Superman, Technology, will come down from the sky to save the day ...\n  </p>\n  <img class=\"zoom\" src=\"./dist/img/metal.jpg\" width=\"350px\" />  <br />\n  <p class=\"cite\">2. <a href=\"http://www.bbc.com/future/story/20161017-your-old-phone-is-full-of-precious-metals\" target=\"blank\">http://www.bbc.com/future/story/20161017-your-old-phone-is-full-of-precious-metals</a>\n  </p>"
  },
  {
    "id": "15",
    "did": "18-04-20",
    "date": "April 20, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "omputing Arts and Innovation, Part II:<br />Constraints of Distributed Ledger Technology",
    "post": "<p class=\"firstparagraph\">Speed versus scalability. Security versus user-experience. Stability versus complexity. Ethereum, along with other blockchain developers, inhabit a virtual reality, a reality in which application uses and perils are not fully conceivable. Traditional app-developers, long habituated to the centralized server and popular usage--not to mention any regulation--to know the lines in the sand, which constrain a developer. The decentralized app (DAPP) developers have no such luxury, except to abide by a certain golden rule; a single rule that sustains crypto-tech's very existence: The Rule of Trust, without which blockchain tech has nothing to offer. \n  </p>\n  \n  <p>The very premise of designing distributed ledger platforms hinges on placing a platform's cryptographic, algorthmic design at the center, the link between every user. This trust, <i>built on mathematical proofs,</i> ensures peer-to-peer transactions in which  <i>neither party needs to trust the counter-party, nor any third-party.</i>We trust in the cryptography that our transaction will be fulfilled: In Math We Trust. </p> <br />\n  "
  },
  {
    "id": "14",
    "did": "18-04-19",
    "date": "April 19, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Energy Alternatives Signal the Power Shift to Come",
    "post": " \n  <p class=\"quote\">“I think great artists and great engineers are similar, in that they both have a desire to express themselves. In fact some of the best people working on the original Mac were poets and musicians on the side.” <sup>1</sup><br /> – Steve Jobs</p><br />\n  <p class=\"firstparagraph\">Words, Sentences, Paragraphs. Variables, Functions, Modules.  With so many languages used for different purposes by different organizations, syntax is more than 4-space indents, variable name-spaces, and other formalities. Today, the variety of coding languages and scripts can appear more complicated than is/+*- the case: After all, all computer <i>languages boil down to the same primary tasks: for &amp; while loops, if-then statements, variable declarations, scope considerations, etc ...</i>     \n  </p>\n  <p>So what am I getting at? Coding innovation is an art form that surpasses science and knowledge. For example,   coding practices improve with clarity, simplicity, modularity, and so on... but is there an authoritative <i>school of thought</i> on this art? Well, in the Python world, all eyes turn to the Zen of Python, and some say other languages should emulate its philosophy, so let's hear it:</p>\n  <p class=\"quote\">\n  <strong>The Zen of Python</strong><br /><br />\n  \n  Beautiful is better than ugly.<br /><br />\n  \n  Explicit is better than implicit.<br /> <br />\n  \n  Simple is better than complex.<br /> <br />\n  \n  Complex is better than complicated.<br /> <br />\n  \n  Flat is better than nested.<br /> <br />\n  \n  Sparse is better than dense.<br /> <br />\n  \n  Readability counts.<br /> <br />\n  \n  Special cases aren't special enough to break the rules.<br /><br />\n  \n  Although practicality beats purity.<br /><br />\n  \n  Errors should never pass silently.<br /><br />\n  \n  Unless explicitly silenced.<br /><br />\n  \n  In the face of ambiguity, refuse the temptation to guess.<br /><br />\n  \n  There should be one-- and preferably only one --obvious way to do it.<br /><br />\n  \n  Although that way may not be obvious at first unless you're Dutch.<br /><br />\n  \n  Now is better than never.<br />\n  <br />\n  Although never is often better than *right* now.<br /><br />\n  \n  If the implementation is hard to explain, it's a bad idea.<br /><br />\n  \n  If the implementation is easy to explain, it may be a good idea.<br /><br />\n  \n  Namespaces are one honking great idea -- let's do more of those! <sup>2</sup><br />\n  \n  <br />\n  --Pythoneer Tim Peters\n  </p>\n  <p>I get it, good coding is more than intuitive art, it's walking the high road without regard for shortcuts. And I can see that <i>in uncharted waters, intuition has to be constrained by sound reason.</i> And who hasn't been burned by artful exploration, fancy coding, and far-fetched architectures? So where does the balance lie? Again we must turn to Steve Jobs on the \"intersection of the humanities and science,\": </p>\n  <p class=\"quote\">There are a lot of people innovating, and that's not the main distinction of my career. The reason Apple resonates with people is that there's a deep current of humanity in our innovation. I think great artists and great engineers are simi.ar in that they both have a desire to express themselves. In fact some of the best people working on the original Mac were poets and musicans on the side. In the seventies computers became a way for people to express their creativity. Great artists like Leonardo da Vinci and Michelangelo were also great art science. Michelangelo knew a lot about how to quarry stone, not just how to be a sculptor.\" <sup>1</sup><br />--Steve Jobs\n  <p class=\"continue\">I could not imagine a computing world were it not for the personalization that Apple introduced to the world, to us all. After all, I recall I was first transfixed in 1984, there I was a seven-year-old staring into the bright green letters   of my   Apple IIe ... </p>\n  <p>So, in this era of the algorithmic wild-west and impending regulations on data privacy, inter-app permissions, coupled with data breaches every week, how might regulations avoid stifling innovation? Steve Jobs didn't have rules as much as Mark Zuckerberg didn't have any rules. So, it's a relief that Zuckerberg, with intimate knowledge of innovation, can set his teams to work with Congress going forward, especially as Facebook conforms to the E.U.'s <i>General Data Privacy Regulations (GDPR) implementation this May.</i> I for one hope that freedom for creative innovation will stay alive, even in the face of   growing bureaucracy in the web.   \n  <p class=\"cite\">1. <a href=\"https://books.google.com/books?id=cf_2PBPP-rEC&printsec=frontcover\" target=\"blank\">Isaacson, Walter. Steve jobs. JC Lattès, 2011.</a>\n  </p>\n  <p class=\"cite\">2. <a href=\"https://www.python.org/dev/peps/pep-0020/\" target=\"blank\">https://www.python.org/dev/peps/pep-0020/</a>\n  </p>"
  },
  {
    "id": "13",
    "did": "18-04-18",
    "date": "April 18, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Blockchain Types and Trade-offs",
    "post": "\n  <p class=\"firstparagraph\">Bitcoin's rise to prominence, the mystery of Satoshi Nakamoto's identity--i.e., author of <a href=\"dist/docs/bitcoinWhitePaper.pdf\" target=\"_blank\"> the original Bitcoin White Paper</a>, and the platform's reliability (outside of value fluctuations) all add to the mystique of the crypto-currency.  Yet,     new advances and types, i.e. \"groupings\" of blockchain technology are not necessarily \"replacing\" their predecessors, but rather filling different blockchain needs; Needs that include speed of transactions, truly public distributed ledgers, safety from forking and DDOS attacks.  Since 2008,   groups of competing platforms follow a timeline, but should not be thought of as a cyclical evolution but rather growing tree branches that form \"groups\".  Bitcoin, Litecoin are first generation, while Ethereum and Ripple are 2nd generation with crypto-contract capability, and finally Iota and Swirlds' Hedera Hashgraph represent   3rd generation <i>directed-acyclic-graphs (DAG), whose transaction speed actually  increases</i> with number of nodes.\n  </p>\n  <p>Each of these groupings shouldn't be seen as making the previous design obselete: They   serve different purposes. Bitcoin can never serve micro-transactions and the micro-economy because it can only handle 6 transactions per second (TPS), while Ethereum can handle 12 or so. However, micro-transaction industries require TPS in the hundreds of thousands! Only the 3rd gen  crypto-currency architecture   achieves TPS <i>ad infinitum</i> because it's scalability increases with size. The catch? DAG's are necessarily private entities, rather than the original two generations that are by nature public, yet can be privatized. 3rd generation DAGs are the opposite: They are by default private, and cannot truly be distributed without management. Further, <i>Swirlds Hashgraph has patented their source code, which contradicts many principles of blockchain technology</i>, beginning with core tenets  of the original crypto-currency white paper, published in October 2008. For history\n  's sake, here's a quick view of the Bitcoin paper's abstract:</p>\n  <p class=\"quote\"><strong>Abstract.</strong> A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution. Digital signatures provide part of the solution, but the main benefits are lost if a trusted third party is still required to prevent double-spending. We propose a solution to the double-spending problem using a peer-to-peer network. The network timestamps transactions by hashing them into an ongoing chain of hash-based proof-of-work, forming a record that cannot be changed without redoing the proof-of-work, forming a record that cannot be changed without redoing the proof-of-work. The longest chain not only serves as proof of the sequence of events witnessed, but proof that it came from the largest pool of CPU power. As long as a majority of CPU power is controlled byi nodes that are not cooperating to attack the network, they'll generate the longest chain and outpace attackers. The network itself requires minimal structure. Messages are broadcast on a best effort basis, and nodes can leave and rejoin the network at will, accepting the longest proof-of-work chain as proof of what happened while they were gone.<sup>1</sup></p>\n  \n  <p>Irrespective of crypto-currency or crypto-contract, there seems to be a different kind of jump from 2nd generation to 3rd generation blockchain, rather than a progression. Research needed to fork into a different direction is because of the need for instantaneous, ordered transactions, which can never be provided by a blockchain design which \"syncs\" every 5 to 10 minutes. </p>\n  <p> So, what is this 3rd generation design? Instead of a singular block encapsulated in linked cryptographic, historical ledger blocks, hashgraph uses a \"tangle\" of one-way (directed-acyclic) network connections. This means that speed increases with the number of nodes, overcoming the Bitcoin micro-transaction problem. <i>In sum, near-instantaneous updates for financial, betting, gaming and social-media data needs are solved by the  third-generation DAG</i>, while longer-term and truly distributed blockchain needs will always be the terrain of first and second generation blockchain technology. So, given that Swirlds' Hedera Hashgraph will be unveiling their platform next month,   blockchain critics and enthusiasts can and should read between the lines, er, I mean-- read  between the nodes ...</p><br />\n  <p class=\"cite\">0.  Topic addressed in <a href=\"#18-04-02\">April 2nd blogpost</a></p>\n  <p class=\"cite\">1.<a href=\"https://bitcoin.org/bitcoin.pdf\" target=\"_blank\">https://bitcoin.org/bitcoin.pdf\n  </a> </p>\n  <p class=\"cite\">2.<a href=\"http://www.the-blockchain.com/2018/03/20/hedera-plans-speedier-safer-more-democratic-blockchain-alternative-hashgraph/\" target=\"_blank\">http://www.the-blockchain.com/2018/03/20/hedera-plans-speedier-safer-more-democratic-blockchain-alternative-hashgraph/\n  </a> </p>\n  <p class=\"cite\">3. <a href=\"https://s3.amazonaws.com/hedera-hashgraph/hh-whitepaper-v1.0-180313.pdf\" target=\"_blank\">https://s3.amazonaws.com/hedera-hashgraph/hh-whitepaper-v1.0-180313.pdf</a> </p>"
  },
  {
    "id": "12",
    "did": "18-04-17",
    "date": "April 17, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "Dictionaries and the Joys of Abstraction",
    "post": " \n  <p class=\"firstparagraph\">Dictionaries and libraries place the programmer into a once-in-a-lifetime opportunity to ride the lightning of the open-source community. Volunteers and corporate sponsors take the credit for the enormous effort making a  near limitless selection of functions, dictionaries and modules for languages such as  JavaScript and Python programming.<sup>1</sup> Today, a programmer can   put together JavaScript Components and Modules with less thought about syntactical logic, and more consideration for the problem at hand. \n  </p>  \n  <p class=\"quote\">Each significant piece of functionality in a program should be implemented in just one place in the source code. Where similar functions are carried out by distinct pieces of code, it is generally beneficial to combine them into one by abstracting out the varying parts.</br ></br >\n  --Benjamin C. Pierce</p>\n  <p>There are a few hundred thousand packages in the JavaScript <i> Node.js package ecosystem</i>, with billions of downloads per month. This unprecedented global collaboration, sharing open-source code into the community, means a more humanized, higher-level programming tasks-- a boon for the many coding-converts joining the tech economy. Such optimism means that problem-solving is fast and flexible, especially in the world of Stack Overflow--another phenomenon of global collaboration.\n  </p>\n  <p class=\"quote\">[Abstraction] tries to factor out details from a common pattern so that programmers can work close to the level of human thought, leaving out details which matter in practice, but are immaterial to the problem being solved.</p>\n  \n  <p class=\"quote\">The effective exploitation of the powers of <i>abstraction</i> must be regarded as one of the most vital activities of a   programmer ...<sup>2</sup> <br /><br />\n  --Edsger W. Dijkstra</p>\n  <p>These words mean programmers can do what they do best, as much as   what the client-user does best, too: think and problem-solve like a human, rather than a robot. </p>\n  <p class=\"cite\">1.<a href=\"https://nodesource.com/blog/npm-is-massive/\" target=\"_blank\">https://nodesource.com/blog/npm-is-massive/\n  </a> </p>\n  \n  <p class=\"cite\">2.<a href=\"http://www.cs.utexas.edu/~EWD/\" target=\"_blank\">http://www.cs.utexas.edu/~EWD/\n  </a> </p> "
  },
  {
    "id": "11",
    "did": "18-04-16",
    "date": "April 16, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Zuckerbergs \"Invitation\" to the European Union Kindly Declined:<br /> How the 28-nation European Unions Privacy Regulations affect Facebook, and eventually us",
    "post": " \n  <p class=\"firstparagraph\">E.U.'s Parliament has   invited Zuckerberg to speak with member-states in Brussels to discuss both the upcoming <i>General Data Protection Regulation (GDPR)</i> new rules, along with the 2.7 Europeans, whose data also was sold to Cambridge Analytica.<sup>1</sup> Not exactly an invitation to the Ball...\n  </p>\n  <p class=\"quote\">The Brussels-based commission said [European Commission Vice-President] Ansip would also meet with Google Chief Executive Officer Sundar Pichai, Twitter General Counsel Sean Edgett and Netflix General Counsel David Hyman in individual meetings to talk about data protection, online privacy, illegal content, disinformation campaigns, digital copyright and artificial intelligence.<sup>2</sup></p> \n  <p>These are more than talking points, as they are already codified within the GDPR and to implemented next month--compliance with European law will be a mad dash for developers.</p>\n  <p> This predicament illuminates a smaller world, along with increasing complications of globalization, thanks to tech--for better or worse. Ultimately, Facebook, Google, and other tech giants will need to overhaul their permissioning code to abide by European law, but after last week's Congressional appearence, it's hard not to wonder if pan-industry data privacy adjustments will lead to a new <i>de facto regulation</i>, based on tech culture instead of politicians and legislators ...  \n  </p>\n  <p class=\"cite\">1.<a href=\"https://www.washingtonexaminer.com/policy/technology/eu-steps-up-pressure-on-mark-zuckerberg-to-testify-about-facebook-privacy\" target=\"_blank\">https://www.washingtonexaminer.com/policy/technology/eu-steps-up-pressure-on-mark-zuckerberg-to-testify-about-facebook-privacy\n  </a> </p> \n  <p class=\"cite\">2.<a href=\"https://www.bloomberg.com/news/articles/2018-04-16/facebook-s-zuckerberg-leans-in-to-meet-with-eu-digital-chief\" target=\"_blank\">https://www.bloomberg.com/news/articles/2018-04-16/facebook-s-zuckerberg-leans-in-to-meet-with-eu-digital-chief\n  </a> </p> "
  },
  {
    "id": "10",
    "did": "18-04-14",
    "date": "April 14-15, 2018<br /> Weekend",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "Clash of the Brick &amp; Mortars against Online Stores",
    "post": "<p class=\"firstparagraph\">This week, the Supreme Court   revisits its 1992 decision not requiring state sales taxes for online purchases.<sup>1</sup> Although big-box stores like Amazon, Walmart, etc. <i>do</i> pay state taxes among the 45 states requiring it, small- and medium-sized retailers do not need to collect sales taxes in any state where they do not have physical presence, also known as \"nexus.\" But, beginning this Tuesday, the free ride may come to an  end; this includes small retailers that comprise half of Amazon's 3rd-party online sales.\n  </p>\n  <p class=\"quote\">  \n  \n  A reversal could mean that all online retailers must collect sales tax everywhere. It's an issue that brick-and-mortar retailers insist will provide a level playing field with online competitors, and help to provide state and local governments with the tax revenue they deserve.<sup>2</sup></p>\n  <p> Livelihoods hang in the balance, so whatever the gavel settles on, let's hope for the best! The Blockbuster-ization of so many brick-and-mortars seems to claim a new victim every month--recently Toys 'R Us  meeting its demise.<sup>3</sup> So, with as many that have disappeared, big and small-, its a curiosity if maybe Tuesday breathes life into the boarded store-fronts across America. I think others share my view that shopping is more than shiny packaging at the doorstep: it's much more the ceremony and gala in the store - a  real shared moment with strangers, acquaintances and loved ones that makes for better packaging, a package embellished with a story.   \n  </p>\n  <p class=\"cite\">1.<a href=\"https://www.forbes.com/sites/janetwburns/2018/04/15/supreme-court-decision-could-bring-sales-tax-to-more-online-shopping/#2a0ea38f3daf\" target=\"_blank\">https://www.forbes.com/sites/janetwburns/2018/04/15/supreme-court-decision-could-bring-sales-tax-to-more-online-shopping/#2a0ea38f3daf\n  </a> </p>\n  <p class=\"cite\">2.<a href=\"http://money.cnn.com/2018/04/15/technology/online-purchases-sales-taxes-supreme-court/index.html\" target=\"_blank\">http://money.cnn.com/2018/04/15/technology/online-purchases-sales-taxes-supreme-court/index.html\n  </a> </p>\n  <p class=\"cite\">3.<a href=\"https://www.washingtonpost.com/news/business/wp/2018/04/13/this-billionaire-toy-executive-has-a-last-ditch-mission-to-save-toys-r-us-before-its-too-late/?noredirect=on&utm_term=.b3201ad77891\" target=\"_blank\">https://www.washingtonpost.com/news/business/wp/2018/04/13/this-billionaire-toy-executive-has-a-last-ditch-mission-to-save-toys-r-us-before-its-too-late/?noredirect=on&utm_term=.b3201ad77891\n  </a> </p> "
  },
  {
    "id": "9",
    "did": "18-04-13",
    "date": "April 13, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Bitcoins &amp; Browsers: A Glance at Bitcoin Distributed Mining  ",
    "post": "\n  <p class=\"firstparagraph\">For all the clamor about Bitcoin's carbon footprint, who doesn't love the sound of money?  And, for all the pitfalls of Iota and the ever-evolving Ethereum (and ever-present threat of forking), Bitcoin stands true among the crypto-currency platforms. Keeping it Simple,   the very limited, non-crypto-contract may just be Bitcoin's virtue. In a rocky world, <i>a plain, no-frills crypto-currency with stability</i> is incomparable to crypto-contract powers, that are not fully stable, like Ethereum and Iota.  </p>\n  <p>So, it's living the dream, but must it be so cost-intensive? Maybe, Maybe not, but where does the future lie for all that hardware? Where does the browser fit into this? First, what's going on under the hood: Note this article is older, but accurate in explanation--except for references to Bitcoin's value! </p>  \n  \n  <p class=\"quote\">New bitcoins are created roughly every 10 minutes in batches of 25 coins, with each coin worth around $730 at current rates. [A typical home-] computer ... is racing thousands of others to unlock and claim the next batch.</p>\n  <p class=\"quote\">\n  Let’s start with what it’s not doing.  \n  Your computer is not blasting through the cavernous depths of the internet in search of digital ore that can be fashioned into bitcoin bullion. There is no ore, and bitcoin mining doesn’t involve extracting or smelting anything. It’s called mining only because the people who do it are the ones who get new bitcoins, and because bitcoin is a finite resource liberated in small amounts over time, like gold, or anything else that is mined. (The size of each batch of coins drops by half roughly every four years, and around 2140, it will be cut to zero, capping the total number of bitcoins in circulation at 21 million.) But the analogy ends there.\n  </p><p class=\"quote\">\n  What bitcoin miners actually do could be better described as competitive bookkeeping. Miners build and maintain a gigantic public ledger containing a record of every bitcoin transaction in history. Every time somebody wants to send bitcoins to somebody else, the transfer has to be validated by miners: They check the ledger to make sure the sender isn’t transferring money she doesn’t have. If the transfer checks out, miners add it to the ledger. Finally, to protect that ledger from getting hacked, miners seal it behind layers and layers of computational work—too much for a would-be fraudster to possibly complete.<sup>1</sup>\n  </p>\n  \n  <p>So all of this hard work <i>can be distributed</i> across browsers, which improves its energy-expensive plight. I wouldn't recommend running the demo in the article link below as it may overheat your device--it had my fan running double-time. But the internals are using JavaScript code for the math. Here's a look under the hood, and it's nice to see the role of <i>JavaScript graphics library, called D3JS, (Data Driven Documents)</i> playing a central role. So, below you see the browser accepting the SHA256 Hash along with the Bitcoin Owner's Address, and the JavaScript in the browser passes off calculations to the C++ running the JavaScript V8 engine on your computer. </p>\n  <img src=\"./dist/img/miningBlockchainD3.PNG\" class=\"zoom\" width=\"450px\" />\n  <p>And so, what does it mean to mine Bitcoins across browsers in a distributed fashion? It is similar to the same concept as Ethereum's direction (or at least idealized by its architect, Vitalik Buterin), in running the Ethereum Virtual Machine blockchain across all the browsers that download its GETH software. Nonetheless, here's a succinct explanation of the browser's role,again from Quartz: </p>\n  <p class=\"quote\">Mining’s ultimate purpose is to prevent people from double-spending bitcoins. But it also solves another problem. It distributes new bitcoins in a relatively fair way—only those people who dedicate some effort to making bitcoin work get to enjoy the coins as they are created.\n  But because mining is a competitive enterprise, miners have come up with ways to gain an edge. One obvious way is by pooling resources.<br /><br />\n  \n  \n  Your machine, right now, is actually working as part of a bitcoin mining collective that shares out the computational load. Your computer is not trying to solve the block, at least not immediately. It is chipping away at a cryptographic problem, using the input at the top of the screen and combining it with a nonce [run-time, generated random number calculated only once, then discarded], then taking the hash to try to find a solution. Solving that problem is a lot easier than solving the block itself, but doing so gets the pool closer to finding a winning nonce for the block. And the pool pays its members in bitcoins for every one of these easier problems they solve.</p>\n  <p>In practice, distributed mining pays off quite well   for the owners of that address. My blogposts on <a href=\"# <a href=\"#18-02-28\">February 26th  </a> and <a href=\"#18-02-28\">Feb. 28th about blockchain sustainability</a> paint a less rosy picture of tying the currency value to the cost of energy, but multiple solutions and fixes exist to distribute the energy load to laptops on clean renewables, the mining cooperative way ... after all, who ever said money had to be so expensive? </a> \n  <p class=\"cite\">1.<a href=\"https://qz.com/154877/by-reading-this-page-you-are-mining-bitcoins/\" target=\"_blank\">https://qz.com/154877/by-reading-this-page-you-are-mining-bitcoins/\n  </a> (The article link is harmless, but wouldn't recommend running it if low on batteries--it doubled the fan speed)</p>  "
  },
  {
    "id": "8",
    "did": "18-04-12",
    "date": "April 12, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Algorithms and A.I.<br />Scalability &amp; Costs   of Data Privacy Policies",
    "post": "  <p class=\"firstparagraph\">  Data privacy regulation's challenge begins with five million apps between Apple and Android stores. Countless vulnerabilities, not to mention different standards and languages across the app world. <i>Like all Tech problems,</i>scalability requires Tech problem-solving--</i>in this case implying artificial intelligence.  About A.I., Zuckerberg remarks:</p>  \n  <p class=\"quote\"> There are some really nuanced questions, though, about how to regulate [data] which I think are extremely interesting intellectually. So the biggest one that I’ve been thinking about is this question of: To what extent should companies have a responsibility to use AI tools to kind of self-regulate content?<sup>1</sup>\n  </p>\n  <p>However such musing goes, the European Union's May 14th implementation takes a <i>direct stand against the concept of algorithm use with data</i>, which begs the A.I. question again. </p>\n  <p class=\"quote\">The European law gives individuals the right not to be subject to completely automated  decisions which significantly affect them. These decisions could include credit algorithms that use an individual’s data to decide whether a bank should grant him or her a loan.  \n      Privacy International said the clause on automated decisions could allow consumers to challenge Facebook practices like political advertising, which can be sent to users based on algorithms, because the ads are meant to sway users’ votes.<sup>2</sup></p>\n  <p>I think the E.U. data policy model is intelligent - who would have thought to re-humanize our personal data   by taking it away from algorithms, without our permission. I like that, after all, who likes to be unknowingly judged? Least of all by a robot!\n\n  </p>\n      <p class=\"cite\">1.<a href=\"https://www.wired.com/story/mark-zuckerberg-talks-to-wired-about-facebooks-privacy-problem\" target=\"_blank\">https://www.wired.com/story/mark-zuckerberg-talks-to-wired-about-facebooks-privacy-problem\n  </a></p>  \t\n  <p class=\"cite\">3. <a href=\"https://www.nytimes.com/2018/04/08/technology/a-tough-task-for-facebook-european-type-privacy-for-all.html?ribbon-ad-idx=2&rref=technology&module=Ribbon&version=context&region=Header&action=click&contentCollection=Technology&pgtype=article\" target=\"_blank\">https://www.nytimes.com/2018/04/08/technology/a-tough-task-for-facebook-european-type-privacy-for-all.html \n  </a> </p>  "
  },
  {
    "id": "7",
    "did": "18-04-11",
    "date": "April 11, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "When a Pickpocket is Pickpocketed:<br />Part III. The Path toward Sound Data Privacy Policy",
    "post": "<p class=\"firstparagraph\">Day two of Congressional hearings over Facebook's Data Privacy and Protections  were better articulated than the first day. Important dialogue surrounded primarily   two data privacy topics: First, financial transparency surrounding ads and political ads based on the <i>Honest Ads Act</i>, for which Zuckerberg pledged support<sup>1</sup>. \n  </p>\n  <p>Second, and   more far-reaching, discussion of the <i>Browser Act</i> also was raised by several House members. While responding to the Act's sponsor, Marsha Blackburn of Tennessee, Zuckerberg expressed interest in working together. This bill is not well known, but aims to set prudent, consistent guidelines of privacy in the hands of the consumer. </p>\n  <p class=\"quote\"> [Blackburn's] new bill targets the full spectrum of the internet, including web giants like Amazon and Google. In Blackburn’s words, it moves the government “to a posture where we have one regulator, one set of rules [and] everybody knows who’s in charge,” she told Recode.<sup>3</sup></p>\n  <p>So, however the power struggle goes, a <i>shared technology lexicon</i> clarifies that shades of meaning make enormous difference, depending on \"what\" an entity is--whether a technology is a Platform as a Service  versus media outlet or strictly merchant-based. Hopefully, <i>Tech will lead the way</i> without ceding authority in the process: </p>\n  <p class=\"quote\">\n    But the Tennessee lawmaker’s effort hasn’t won any allies among privacy-conscious consumer groups, like the American Civil Liberties Union, which doubt Blackburn’s methods. And her bill has already prompted a whole new round of fierce lobbying by tech and telecom giants, which don’t see the need for any new regulation at all.\n    </p> \n  <p class=\"quote\">\n  “I think that, in concept, the idea that there should be stronger privacy standards for edge providers and internet service providers is right,” said Neema Singh Guliani, the legislative counsel at the ACLU.</p>\n  <p class=\"quote\">\n  But Blackburn, she added, should have gone about it differently. “The way to do it was not ... [through] gutting the FCC’s rules; the way to do it was actively working on a replacement.”<sup>3</sup>\n  </p>\n  <p>The bill is similar to the European data privacy model, <i>E.U. General Data Protection Regulation(GDPR)</i>, which serves as point of reference.<sup>2</sup> On May 14,   Europeans will   be implementing a pan-internet--edge and ISP--data protections, which include e-mail, Facebook and other apps, equally as for Comcast and Verizon, and industry-wide privacy defaults; Further, opt-in for privacy is more meaningful separate, and  not relegated to the main Terms and Conditions.<sup>3</sup></p>\n  <p>Policy regulation in other industries--exemplified by medical <i>HIPAA</i>, financial <i>Fair Credit   Reporting Act</i>--reveals the noticeable absence of similar policy in Tech. Tech's regulation is however necessarily far more complex, involving at minimum trade-offs between app-to-app data portability and new boundaries for different sources and forms of data. Clearly, the browser-based, high-security HTTPS Encryption I mentioned in my <a href=\"#18-04-06\">April 6 three-part series on Progressive Web Apps </a>will undoubtedly be used for quick, inexpensive data privacy compliance, <i>a real boon for JavaScript developers</i>--as if there wasn't enough work already!\n  </p> \n  <p class=\"cite\">2. <a href=\"https://www.eugdpr.org\" target=\"_blank\">https://www.eugdpr.org\n  </a></p>  \n  \n          <p class=\"cite\">3. <a href=\"https://www.recode.net/2017/5/24/15685870/new-republican-privacy-bill-tech-telecom-lobbying-fcc-congress\" target=\"_blank\">https://www.recode.net/2017/5/24/15685870/new-republican-privacy-bill-tech-telecom-lobbying-fcc-congress\n          </a></p>  \n      <p class=\"cite\">3. <a href=\"https://www.nytimes.com/2018/04/08/technology/a-tough-task-for-facebook-european-type-privacy-for-all.html?ribbon-ad-idx=2&rref=technology&module=Ribbon&version=context&region=Header&action=click&contentCollection=Technology&pgtype=article\" target=\"_blank\">https://www.nytimes.com/2018/04/08/technology/a-tough-task-for-facebook-european-type-privacy-for-all.html \n      </a> </p>  \n  <p class=\"cite\">4. <a href=\"https://www.reuters.com/article/us-facebook-privacy-zuckerberg/zuckerberg-resists-effort-by-u-s-senators-to-commit-him-to-regulation-idUSKBN1HH1CU\" target=\"_blank\">https://www.reuters.com/article/us-facebook-privacy-zuckerberg/zuckerberg-resists-effort-by-u-s-senators-to-commit-him-to-regulation-idUSKBN1HH1CU\n  </a></p>  "
  },
  {
    "id": "6",
    "did": "18-04-10",
    "date": "April 10, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "When a Pickpocket is Pickpocketed:<br />  Part II:  \"Semantic Polymorphism\", i.e., Double Talk about  Data ",
    "post": " \n  <p class=\"firstparagraph\">Mark Zuckerberg daftly played word-tennis with   Senators in the first day of Congressional Hearings on Facebook Data Privacy issues. Although, in this case, <i>there were two, at times three, tennis balls at play!</i> What I mean is that \"Data\" and \"Personal Data\" vaccilated in meaning:  At times, Senators' questions referred to, 1.) personally identifiable data with intimate personal details, full name, location data (sensitive-data); 2.) Other times questions referred to <i>derivative data, i.e. data wrangled, refined, merged with different datasets</i> (composite-data); and,  3.) sometimes the questions meant the harmless, identity-encrypted \"ad-data\"(anonymized-data); but, usually, Zuckerberg responded to a question about one of these three meanings of \"personal data\", by responding with a non-abstract fourth: 4.) \"Senator, the data, the 'likes' and pictures you share with Facebook, they are your property,\" Zuckerberg would answer. Well, thank goodness! </p>\n  <p> My blogpost talks about the shades of meaning: We all know the light-hearted awkwardness when a conversation splits into two separate threads because each party unknowingly follows differing meanings from the same word, or idea.  Austin Powers would have more fun with it, but the Sociologists typically call it  a <i>Semantic Predicament</i>.<sup>1</sup></p> \n  <p>In fairness, Mark Zuckerberg volunteered as he himself was not subpoenaed, and therefore this preliminary, public discourse was critical for creating shared meaning and language about a complex topic. By volunteering to engage conversation with Senators, Zuckerberg interrupts the <i>game of telephone</i>; and, Senators engage with their constituents, and lo, America saves two years' of misunderstandings for clear data-protection action now. Bravo, Mark! Zuckerberg is perhaps one of the braver CEOs in American history--Now, he has earned his place right next to Andrew Carnegie--and very similar lives, too. And now, with defined boundaries, <i>Tech has a better roadmap</i> for ethical policy and sensible regulation. So let the data debates begin--but this time,with only one   ball at play! </p>\n  \n  <p class=\"quote\"> \n  </p>\n  \n  <p class=\"cite\">1. <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/j.1467-9558.2008.00324.x\" target=\"_blank\">Abend, G. (2008). The meaning of ‘theory’. Sociological Theory, 26(2), 173-199.\n  </a> <br /><a href=\"https://pdfs.semanticscholar.org/6df2/9e19cb02b684ee387192dfa4b1d284b88143.pdf\" target=\"_blank\">PDF  </a>\n  </p>  \n  <p class=\"cite\">2. <a href=\"https://www.wired.com/story/mark-zuckerberg-talks-to-wired-about-facebooks-privacy-problem\" target=\"_blank\">https://www.wired.com/story/mark-zuckerberg-talks-to-wired-about-facebooks-privacy-problem\n  </a>\t</p> "
  },
  {
    "id": "5",
    "did": "18-04-09",
    "date": "April 9, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "When a Pickpocket is Pickpocketed:<br />Part I: Facebook Data Generation and the Deepests Desires of Psychometricians, <i>Without Anonymization</i>   ",
    "post": "<p class=\"firstparagraph\">Psychometrics, along with today's biometrics and econometrics, form the 3 primary domains of statistical research. These three fields approach research differently. Psychometricians are less causally oriented, as their tool, \"factor analysis\"--<i>analyse factorielle</i>--reduces complex data to dimple, categorical forms in order to reconcile <i>quantitative data</i> with intuitive categories.<sup>1.</sup> And this research is great for expanding knowledge about society. But to what end? Who's to say, after all society is both the subject <i>and</i> object of this research. Social scientists are used to these mental gymnastics, yet are bound by a certain ethos of research: <strong>Anonymization, i.e. encrypting or removing personally identifiable information from datasets</strong>. This is the Social Scientists' <i>Oath</i>--a line of decency. </p>\n<p>Tomorrow, Tuesday at noon, the world will tune in to hear Mark Zuckerberg's testimony before the U.S. Congress, all to hear about Facebook &amp; company's line of decency. However indecent any revelations may be, I'm not that entirely threatened by the revelations. Maybe I won't admit I'm   prone to Social Media influence, because I chart my course. Here's more from the esteemed Abbott: </p> \n\n<p class=\"quote\">“We have ended up believing that social reality is determined in the main by certain general forces, and that these generalities are then specified by combinations of forces, and further limited by various aspects of “individuality,” which in this sense is best understood as idiosyncratic higher order interaction.”<sup>1</sup> </p>\n<p>And so, while academic research focuses on the \"general forces\" to better understand how groups work together, the <strong>bad thing that Zuckerberg did</strong> is not following in the same spirit of generality.<sup>2</sup> They chose to collect and disseminate our \"likes\" as much as our locations, and ... wait for the ominous music ... the <i><strong>non-FB connected mobile contacts of the Facebook clients' personal cell-phones</strong></i>--flipping through someone's personal desk drawer is definitely pushing the rules of privacy. I addressed this issue in my <a href=\"#18-03-20\">March 20th blog post</a> on Facebook's ethics versus the long-standing data-handling ethics from Academia. Regarding tomorrow's revelations, let's remember to give the guy benefit of the doubt, even if they were handily swindled, while they were swindling us.<sup>3</sup>\n</p>\n\n<p class=\"cite\">1. <a href=\"http://journals.sagepub.com/doi/abs/10.1177/0049124198027002002\" target=\"_blank\">Abbott, A. 1998. “ The Causal Devolution.” Sociological Methods &amp; Research.\n\n</a></p>\n<p class=\"cite\">2. <a href=\"https://www.nytimes.com/2018/04/08/us/facebook-users-data-harvested-cambridge-analytica.html\" target=\"_blank\">https://www.nytimes.com/2018/04/08/us/facebook-users-data-harvested-cambridge-analytica.html\n</a></p>\n<p class=\"cite\">3. <a href=\"https://www.wired.com/story/did-cambridge-analytica-access-your-facebook-data/\" target=\"_blank\">https://www.wired.com/story/did-cambridge-analytica-access-your-facebook-data/\n</a></p>"
  },
  {
    "id": "4",
    "did": "\"18-04-07",
    "date": "April 7-8, 2018<br />  Weekend",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "On the\tInevitable Demise of   Native Mobile Apps in favor of Progressive Web Apps<br />Part III: The Nuts &amp; Bolts of the App Replacement Process",
    "post": " \n  <p class=\"firstparagraph\">Revolutions come and revolutions go, but the <i>2nd app revolution</i> is already underway, albeit quietly.<sup>1</sup> Most media sources refer to a \"Native App - Progressive Web App Debate\" with emphasis on what the native app can already do--<i>so if it's not broke, don't fix it</i>. However, implications change as the conversation turns to the Hyper Text Transfer Protocol (HTTP) Chrome V-8 JavaScript Engine<sup>2</sup>--you know, the web-app on <i>steroids</i>! </p>\n  <p>So what kind of steroids you ask? Let us say that the power of the modern browser lies in the open-source JavaScript engine, first C++ variation <i>originally </i>introduced in 2008 by Google's Chromium project. Open-source<i>-who?</i> (close your eyes next paragraph for the jargon-wary!) </p>\n  <p class=\"quote\">A JavaScript engine is a program or an interpreter which executes JavaScript code. A JavaScript engine can be implemented as a standard interpreter, or just-in-time compiler that compiles JavaScript to bytecode in some form.<sup>2</sup></p>\n  <p>In plain english, this means that the browser speaks directly to machine code, and this is a big deal. Happily 'roided, the browser now accomodates tasks that the \"App\" was invented for: <i>To direct service work</i>--image and data loading, caching, storage, offline data, icons, notifica       tions, etc. </p>\n  <p>Now, through a \"Manifest\" file provided to the device from the browser, all of those same tasks are accomplished through a series of handshakes, and voil&aacute;: the mobile device doesn't see the difference between a native app and, well ... a <i>progressive app!</i></p>\n  <p>They say History repeats itself. In our digital lifetime, we have seen <i>record sales</i> surpass digital downloads again (due to streaming); we have seen the originally-decentralized internet return, or at least begin the journey, back to decentralization! And now, we have the once-lowly browser return with a vengeance and strength to replace native apps, with encrypted security, instant loading, and <i>better</i> off-line caching! Do you have an app for that?</p>\n  \n  <p class=\"cite\">1. <a href=\"https://www.forbes.com/sites/forbestechcouncil/2018/03/09/why-progressive-web-apps-will-replace-native-mobile-apps/#3f39b4fa2112\" target=\"_blank\">https://www.forbes.com/sites/forbestechcouncil/2018/03/09/why-progressive-web-apps-will-replace-native-mobile-apps/#3f39b4fa2112</a></p>\n  \n  <p class=\"cite\">2. <a href=\"https://blog.sessionstack.com/how-javascript-works-inside-the-v8-engine-5-tips-on-how-to-write-optimized-code-ac089e62b12e\" target=\"_blank\">https://blog.sessionstack.com/how-javascript-works-inside-the-v8-engine-5-tips-on-how-to-write-optimized-code-ac089e62b12e</a></p>"
  },
  {
    "id": "3",
    "did": "18-04-06",
    "date": "April 6, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "On the\tInevitable Demise of   Native Mobile Apps in favor of Progressive Web Apps<br />Part II: New Powers of the Modern   Browser",
    "post": "  <p class=\"firstparagraph\">Today's Web Browsers, &agrave; la Firefox, Chrome, Opera, etc., are <i>unabashedly on steroids</i>. And, well they deserve to be--they were here first! More importantly, the browser's native language--JavaScript--has been granted full power of the entire web's backend, i.e. servers, data, todos. This means that the browser achieves instant loading, <i>fully progressive, device-responsive,</i> full <i>HTTPS</i>-encryption security, and coherent cross-browser compatibility. So that your favorite   apps look and interact the same between the array of browser choices. The Washington Post has been lauded for helping pioneer the technology. Most notably, their progressive web app loads in .9 of a second, while their native mobile app requires 2.9 seconds.<sup>3</sup> Not exactly a photo finish!</p>\n\n  <p class=\"cite\">1. <a href=\"https://www.techrepublic.com/article/how-progressive-web-apps-promise-to-upend-native-mobile-apps/\" target=\"_blank\">https://www.techrepublic.com/article/how-progressive-web-apps-promise-to-upend-native-mobile-apps/</a></p>\n\n  <p class=\"cite\">2. <a href=\"https://www.fastcompany.com/3063420/how-google-and-others-are-plotting-the-revenge-of-the-web-app\"target=\"_blank\">https://www.fastcompany.com/3063420/how-google-and-others-are-plotting-the-revenge-of-the-web-app</a></p>  \n\n  <p class=\"cite\">3. <a href=\"https://www.webbyawards.com/winners/2017/mobile-sites-apps/features-categories/technical-achievement/progressive-web-app-by-the-washington-post/\" target=\"_blank\">https://www.webbyawards.com/winners/2017/mobile-sites-apps/features-categories/technical-achievement/progressive-web-app-by-the-washington-post/</a></p>\n\n  \n  <p class=\"cite\">4. <a href=\"https://www.gartner.com/smarterwithgartner/top-trends-in-the-gartner-hype-cycle-for-emerging-technologies-2017/\" target=\"_blank\">https://www.gartner.com/smarterwithgartner/top-trends-in-the-gartner-hype-cycle-for-emerging-technologies-2017/</a></p>"
  },
  {
    "id": "2",
    "did": "18-04-05",
    "date": "April 5, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "On the\tInevitable Demise of   Native Mobile Apps in favor of Progressive Web Apps<br />Part I:   Mobile Devices Outwit and Outgrow the \"Old-School\" App",
    "post": "  <p  ><small>Note on app definitions in this post: Anything downloaded, whether iOS or Android is <i>native mobile app</i>, while progressive web apps are strictly behind the HTTPS protocol, i.e. browser-based.</small></p>\n  <p class=\"firstparagraph\">Mobile Devices are ever delightful, yet a pesky 2 to 3-second delay often accompanies our everyday tasks using device-native apps. For the impatient, this delay is not tolerable, and even the patient have their urgent moments (or have better things to do).    So, whether we're Verizon, T-Mobile, or pre-pay phones like Sprint's Boost, our experiences are the same: 3-second delays abound--much to our impatience!  </p>\n  <p >Instant Loading </p>\n  <p >In contrast, many of our daily web-based tasks are instant, i.e. a second or less. I feel instant loading should be <i>a right</i>, not an occasional convenience. what does this potential mean? This means an app's service workers can load nearly immediately and reliably. This means  non-choppy  animations, smooth scrolling, no matter the network connection you're using, no matter the device!  </p>\n  <p  >Device-Neutral User Interface</p>\n  \n  <p  >After a long-day's work using desktop and mobile apps, why should an evening transition to tablet or laptop change our experience? Further, these variations differ between apps--of which there are alot:  2.2 million apps in the iTunes collection and 3 million Android apps, as of 2017<sup>2</sup>. of iOS apps &amp; 3 million. \t My Fitbit experience is illustrative. First, I admit I have a terrible addiction to statistics, especially bio-statistics. And, Fitbit is my enabler.   However, my post-run tablet Fitbit app experience is different and more limited from the HTTPS-browser experience. App features, options, views, date-ranges vary between devices.  </p>\n  \n  <p  >Security </p>\n  <p  >HTTPS-level <i>browser</i> security vs. iTunes &amp; Play Store native app security is akin to a vault door versus building door. I'm sorry, but there's a lot of difference! \n  <p  class=\"dailytech\">In Progress  </p>\n  \n  <p class=\"cite\">1. <a href=\"https://www.wired.com/2010/08/ff-webrip/\" target=\"_blank\">https://www.wired.com/2010/08/ff-webrip/</a>Re: The Web is Dead. Long Live the Internet</p>\n  <p class=\"cite\">2. <a href=\"http://www.businessofapps.com/data/app-statistics/\" target=\"_blank\">http://www.businessofapps.com/data/app-statistics/</a> </p>\n  http://www.businessofapps.com/data/app-statistics/\n  \n  <p class=\"cite\">2. <a href=\"https://www.techrepublic.com/article/how-progressive-web-apps-promise-to-upend-native-mobile-apps/\" target=\"_blank\">https://www.techrepublic.com/article/how-progressive-web-apps-promise-to-upend-native-mobile-apps/</a></p>\n  \n  \n  \n  <p class=\"cite\">3. <a href=\"https://www.wired.com/2016/04/wait-web-isnt-really-dead-google-made-sure/\" target=\"_blank\">https://www.wired.com/2016/04/wait-web-isnt-really-dead-google-made-sure/</a></p>"
  },
  {
    "id": "1",
    "did": "18-04-02",
    "date": "April 2, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Heraclites Delight: Technology Change is the Constant, Human Behavior is Variable:<br />The April 2nd Announced Hedera Hashgraph X Launch Event  ",
    "post": "<p class=\"firstparagraph\">Next May 9th, the greatest known threat to traditional blockchain technology will be formally introduced, <i>along with its source code</i>, into our technological world. Hedera Hashgraph represents a blockchain alternative that caters to time-sensitive transactions, and order fairness. Currently, one transaction with Bitcoin takes about 12 minutes to validate. Ethereum is only a couple minutes, but in a world of micro-transactions and micro-second transactions, speed counts.</p><p>Next, Hedera's technology uses a consensus algorithm, which depends on  node neighbors' \"voting\" elections. This means that the design is impervious to \"forking\"--when a part of the blockchain splits and no long syncs with the main blockchain.  More importantly, Hedera's consensus design is   built on Asynchronous Byzantine Fault Tolerance (aBFT), so is then impervious to threats of <i>Distributed Denial of Service (DDS) attacks. </i></p>\n<p>So, lightning speed for validating crypto-transactions. Guaranteed security from hard- or soft-forking of the blockchain, and DDS-like attacks. Fairness in transaction order. Come May 9th, we'll see just how Hedera's codebase and cryptocurrency will accomplish these benchmarks, and if so, Heraclitean river stops in time! If not, yet another cryptographic mirage!</p>\n<p class=\"cite\">1. <a href=\"https://www.hederahashgraph.com\" target=\"_blank\">\thttps://www.hederahashgraph.com</a> </p>\n<p class=\"cite\">1. <a href=\"https://medium.com/hashgraph/eat-pray-hashgraph-56b9613ed46f\" target=\"_blank\">https://medium.com/hashgraph/eat-pray-hashgraph-56b9613ed46f</a> </p>"
  }
]