[
  {
    "id": "17",
    "did": "18-02-10",
    "date": "Feb 10, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain <h6>First Blog Post!</h6>",
    "title": "Why are Sociologists now the Key Players in Data Analysis within the Domain of Blockchain Technologies?",
    "post": "\n  <p class=\"firstparagraph\">First, let me describe that blockchain technologies, i.e. Government contracts, Business contracts, Bitcoin and other\n\ncryptocurrencies, all rely on network graph theory, both on the low-level programming technology (peer-to-peer global\n\nip networks) across the spectrum to high-level interfaces for institutional, corporate, individual needs and uses.\n\nThese blockchain &quot;network&quot; analyses depend on highly variable--and simultaneous--network changes, node\n\nchanges, and link changes; and, the latter three may arbitrarily change interdependantly or not.</p>\n\n\n\n<p>Therefore, blockchain technologies must first accomodate complex node variables for contracts (relationships) that\n\ninclude arbitrarily hierarchical mappings and conditional data structures. Secondly, blockchain tech must face analytical\n\nchallenges that arise from informal practices\n\n<sup>1</sup>, by which the organizational nodes (employees) choose to deviate from the employee role&#39;s protocol for\n\nthe sake of efficiency, convenience, company culture, and multiple other levels of human factors.</p>\n\n\n\n<p>Sociologists Meyer &amp; Rowan&#39;s (1977)\n\n<i>New Institutionalism</i> explains how employees change practices and decouple\n\n<i>actual</i> organizational structure from recorded rules, as a function of organizational size, time, convenience,\n\netc. These continually new, unknown constraints on data must be intimately understood, non-algorithm human understanding\n\n<i>by at least one side </i>of the exchange. How do we recognize unwritten, soft rules and behaviors of a bank, a person,\n\nor a company&#39;s internal bot?</p> \n\n<p>The hard sciences domain of Software Engineering, Computer Science, and Mathematics have brilliantly brought the\n\nworld the blockchain tool, <s>for which</s> the Hard Sciences can and must share and propogate it's technical expertise <i>and higher standard of metric truth</i><s style=\"color:purple\" class=\"strike-purple\"> not contribute everything, especially relating with</s> to the other sciences that are still lagging behind--namely The Discipline of Sociology</s> toward acclimating to the modern age's social priorities and needs. Ask yourself, how well do 1,000 top blockchain-related programmers understand the multi-dimensional layers of hierarchical social, corporate, and governmental relationship networks--probably 700 of the 1,000. And how many social scientists can understand the technological sciences? Probably 200 out of 1,000. This means that <i>a chunk of the scientific displines suffer from acute innumeracy</i>. So how do we bridge this massive knowledge gap between qualitative meaning in the smart-contract.</p>\n\n<p>In the past, the layers of abstraction from raw technological tool to societal use was refined, improved, integrated through multiple layers of &quot;middlemen&quot;, such as lawyers, corporate lawyers, government institutions, non-governmental, non-profit and for-profit actors. Blockchain technology, by its very nature, erases the middlemen. Suddenly, one programmer, for example, is writing the same healthcare insurance crypto-contract, that last month an entire team of hospital employees spent a month writing; then overseeing and managing different facets of this same thing.</p>\n\n\n\n<p>However, the crypto-contract, once deployed to the blockchain, auto-manages the rest, forever or for the life of\nthe contract. Therefore, rather than redoing the trials and errors of 200 years&#39; Sociology Network Analysts&#39;\nresearch and analytical development. Therefore, medical and other social fields cannot and should not turn to the\nHard Sciences for solutions. These Med researchers and developers are already at home, safe within the academic\ndomain of the Raw Sciences of Medical Sociology, Public Health, and so on. The next ten years of blockchain technology\ncan either be defined by unwitting, piecemeal advances, accompanied by frequent, non-improving distastrous crises.\nOr, the next ten years can follow Sociology&#39;s Scientific Method toward a mildly turbulent, but stable and beautiful\nfuture.</p>\n\n\n\n<p>Examples aside, the <s>primacy</s> innumeracy of the Sociology academic field in the early 21st century quickly becomes apparent on\n\nreview of the Sociologists&#39; specialization in network theories imbued with symmetrical and asymmetrical relationships,\n\nwithin social networks that change arbitrarily the direction, conditions, and values of those same relationships.\n\n<s>We</s> Sociologists deal with real-time, logical and hierarchical network mappings that appear arbitrary, yet are characterized by fixed patterns. This implies a higher level of competency to accurately judge a point-of-view without the ability to directly consult machine learning. <i>This is a Code or Be Coded moment in the sciences.</p>\n\n\n\n<p>No other academic field than sociology has advanced into the details, and endless network rabbit-holes that characterize societal behavior. Not until this second millenial decade could the marriage of Large Number Statistical Theory\n\nbecome consumated with the brilliance of early 1900&#39;s Sociological French Network Theories, like Maurice Halbswach&#39;s\n\nwork on the clearly defined network patterns of a society&#39;s Collective Memory.</p>\n\n\n\n<p>No other academic field has collected and refined knowledge on network arbitrariness, such that Economic&#39;s &quot;irrational\n\nbehaviors&quot; and Mathematical &quot;complexity models&quot; do not\n\n<i>touch to the bone</i> the meaning, the intersectionality of network analysis, which must incorporate simultaneous\n\nnode changes (person gets job /or/ does not get job), network changes (All get jobs /or/ only 3 of 15 network groups\n\nget jobs), and most importantly the\n\n<i>relationship</i> changes (all jobs always useful /or/ half of job groups no longer useful) across time and fixed.</p>\n\n\n\n<p>Fine. So, why is Sociology&#39;s network theory so valuable beyond just the network insights gleaned from 19th and\n\n20th centuries&#39; network problems? Follow: European sociology came of age in the analog social era, while North\n\nAmerican Sociology only recently come of age (Quebec in the 1960&#39;s [post-1968], U.S. in the 1990&#39;s[post-1999],\n\nin the digital social era. Therefore, the problem-solving patterns of past sociology are inherently small-data and\n\nmore qualitative analysis, and thus only Sociology incorporates &quot;human-ness&quot; into the billion rows and\n\ncolumns of quantitative--numbers-only--analysis.</p>\n\n\n\n<p>For example, Oxford-developed S.I.E.N.A. Software accomplishes this task. SIENA--named for Simulation Investigation\n\nfor Empirical Network Analysis--software calculates the real-time values, direction, and conditions of each relationship\n\n(link) in a network, simultaneously as each node, network, or alter-link changes or is changed; with this, it is\n\npossible to isolate directional, conditional\n\n<i>influence change</i> in real-time. Real-time sounds impossible, however, the SIENA documentation\n\n<sup >2</sup> describes its program algorithm to the statistical analysis of network data, with the focus on social networks.</p>\n\n\n\n<p>An easy example to grasp this is the concept of whether a person\n\n<i>self-selects </i>(e.g., due to subconscious leanings) into a group and thus matches to fruition the group&#39;s\n\nbehavior with little group influence? Or does this same person join a group and emulates the group&#39;s behavior,\n\nby the group&#39;s influence over time. Sociological network analysis, using Snjder&#39;s SIENA software, achieves\n\nthe impossible with the closed, directed graph networks that characterize blockchain technology. The network graph\n\ncan be here understood as entire (complete) networks (i.e, the blockchain in its entirety without hard forks), not\n\nas personal (egocentered) networks: Using this SIENA model allows for the necessary assumptions that a set of nodes\n\n(social actors) is given, and all ties (links) between these nodes are known - except perhaps for a moderate amount\n\nof missing data</p>\n\n\n\n<p>If, and only if, this level of analysis may be achieved, the blockchain development may follow a linear, directed\n\npath of maturity with social and world needs. Until that time, that Sociology Network Theorists are called upon,\n\nblockchain developers will continue to bat their arms in the dark, stumbling over again the same bugs. Sadly, this\n\nsemi-opaque future implicates the same fate as those that attempt to use blockchain for their currency, contract,\n\nand other societal needs--in this case, the blind would indeed lead the blind.</p>\n\n\n\n<p class=\"footnotes\">1.\n\n<a href=\"http://www.journals.uchicago.edu/doi/abs/10.1086/226550\"   target=\"_blank\"> http://www.journals.uchicago.edu/doi/abs/10.1086/226550</a>\n\n<br />\n\n</p>\n\n<p>\n\n2.\n\n<a href=\"https://www.stats.ox.ac.uk/~snijders/siena/\"  target=\"_blank\"> https://www.stats.ox.ac.uk/~snijders/siena/</a>\n\n</p>\n  ",
    "done": true
  },
  {
    "id": "16",
    "did": "18-02-11",
    "date": "Feb 22, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "How Can We Best Modularize our App Designs in Order to Achieve the Much Vaunted &quot;Separation of Concerns&quot;?",
    "post": "\n  <p class=\"firstparagraph\">There was once a time for App Developers that our habits followed our inner-philosophers--as an Esteemed Order of\nCoders--we held ourselves in the highest regard to separate form from function, and style from structural design.\nHence, in the early 2000&#39;s, a tri-partite, sensible world guided every web coder to abide by The scaffolding\nof HTML, functionality of JavaScript, and styling of CSS. A decade later, we must throw out this antiquated division\nof labor within web coding.</p>\n\n<p>Library modularization, (think JQuery, JSX, Bootstrap, etc.) within Javascript ES16 reveals that modules and components\nMust hold together CSS/HTML/JS, part by part. So, if a decade ago three teams handled html, js, css, it is now requisite\nto divide up 3 teams to 3 components (a team for the carousel widget, a team for the navigation widgets, and\n<i>\neach</i> of these component teams\n<strong>must</strong> be maintained together, not separately, the module&#39;s required html, js, css.</p>\n\n<p>This means that the new Division of Labour can no longer follow past patterns from 5 years ago. Otherwise, any and\nall coding will necessarily begin to &#39;reinvent the wheel.&#39; This is because any module, any library you go\nto, will\n<i>already</i> have its HTML pre-configured, JS pre-configured, CSS pre-configured. Thus, attempts to extricate new\ncss from one module to another (or worse yet, sharing css of modules), will only invite eventual misery, almost\ninstantly setting booby traps for the next coders upon arrival.</p>\n\n<p>So, where is the creativity? Where is the originality then? It is not gone. It has evolved to a higher level of abstraction,\nleaving to automation the boring stuff. So, if Vanilla JS is considered malpractice in the modern world, and if\nad-hoc JQuery is mocked and scoffed at by React coders, then where is creativity? If yesterday&#39;s craft was the\nhoisting of 15 javascript functions on each page, the New Art of modular coding is akin to a game of Tetris. Part\nby part, module by module, the modern coder open-source window-browses and window-shops; goes home, and cuts and\npastes, and folds and clips, then assembles and hangs to dry. Do Python programmers rewrite each particular module\ndefinition? That&#39;s absurd. Equally absurd is the javascript programmer that rewrites from scratch their modules.</p>\n\n<p>The esteemed Order of JavaScript Coders must wake up, and regain its work-load balance in this new age--an age that\neach year since 2014, the JavaScript language is rewritten, each year now, in both syntactic sugar and also fundamental\nstructure--especially the importing and exporting of modules. Therefore, philosophical Honor behooves each of us\nto a higher complexity, and a new commitment to, the &quot;Separation of Concerns.&quot; We can allow ourselves\na break, thankful for Progress, a progress by which we must\n<i>Stand on the Shoulders of Giants</i>, and Code-Create!</p>\n  ",
    "done": true
  },
  {
    "id": "15",
    "did": "18-02-12",
    "date": "Feb 12, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Mark Zuckerberg&#39;s Innocence",
    "post": "\n  <p class=\"firstparagraph\">Facebook Scandals\n<sup>1</sup> of recent months have demoralized the leadership for a role of misinformation in the Tech Age, however I\ncharge Mark Zuckerberg&#39;s innocence\n<i>not</i> because all of us, as a society, were equally warned. Rather, arbitrary mathematical forces created abnormal,\nnever-before-seen network structural density and symmetry patterns. Technological shifts were so efficient at multiplying\nand exacerbating misinformation because a curious sociological network phenomenon rendered parts of our daily social\nlearning and acculturating process to network forces out of our own control.</p>\n\n<p>A January 2016 American Sociology Association Newsletter Editorial\n<sup> 2</sup> from Sally T. Hillsman, in which she explained how the social mechanisms of our own misinformation were\nnot entirely within our own control to resist. In fact, the arbitrary (often random) social structural changes from\nhigher social-media hours, create an arbitrary social network structure whose links (in their content and influence)\nbegin to dominate over nodes (each of us). In other words, the sway of trends and opinionated critical thought becomes\ndominated by the relationships, e.g., the &quot;likes&quot; and &quot;shares&quot;, leading to a statistically natural\npropensity toward homogeneity--a.k.a. group-think. The mechanism is akin to peacefully swimming close and parallel\nto the coastline, and (due to random coastal floor structure), a rip-tide suddenly ships you far out to sea--a fatal\nand tragic fate rendering experienced swimmers out of their own control. Same principle with an arbitrary\n<i>underlying and unseen</i> network structure.</p>\n\n<p>Our social network structures always are prone to continual shift, and so the usual &quot;interruptions&quot; that\npreviously stopped this inward shift soon began to disappear. Hillsman explains:</p>\n\n<p class=\"quote\">Lies, half-truths, and misinformation spread so rapidly across the public through digital communication that the\ntimespan for thoughtful, effective correction or rebuttal is infinitesimal. Because of confirmation Bias, misinformation\nand outright lies quickly strengthen preconceived truths or pre-held beliefs that are already hard to change.</p>\n\n<p>Therefore, even though we all have been pointedly warned,\n<i> none of us</i> without advanced sociological analysis skills could understand that a curious network phenomonenon--ultimately\ndriven by some arbitrary mathematical calculation involving size, density, symmetry, conditional influences, and\nthe strength of ties outweighing network nodes. For the reasons of these factors, our social inclinations were\n<i>out of our control</i> -- no, but really, this time they were!</p>\n\n<p>And so, we can learn from Sociology what steps to take in order to counteract random, but risky, network phenomena\n-- because nobody likes to go for a swim at the beach, and unwittingly get shipped out to sea!</p>\n\n<p class=\"footnotes\">1. Wired Magazine\n<i>Inside the Two Years that Shook Facebook--and the World</i> (February, 2018)\n<a href=\"https://www.wired.com/story/inside-facebook-mark-zuckerberg-2-years-of-hell\"\ntarget=\"_blank\"> Wired Magazine, </a>\n<br />\n<br /> 2.ASA\n<i>Footnotes</i>. (January, 2016)\n<a href=\"http://www.asanet.org/footnotes/jan16/index.html\" target=\"_blank\"> www.asanet.org/footnotes/jan16/</a>\n</p>\n  ",
    "done": true
  },
  {
    "id": "14",
    "did": "18-02-13",
    "date": "Feb 13, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "3rd Generation Blockchain: How Fast can the Blockchain Operate? Part III: : The Challenges for the Directed Acyclic Graph (DAG) with Ripple and  Iota Coin",
    "post": "\n  <p class=\"firstparagraph\">Other than college pre-med students, few know the MCAT exam--the gatekeeper of U.S. &amp; Canadian Medical Schools--underwent\na major modification in 2015.\n<sup>2</sup> Much deeper than Biological and Technological updates, major sections were added and/or expanded including\nthe Social, Pyschological and Biological foundations of\n<i>behavior</i>. Named the\n<i>Health Systems Science</i>\n<sup>3</sup>, the American Medical Association&#39;s modern, holistic approach articulates outcomes-based measures for\nhealthy living and disease prevention efforts. You could say the AMA is indeed,\n<i>woke</i>.</p>\n\n<p>But really, what&#39;s the difference and why would we care? And, who doesn&#39;t know that an apple-a-day keeps\nthe doctor away? Dr. Jeffrey Borkan, MD, PHD of Brown University&#39;s Warren Alpert Medical School, explains the\nevident role of all those unnoticed social interactions involved in obtaining and consuming that apple. Further,\nthe spatial and economic\n<i>availability</i> of that apple also plays a role in keeping the doctor away. Borkan explains:</p>\n\n<p class=\"quote\">It&#39;s time for us to take a leap forward in educating physicians for the health care delivery models of the future&mdash;those\nthat aim to improve not just the health of the individual patient and their family, but also the community and the\npopulation.\n<sup>4</sup>\n</p>\n\n<p>What, then, specifically, are the mechanisms that a community network&#39;s aggregated health may be inextricably\ntied up with\n<i>our own</i> individual health? In short, they are the sharing of health-promoting resources, timely assistance,\nhealth-promoting information channels -- all this, among the countless perks of a healthy social circle!</p>\n\n<p class=\"citations\">1.\n<a href=\"http://www.greekmedicine.net/whos_who/The_Hippocratic_Oath.html\" target=\"_blank\">The Oath of Hippocrates</a>\n<br /> 2.\n<a href=\"https://students-residents.aamc.org/applying-medical-school/article/changing-mcat-exam/\" target=\"_blank\">The 2015 AAMA Changes to the Medical College Admissions Test</a>\n<br /> 3.\n<a href=\"https://www.ama-assn.org/education/teaching-new-content-health-systems-science\" target=\"_blank\">American Medical Association&#39;s\n<i>Teaching New Content Health Systems Science</i>\n</a>\n<br /> 4.\n<a href=\"https://www.ama-assn.org/education/teaching-new-content-health-systems-science\" target=\"_blank\">ibid.</a>\n</p>\n  ",
    "done": true
  },
  {
    "id": "13",
    "did": "18-02-14",
    "date": "Feb 14, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "A New Kernel, and the Manifestation of a Two-Hundred Year Problem named <i>Anomie</i>",
    "post": "<p class=\"firstparagraph\" style=\"color:green;\">Given that a community network&#39;s aggregated health is inextricably, and symmetrically, tied up with\n  <i>our own</i> individual health, app-developers may design activity- and communication-based apps more responsibly,\n  and in touch with modern healthcare recommendations. After all, if the Saintly Mark Zuckerberg&#39;s communication-\n  and activity-based app inadvertantly led to novel, and deeply consequential, effects, then ...</p>\n  <span class=\"alert\">* Given the Tragic Events in the School Shooting in Florida, I felt a topic of more gravity was in order ... :( </span>\n  \n  <h6 class=\"chapternumber\">Feb 14, 2018</h6>\n  \n  <h6 class=\"chapternumber dailytitle\">A New Kernel, and the Manifestation of a Two-Hundred Year Problem named\n  <i>Anomie</i>\n  </h6>\n  <p class=\"firstparagraph\">Given the tragic events at a Florida school over Valentine&#39;s Day, 2018, who can write about Fitbits? So, thoughts\nand sympathy for those students today that endured this horror. 19 years after the first-of-its-kind school shooting,\nwe as an American society have not become &#39;numb&#39; to these events. It hurts as much as it did in 1999.</p>\n\n<p>Darn that innocuous Spring day in 1999, when we heard the most absurd news-- students attacked their own colleagues\nat Colombine? In my blog post from January 10, I wrote that American Sociology, along with Qu&eacute;bec, came of\nage much later than European Sociology. The past 50 years&#39; social changes and new problems are generally atrributed\nfor the increasing demand for sociological expertise after 1999, after a singular, senseless tragedy of a school\nshooting--this event, like a small kernel of societal desperation for a solution--led to a flurry of self-professed\nsociologists &agrave; la Michael Moore&#39;s Colombine, and other social-responsibility themed social consciousness.\nSo far, only mutually incompatible solutions. The problem, however, is not new, only the manifestation of it.</p>\n\n<p>Suicide rates in 19th century France, disproportionately high, also served as a symptomatic manifestation of the\nsame problem, called\n<i>Anomie.</i>\n<sup>1</sup> The term,\n<i>Anomie</i>, coined by Emile Durkheim in the late 1800&#39;s, captured the sense of instability, cultural and moral\nrelativism that undermined a shared sense of meaning. Suicides, week-after-week, month-after-month? In 1897 France,\nnoone had ever seen it before--at such rates--and people wanted answers. Alas, a kernel of social desperation leading\nto inquiry.</p>\n\n<p>People wanted to know why so many in the population responded negatively to the rapid changes, urbanization (Dreadful\nfactory conditions &agrave; la\n<i>Taylorism&#39;s</i> calculated efficiency) new technologies, i.e. electricity, railroads, steam engines; these created\nan arbitrarily new world, very suddenly. Suddenly, like trying for the first time a roller-coaster, when all you&#39;ve\never known has been the carousel. So, we see technology&#39;s role for well or for ill, our job is to understand\nhow to dial-in the tech specs necessary to keep society smiling on this roller coaster through another, yet not\naltogether new, technological thrill-ride.</p>\n\n<p>1.\n<a href=\"https://www.researchgate.net/publication/228173911_The_Sociology_of_Suicide\" target=\"_blank\">1897, Suicide, &Eacute;mile Durkheim.</a>\n</p>\n  ",
    "done": true
  },
  {
    "id": "12",
    "did": "18-02-15",
    "date": "Feb 15, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "After Yesterday&#39;s Scathing Post, A Look at my own Carbon Footprint",
    "post": "\n  <small class=\"jargon\">Tech blockchain jargon alert ahead, with all effort made for clarity! I treat a broad overview of the existing trajectory\nof blockchain-related micro-economic advancements. I make a technical &amp; contextualizing\n<abbr title=\"this link just goes down 5 paragraphs to Feb. 17th\">\n<a href=\"#18-02-17\"> three-part blog series in my Feb. 17-20 posts</a> on the micro-economic horizon of blockchain technologies.</abbr>\n</small>\n</h6>\n\n<p class=\"firstparagraph\">Has anyone else been underwhelmed by the lack of Bitcoin&#39;s daily\n<i>presence</i>, despite its everpresence at the dinner tables and caf&eacute;s across America. Sure, it&#39;s more\nof a &quot;metropolitan&quot; phenomenon; and sure, it&#39;s become an accepted global platform--along with myriad\nother crypto-currencies, but it&#39;s exchange-worthiness remains shrowded, and misunderstood by many. Cryptocurrencies\nare useful as a vehicle for investment, and yes, there are Bitcoin millionaires due to the currency&#39;s rise to\nfame with last year&#39;s increase in value (from $1,000 to ~$20,000) etc., etc. But, so far its contributions,\nuses, fame are one-sidedly\n<i>macro-</i>economic. A recent CNET article\n<sup>1</sup>, among others, documents miniscule (and not improving) percentage of\n<i>actual</i> use at the &quot;cash-registers&quot; of society.</p>\n\n<p>Is there something wrong with such little micro-economic usage? Not at all! According to general sociological\n<i>Early Adopter</i> theory--based on Everett M. Rogers&#39;\n<i>Diffusion of Innovations</i>\n<sup>2</sup>--the timeline of the Innovation Adoption Lifecycle is fairly ordinary. That is, the Roger&#39;s bell curve\nranges from the beginning innovators, to early adopters, early majority, and late majority. However, the blockchain\narticles always miss the point. Currencies are more of a distraction compared to the genuine usefulness for the\nevery-person, in every-day affairs, on a given day--i.e., micro-economic use.</p>\n\n<p>The true value, the kind that makes our lives easier on any given day, and for the every-person, is\n<i>not</i> the currency, it is the contract, that allows for individualized, targeted sharing of specific information--whether\nfinancial, governmental, or any other centralized database. An example is in order before I continue, since we can\nall relate to the risk of using a credit or debit card, the risk most notably concerning Target store credit card\nhacks a couple years ago.</p>\n\n<p>Suppose a person shops at 3 different retailers, using a different credit card for each. For these 3 transactions,\nthis person had only needed to provide two discrete pieces of information about themselves for each transaction:\nthey prove they have the $27, $200, and $5; and they prove a third party(i.e.,CC or bank)will make that $27, $200,\nor $5 available, if their client agrees. Instead, for each transaction, they open their\n<i>entire</i> financial information, and can only hope that law-enforcement will prevent cyber-theft; and if the store&#39;s\ndatabases are hacked, then tough-luck!</p>\n\n<p>Crypto-contracts provide the technology for this individualized, risk-free transaction, rather than for each transaction,\nproviding the generalized information for individual transaction. Highly inefficient! Nobody thinks to walk around\nwith their life-savings in cash, then at the 7-11 store, to open their wad of cash and peel out a bill. The credit\ncard system, blessed as it is, did not previously have technology to avoid this very thing. So, financial institutions\nhave had to rely on the many layers of security, passwords, pins, mothers&#39; maiden names, etc. Then, based on\nthe mathematics behind prime numbers, they hope to keep your money safe in one, centralized spot--with a bright\nred target on it.</p>\n\n<p>Now, the crypto-contract provides this decidedly *micro-economic* experience for the everyday person. And that, my\nfriends, has nothing to do with crypto-currencies. There is no micro-economic value in crypto-currency, instead\nthe crypto-\n<i>contract</i> is the true, unsung hero, and a hero we will all get to know. [personal opinion - this hero&#39;s name\nis the Ethereum Virtual Machine]. In any case, Crypto-contracts provide this ability to provide pinpointed,\n<i>specific, targeted information</i> as citizens, too. When we provide our drivers license number, for the sake of\nrenting that car, we provide every aspect of information of ourselves to Hertz. They don&#39;t need this. They need\nto know only and exclusively driving-record related details--not the entire governmental database of information\nabout you!</p>\n\n<p>1.\n<a href=\"https://www.cnet.com/news/bitcoin-cryptocurrency-big-in-investing-but-still-lousy-for-buying-a-sandwich/\"\ntarget=\"_blank\">https://www.cnet.com/news/bitcoin-cryptocurrency-big-in-investing-but-still-lousy-for-buying-a-sandwich/</a>\n</p>\n\n<p>2.\n<a href=\"https://eric.ed.gov/?id=ED065999\" target=\"_blank\">Rogers, E. M., &amp; Shoemaker, F. F. (1971). Communication of Innovations; A Cross-Cultural Approach.</a>\n</p>\n  ",
    "done": true
  },
  {
    "id": "11",
    "did": "18-02-16",
    "date": "Feb 16, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Tech on the Regret: Unintended, secondary effects of communication- and activity-based app-designs",
    "post": "\n  <p class=\"firstparagraph\">Given that our app-use is inextricably tied up with our own behavior, activity/communication-based app developers\nhave in the past year accepted (mostly in word) a renewed responsibility. More like resposibility for a multi-faceted\npower of influence granted to an industry, suddenly, disproportionately great, and\n<i>semi-arbitrarily related</i> to the designer&#39;s intent (and control!). After all, if the Saintly Mark Zuckerberg&#39;s\nactivity/communication-based app inadvertantly led to novel, and deeply consequential, effects, then anyone could.</p>\n\n<p>After all, who could guess\n<i>how</i> these app-design effects would affect the users, years later. Who do we think programmers are, sociologists?\nMore specifically, who could know\n<i>which</i> mundane coding practices, arbitrary app-design--like sharing permissions/features? Sure, everyone deep\ndown knew their company practices yield unfathomable power of influence over the daily habits of cell-users, a.k.a.\neveryone. The easy part is knowing; the hard part is learning how and why certain app-features lead to behavioral\nrisks.</p>\n\n<p>There could be no better example than the Alcoholic faced with an intervention by a loving family longing for change.\nThe alcoholic could be forgiven for past misdeeds, but without actual\n<i>Acknowledgement</i> of a crisis in direction, which necessitates professional help from social scientists. Therefore,\nthe recent\n<i>acknowledgments</i> signify something deeper--they signify a humility that app-designers are not sociologists, generally\nspeaking. <s style=\"color:purple\">So, that means hiring sociologists, psychologists, anthropologists for every N\n<small>th</small> app-coder and engineer.<s> History can&#39;t be rewritten, but it can be interpreted and learned\nfrom. The acknowledgment is itself a victory if it induces learning from the raw, social sciences, whose expertise\n<i>can</i> predict how or why certain &quot;life&quot;-features, practices, and policies often unfold with undue and\nunintended social consequences.</p>\n\n<p>Water under the bridge, but going forward, it is one thing to claim a &quot;renewed sense of remorse&quot;, another\nto acknowledge, learn and change. Like last November\n<sup>1</sup> when Facebook co-founder Sean Parker confessed certain designs like &quot;social-validation feedback loop&quot;\nand other app-design intentions, while ignoring potential secondary effects on society. So, the\n<i>Acknowledgment</i> is the big win here--not so much the remorse!</p>\n\n<p>1.\n<a href=\"https://digitaladdictsblog.com/facebook-co-founder-says-company-built-to-exploit-you/\" target=\"_blank\">https://digitaladdictsblog.com/facebook-co-founder-says-company-built-to-exploit-you/</a>\n</p>\n  ",
    "done": true
  },
  {
    "id": "10",
    "did": "18-02-17",
    "date": "Feb 17-18, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Blockchains, Bitcoins and The Unnecessary Risk of Shopping at Target with a Credit Card, Part II:<br /><br /> Seven Nuts &amp; Bolts Features of the New Blockchain Micro-Economy",
    "post": "\n  \n<p class=\"firstparagraph\">7 Ethereum-based technological features offer us a new world -- a decentralized new world, not dependent on the centralized\nservers of Instagram, Comcast, T-Mobile, Amazon, etc. With that statement ends general consensus among blockchain\nexperts, pundits, and authors. However, if the current logistical obstacles provide controversy and competing algorithms\nover sustainability, security, and scalability, then they reveal much more about the general pathway of social uses\n(and potential effects) than they hide. In my February 15th\n<a href=\"#18-02-15\">blog</a>, I touched on a few features of micro-economic uses so as to distinguish the more certain aspects of the\ncrypto-contract horizon.</p>\n\n<p>\n<strong>Prologue</strong>\n</p>\n\n<p>So, what are some core features of block-chain technology that affect the quality of our lives, and the\n<i>productivity</i> of our work as a society of academics, public-sector and private-sector professionals? First, a\nlittle background and context before I outline seven blockchain functionalities. The Ethereum blockchain helps distinguish\nitself--and its blockchain-native language Solidity--from earlier tech, like Bitcoin and other Proof of Work-based\nblockchains. Ethereum blockchain offers a syntax and programming features, e.g. &quot;looping&quot;, &quot;recursion&quot;,\nwith the full power of a\n<i>Turing Complete</i> language--that is, given enough resources, the language can solve any programmable problem.</p>\n\n<p>More background and a clarifying metaphor are in order: The Bitcoin blockchain transaction resembles the accounting\nsystem of a foos-ball table point rack with a basic calculator glued to the side. In contradistinction, An Ethereum\nblockchain transaction would resemble a network of computers,\n<i>which is itself,</i> a computer--hence, the name Ethereum Virtual Machine. This allows for Quickbooks to calculate\ninto a PDF to be sent via an email contract-signing program. Much more useful!</p>\n\n<p>Therefore, Ethereum&#39;s Blockchain is more than a networked, chained list of blocks, like Bitcoin. The Ethereum\nblockchain is actually a &quot;Virtual Machine&quot;, like a a big networked &quot;home computer&quot;. The native\nlanguage of the blockchain, Solidity, allows for an\n<i>application binary interface</i>, ABI. So, for example, I can type up an Ethereum contract on my home computer,\nthen directly access by command line the blockchain itself. In layman&#39;s terms, the manner that modern-day app,\nfor example Instagram, is a centralized API (Application Programming Interface) that allows one programming system\nto interact with another, such as Instragram offers a &quot;sharing API&quot; that connects to hardware contacts,\nthus facitilating communicating with third-party aplications, like sharing your instagram picture to your Facebook\naccount, via your T-Mobile phone&#39;s contacts list. This API relationship broadly describes the modern world we\nlive in, wherein a Chryser driving system exchanges API information with your T-Mobile Bluetooth network system,\nwhich exchanges API information with your own contact list, and so on, and our lives are made easier.</p>\n\n<p>So, are we out of the woods? Has Ethereum solved the blockchain question? Yes, if it were the 1920 pre-relativity\ndays; However, with the advent of quantum computing, potential security vulnerabilities immediately arise. The reason\nbeing that digital math uses binary &quot;on/off&quot; calculations, while quantum math implicates a tertiary,\n<i>qubit</i> &quot;simultaneous states&quot;. Therefore, we have now entered the 3rd generation of blockchain technology,\nboth programmable, but also quantum-proof due to mathematical graph features. For example, IOTA&#39;s blockchain\ndesign utilizes a\n<i>Winternitz One-Time Signature</i>, by which one&#39;s transaction is entered into with a private-key, and the blockchain\nmoreso resembles a &quot;Tangle&quot; of a directed graph, which allows for computational &quot;states&quot;. IOTA\nrecently garnered criticism in January 2018 due to an unfortunate crypto-hack, that exposed an apparent vulnerability.\nIn truth, this was a case of user-error because users were\n<i>re-using</i> their one-time keys, which significantly decreases security to the point that a home computer could\ncrack the code! I choose to not digress further, and quantum computing is not quite advanced enough now to cause\ndamage, but in the future could potentially split the blockchain in two, or other quantum possibilities.</p>\n\n<p>In sum, the technical obstacles change each month, however one must not lose sight of the forest for the trees. Social\nuseablity, potential scope and of course unintended consequences have all finally begun to emerge, at least in form,\nwith little difference between the 2nd generation blockchain or the 3rd generation Patrician directed graph blockchain.\nThe underlying principle of the blockchain&#39;s micro-economic utiliity through crypto-\n<i>contracts</i> is the same, as opposed to plain crypto-currency. you know the usual bartering solutions for Supply\n&amp; Demand leading to Economics Game Theory, etc. This is where we must take our leave of the Hard Sciences of\nMathematics, and enter the realm of Sociology, Psychology, Anthropology and Economics.</p>\n  ",
    "done": true
  },
  {
    "id": "9",
    "did": "18-02-19",
    "date": "Feb 19, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Blockchains, Bitcoins and The Unnecessary Risk of Shopping at Target with a Credit Card, Part III:<br /> Seven Features of the New Blockchain Micro-Economy",
    "post": "\n  <p class=\"firstparagraph\">The guiding light through the centuries of scientific paradigms, in the Kuhnian sense\n<sup >1</sup>, have derived from deductive ideas from above - whether priestly or royal decree. Then, the primacy of the\n<i>Scientific Method</i> from the Renaissance forward--punctuated first by Copernican Heliocentrism, then other Paradigm\nShifts--has directed rational and ethical norms in each respective period, e.g. Enlightenment authors of 17th, 18th\ncentury. Fast forward to the modern period, wherein the current era&#39;s emerging paradigm holds Sharing as a collective-priority\nand responsibility, then an amazing philosophical moment.\n<i>Historical Materialism</i>\n<sup>2</sup> prescribes what is directly here a novel Paradigm Shift by which authority is not derived from governmental,\nfinancial sources, but rather the\n<i>shared</i>societal consensus about cryptographic, mathematical proofs as true authority. Further, the revolutionary\nshift also innately provides tools for implemention through decentralized, programmable data-sharing. Cryptography\nhas in a sense become a\n<i>de jure</i> middle-person for identification and verification of property.</p>\n\n<p>\n<strong>I. Protecting rights through immutable records</strong>\n<br /> Inalieable Rights can now be identified and verified by the cryptographic authority of a mathematical proof, rather\nthan exclusively through governmental or financial institutions from above. The modern period also has held this\ndecentralized, individual authority as the\n<i>a priori</i> starting points for philosophical proofs. Premises about truth begin with the conditions of humankind,\nnot idealogies. In fact, it was the\n<i>Young Hegelians</i> of early 19th century Vienna &amp; Berlin, who ushered in the Modern Era of Western Philosophy,\nby laying out Truth as inverted, beginning from the empirical &quot;ground&quot; upward. This &quot;upside-down\ntree&quot; defines philosophical modernity. Jean-Paul Sartre wrote that the whole of\n<i>Existentialism</i> and 20th century philsophy is a mere subset, and never escapes Continental Materialism, as argued\nin Sartre&#39;s\n<i>Search for a Method</i>.\n<sup>3</sup>\n</p>\n\n<p>All of the Sciences, prodded by this Truth of Empiricism, followed suit through all the tech innovations since Hegel.\nI&#39;m so surprised by this, because for me, the role of cryptography is shocking on two levels. First, cryptography\nresemblees philosophy rather than the Empiricism that I had envisioned would govern social rule (Some once thought\nnuclear sciences held this role--no longer! Mathematics takes the crown. Secondly, I&#39;m still dumbfounded that\na Paradigm Shift\n<i>first</i> offers the tools to fulfill itself? Staggering to consider the arbitrary changes ahead for a society that\nis provided the tools of social structural change first, but how quite convenient!</p>\n\n<p>\n<strong>II. Bureaucratic Atomization in a True Sharing Economy</strong>\n</p>\n\n<p>It is satisfyingly reassuring to see the good-natured, altruistic efforts among the thousands, upon thousands of\nopen-source volunteers, and blockchain innovators, like Vitalik Buterin author of Ethereum Virtual Machine, whose\naims and efforts make staggering progress each quarter. The potential for removing the &quot;middle-person&quot;\nfrom the day-to-day, micro-economic &quot;cost of living&quot;. This goes for for the exchanging of titles, legal\ndocuments, etc.</p>\n\n<p>Sharing of Resources is, in my personal opinion, critical to global future--both out of increasing necessity in allocating\nincreasingly limited resources; an arbitrary rearrangement of\n<i>Social Structure</i> and distribution of its resources. While the exponential population growth looms on the near\nhorizon, a clear, pre-existing solution begins with a focus on\n<i>smart</i>, effective sharing of resources. The driving principle of sustainability is made convenient by means of\nblockchain technology, extending for example to local economies, cooperatives, ride-sharing, etc.</p>\n\n<p>\n<strong>III. Removing Double-Dipping from International Remittances </strong>\n</p>\n\n<p>\n<i>&quot;Perfection is achieved, not when there is nothing more to add, but when there is nothing left to take away.&quot;\n</i>\n<br /> --Antoine de Saint-Exup&eacute;ry, 1939</p>\n\n<p>Taxes and tariffs are difficult enough, the double-dipping of the current international remittance system, &aacute;\nla Western Union, does not reflect the global, sharing Economy of 2018. The existing remittance system (not speaking\nto\n<i>centralized</i>, middle-man alternatives like PayPay, etc.)--supposing if I wire $2 Loonie to a Canadian friend&#39;s\nCanadian Bank--requires payments executed through two separate bank transactions in two national payments systems,\nthus the sending country and receiving country each take a cut. Like everything else--c&#39;est la vie. Or is it?\nThe beauty of Ethereum is that it &quot;talks&quot; well with others and across borders, while Bitcoin remains of\nlittle use for micro-transactions that involve semi-basic calculations. The reason being that Bitcoin blockchain\nlanguage, Script, cannot support loops (while statements, etc.)</p>\n\n<p>Currently, both EOS and Ethereum blockchains appear poised for the most financial-friendly blockchain tech.</p>\n\n<p>1.\n<a href=\"https://www.economist.com/news/business/21722869-anti-establishment-technology-faces-ironic-turn-fortune-governments-may-be-big-backers\"\ntarget=\"_blank\">https://www.economist.com/news/business/21722869-anti-establishment-technology-faces-ironic-turn-fortune-governments-may-be-big-backers</a>\n</p>\n\n<p>2.\n<a href=\"https://blog.ethereum.org/2016/02/09/cut-and-try-building-a-dream/\" target=\"_blank\">https://blog.ethereum.org/2016/02/09/cut-and-try-building-a-dream/</a>\n</p>\n\n<p>3.\n<a href=\"http://www.bard.edu/library/arendt/pdfs/Sartre-Search.pdf\" target=\"_blank\">\n<i> Search for a Method</i>, Jean-Paul Sartre, 1957</a>.\n<br />\n<small>Sartre would later be awarded the Nobel Prize in 1964, but declined it.</small>\n</p>\n\n<p>\n<a href=\"https://projektintegracija.pravo.hr/_download/repository/Kuhn_Structure_of_Scientific_Revolutions.pdf\" target=\"_blank\">4. Kuhn, Thomas, The Structure of Scientific Revolutions, </a>\n</p>\n\n<p>\n<a href=\"https://hbr.org/2017/01/the-truth-about-blockchain\" target=\"_blank\">5. Harvard Business Review,\n<i>The Truth about Blockchain, Feb. 2017. (This is an older article, but very clear &amp; insightful)</i>\n</a>\n</p>\n  ",
    "done": true
  },
  {
    "id": "8",
    "did": "18-02-20",
    "date": "Feb 20, 2019",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Cryptocurrency&#39;s Cumbersome Carbon Footprint",
    "post": "\n  <p class=\"firstparagraph\">I feel that data is one of the more underestimated new commodities of the age. Most visualize data as rows and columns,\nand at most only non-conditional dynamic data. Data are not so mute! Data, in most object-oriented languages at\nleast, represents\n<i>functions</i>, conditions, and predicted values. And so, our own behavior, coupled with our networks&#39; behavior,\ncoupled with predictive analytics--this represents a wealth of information beyond our attributed or inherited traits.\nThe programming is\n<i>in</i> the data, however, citizens have become less and less involved, ceding app by centralized app our own information\nand ensuring profit to 3rd party marketers. The centralized nature of the internet allows for this, while the new\nlandscape of\n<i>decentralized applications</i> (DAPP) completely upends this structure of the status quo.</p>\n\n<p>\n<strong>IV. Enabling citizens to own &amp; monetize their data (&amp; protect privacy)</strong>\n<br /> Ethereum offers a decentralized solution to &quot;owning&quot; one&#39;s own data, as data can be decentralized\nand returned to the individual&#39;s control, and\n<i>profit</i>. As sure as the 19th century&#39;s &quot;labor-hour&quot; became commodified to a calculable asset, i.e.\nproperty, which\n<i>another</i> party controls and makes profit; And as sure as the 20th century&#39;s data analytics became commodified\ninto calculable assets for another party to take control and make profit; then only now in this 21st century does\ntechnology offer a new, more egalitarian path.</p>\n\n<p>\n<strong>V. Ensuring compensation for the Creators of Value </strong>\n<br /> So, how would decentralized innovations of blockchain\n<i>distributed ledger</i> technology compensate those whose actions, behavior, opinions, friend-networks, artwork,\nmusic, videos and other contributions profit the creator?</p>\n\n<p>\n<strong>VI. The Halcyon Age of Transaction-Chain Enterprise</strong>\n</p>\n\n<p class=\"quote\">According to Greek Mythology, the days of eery, noticeable lack of storms have never been interpreted as a period\nof grace. Moreso,\n<i>Halcyon</i> tranquility only means a temporary moratorium on the winds and waves, imposed by Aeolus, God of Wind,\nto protect the nesting eggs of Alcyone, his daughter.</p>\n\n<p>If blockchain tech changes how we do research, analysis, and forecasting, as much as it changes international, and\ncross-industry transactions, then are we faced with a similar dilemma as the &quot;novelty&quot;, and double-dealing,\nof multi-nationals of the 1990s? No, because blockchain renders organizations, even those with a spotty past, into\ntransparent, democratic, efficient, secure and easily scrutinized.</p>\n\n<p>After all, without transparent proof, how else would I know my bananas are the &quot;pura vida&quot; Costa Rique&ntilde;\nones? More importantly, what was the carbon footprint of that banana&#39;s journey from its native soil to my breakfast\ntable? New blockchain companies like\n<a href=\"https://www.provenance.org/\">Provenance.org</a>,\n<a href=\"http://www.skuchain.com/\" target=\"_blank\">skuchain</a>,\n<a href=\"http://www.blockverify.io/\">http://www.blockverify.io/</a> are a few noticeable game-changers. So, for bananas not backed by mathematical proofs,\nI really have to ask myself, is it\n<i>really</i> an authentic Fair Trade banana?</p>\n\n<p>Transactions are hardly valuable in the products themselves, if removed from the value of the\n<i>transaction per se</i>. International supply chain transactions, by virtue of a recently possible decentralized,\npermanent record and monitoring, have begun to make inroads in agriculture, petroleum, pharmaceuticals, food-supply\nand other multi-stage industries.</p>\n\n<p>If corporate and governmental transactions are to be made public--many bearing enterprise or State secrets, then\nwill forecasting also go the way of birds? Possibly. Online platforms like Augur\n<sup  >8</sup>are creating global, decentralized prediction markets, in domains like sports betting, financial markets\nspeculation and so forth. Armed with vast, transparent knowledge, the everyday person can now access the whims and\npower of Aeolus, and forecasting the winds of Fortune.</p>\n\n<p>\n<strong>VII. Reinventing Government &amp; Democracy</strong>\n<br /> ...to be completed...</p>\n\n<p>1.\n<a href=\"https://www.provenance.org/\" target=\"_blank\"> https://www.provenance.org/ </a>\n</p>\n\n<p>2.\n<a href=\"http://www.skuchain.com/\" target=\"_blank\"> http://www.skuchain.com/ </a>\n</p>\n\n<p>3.\n<a href=\"http://www.blockverify.io/\" target=\"_blank\"> http://www.blockverify.io/ </a>\n</p>\n  ",
    "done": true
  },
  {
    "id": "7",
    "did": "18-02-21",
    "date": "Feb 21, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Facebook-Friendly Third-Generation Data Structures",
    "post": "\n  <p class=\"firstparagraph\">Today, I&#39;m going to write about data structures, and challenges that face Vitalik Buterin and other blockchain\narchitects. &#39; Now, why in the\n<i>world</i> would I or anyone else care about ooh, merge sorts, bubble sorts, classificatory trees, and the advent\nof a third form of data structure?</p>\n\n<p>Today, we live in an ever more relational world. With all our technology, we just can&#39;t wait to hear the latest\ngossip about sister Becky&#39;s Boyfriend&#39;s Brother&#39;s Friend that\n<i>also</i> got to meet Shakira. Gossip to one person is a valuable asset to the data analyst. Because, how else could\nan algorithm draw simultaneous conclusions about two friends that &quot;liked&quot; the same Samsung VR, and that\nthey are both located near Best Buy. Thanks to classificatorial wisdom of AI &amp; plain machine-learning?</p>\n\n<p>These relational queries are simply too difficult for relational, row &amp; column SQL data structures. In fact,\nmany queries are impossible, due to unprescient database schema architectures. Next, with the need to &quot;objectify&quot;\ndata into non-relational objects, rather than an antiquated, rigid row-and-column design. Thus, the second major\ntype of data structure is more flexible and adept in finding these relational queries that are ever more in vogue.\nHowever, the crystal-like, pristine non-relational, No-SQL designs quickly turn to spaghetti, and are poor for scalability.\nBetween a rock and a hard place, a third data structure has emerged in recent years.</p>\n\n<p>Graph Data Structures\n<sup>2</sup> allow data queries that had otherwise been impossible to capture in an entity relationship diagram. The\nideal example to clarify is the manner that the Swiss banks&#39; accounts were discovered to be hiding vast amounts\nof hidden taxes, etc. The cover-up was so well-constructed that not until new, graph database queries discovered\npatterns of money flow\n<sup>1</sup>:</p>\n\n<p class=\"quote\">The data was then turned into a graph format to detect then fine-tune the connections between the nodes. The Swiss\nLeak held around 60,000 files that contained information about over 100,000 clients in 203 countries, which means\nthat the resulting graph database had more than 275,000 nodes with 400,000 relationships among them.</p>\n\n<p class=\"quote\">By being able to easily visualise the networks around clients and accounts, the reporters found many more connections\nthan they had before, which lead to the Swiss Leaks revelations soon being shared with the public and regulators\nacross the globe.</p>\n\n<p>And you thought that plagiarism-detecting software was impressive for complexity! The beauty of this newly available\nsoftware (even Microsoft jumped on board in recent years) means that sociologists, economists can begin to make\nbetter headway in the way that our many interactions become more complex with more data. Remember, in the past ten\nminutes, more data information was just produced than most of human history! Thus, new and upcoming needs in domains\nlike content management &amp; access control, geo-routing (public transportation), gene sequencing, bio-informatics,\nand so on. So, as technology takes us forward, and we make our considerations, let&#39;s stick by the golden rules\nof parallel processing, scalability, and, now, graph-network mindedness for the new data structures, and schema,\nof the Era!</p>\n\n<p>1.\n<a href=\"https://www.globalbankingandfinance.com/how-a-graph-database-unearthed-major-financial-improprieties/\"\ntarget=\"_blank\"> https://www.globalbankingandfinance.com/how-a-graph-database-unearthed-major-financial-improprieties/ </a>\n</p>\n\n<p>2.\n<a href=\"https://neo4j.com/blog/analyzing-panama-papers-neo4j/\">By being able to easily visualise the networks around clients and accounts, the reporters found many more connections\nthan they had before, which lead to the Swiss Leaks revelations soon being shared with the public and regulators\nacross the globe. </a>\n<br /> Other major vendors in graph data structures based on Neo4j: OrientDB, ArangoDB, Titan, mongoDB, Complexible Stardog,\nand Franz AllegroGraph.</p>\n  ",
    "done": true
  },
  {
    "id": "6",
    "did": "18-02-22",
    "date": "Feb 22, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Languages",
    "post": "\n  <p class=\"firstparagraph\">While I&#39;ve had blockchain-related topics on the mind lately, it seems I can&#39;t escape it as I broach new fields--blockchain\n  is everywhere! Well, I had begun my blog with intentions about the accelerated speed of language and syntax formation,\n  and the curious phenomenon I&#39;d call, for lack of a better word or or my own reading, &quot;declarative-syntax-merging&quot;.\n  This involves the curious, and largely unknown, growth of JavaScript scripting language into almost every domain\n  of web apps, data analysis, and even the bounds of\n  <i>Logic</i> itself. Though I won&#39;t submit my readers to a history of a language, suffice it to say that, &quot;If\n  a certain algorithm, device, or object is programmable, then it will eventually be programmed in JavaScript.&quot;</p>\n  \n  <p>Without getting into technicals, I&#39;ll instead use a perfect metaphor--the manner by which English merged with\n  French, beginning with the conquests of William of Normandy, around 1096 onward. Almost a thousand years later,\n  we can see how English grammar inherited it&#39;s Anglo-Saxon Linguistic roots, along with the core vocabulary;\n  Then, as English vocabulary moves past the first few thousand core words, e.g. &quot;milk&quot; or &quot;house&quot;\n  from &quot;melche&quot; or &quot;haus&quot;, then more than 70% of English Vocabulary is directly inherited from\n  French, e.g. &quot;lactose&quot; or &quot;mansion&quot; from &quot;lait&quot; or &quot;maison&quot;.</p>\n  \n  <p>Similarly, the language of the web and original browsers, JavaScript, has similarly morphed into a new language called\n  Solidity, but in only a micro-fraction of English&#39;s time. The usual FOMO logic propels coding language use,\n  for example FOMO induced Microsoft&#39;s flagship Text Editor, Visual Code, to adopt it years ago.\n  <sup >1</sup> The language of Ethereum Blockchain is Solidity, which like the above example, has two parents, one non-legitimate.\n  It is in all respects totally JavaScript, yet with object-oriented elements of C++. For the layperson, let&#39;s\n  just say Solidity resembles a &quot;Liger&quot;, in it is at it&#39;s core JavaScript, yet with increasing sophistication\n  based on C++ logic, its head and torso has begun to resemble the powerful machine-code of C++ ever more. And it\n  is a beautiful, but curious phenomonenon.</p>\n  \n  <p>\n  <a href=\"http://www.ibtimes.co.uk/microsoft-adds-ethereum-language-solidity-visual-studio-1552171\">http://www.ibtimes.co.uk/microsoft-adds-ethereum-language-solidity-visual-studio-1552171</a>\n  </p>\n \n  ",
    "done": true
  },
  {
    "id": "5",
    "did": "18-02-23",
    "date": "Feb 23, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "1.4 Million Reasons for more Women in Tech",
    "post": "<p class=\"firstparagraph\">1.4 million\n  <i>new</i> jobs by 2020; End over end, year after year, the computer programming industry continues to add another\n  20% more jobs each year, for the next five years. This is the only field that demand outstrips the supply--and increasingly\n  short supply. So much so, the US Department of Labor forecasts U.S. citizens will be able to fill 39% of those positions;\n  there are not enough Immigration visas (especially in the Trumpian era of isolationism) to make up the rest.</p>\n  \n  <p>&nbsp;</p>\n  \n  <p>So, how is it that only 14% of females in the entire field of cybersecurity? Silicon Valley is, at its best, obscenely\n  one-sided. At Google, only 17% of the company&#39;s tech jobs are filled by women. Facebook women staff only 15%\n  of tech jobs, and Twitter? 10% female. The figures on women in computer science across the nation, across the entire\n  industry are not improving, but\n  <i>declining</i>?\n  <sup>1</sup>\n  </p>\n  \n  <p>Of course, we&#39;ve heard these statistics from any given headline, and in the halls across the university landscape,\n  starting with Women in STEM (Science, Tech, Engineering, Mathematics) programs.\n  <sup>3</sup> Yet, why, with so much money, so many programs, so many non-governmental, non-profit effort?</p>\n  \n  <p>I argue that tech\n  <i>climate </i> is directly to blame. Who then? Not a person, but principles are to blame. Culture--often defined as\n  shared beliefs, norms, language and behaviors--can hardly be changed, but it can be understood.\n  <br /> There is a book, called &quot;Program or be Programmed\n  <sup id=\"24-4\">4</sup>\n  </p>\n  , by which the author explains social consequences of a dichotomized society--between those that manipulate the environment\n  around them, whether automating tasks at work, or simply fixing a simple software bug, by adding a comma. This literacy\n  of the Current Era is akin to the 26-letter alphabet of written sentences and paragraphs, and--not to be taken for\n  granted--is the exclusive form of communication, outside of a 100-foot perimeter, up until 150 years ago. Knowledge\n  is not power, the communication of knowledge is power.\n  \n  <p>&nbsp;</p>\n  \n  <p>I argue that today, the power is to program one application programming interface (API) to talk to another API. In\n  other words, the ability to directly communicate with software at the command-line is not now a requisite skill,\n  but promotions would not escape this necessity! So, now reverting back to the subject of women in tech, American\n  leadership is in deep peril without more female insight. I will finish by citing that Ares, the violent, untamed\n  Greek\n  <i>god of war</i>, cannot always drive the Capitalist engine; because She, Athena, the\n  <i>goddess of intelligence</i> represents true strategy!</p>\n  \n  <p>1.\n  <a href=\"https://www.huffingtonpost.com/2015/03/27/women-in-tech_n_6955940.html\" target=\"_blank\">https://www.huffingtonpost.com/2015/03/27/women-in-tech_n_6955940.html</a>\n  </p>\n  \n  <p>2.\n  <a href=\"https://fairygodboss.com/articles/women-in-tech-facts-figures-and-percentages\" target=\"_blank\">https://fairygodboss.com/articles/women-in-tech-facts-figures-and-percentages</a>\n  </p>\n  \n  <p>3.\n  <a href=\"https://www.aauw.org/research/why-so-few/\" target=\"_blank\">https://www.aauw.org/research/why-so-few/</a>\n  </p>\n  ",
    "done": true
  },
  {
    "id": "4",
    "did": "18-02-24",
    "date": "Feb 24-25, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "3rd Generation Blockchain: How Fast can the Blockchain Operate? Part III: : The Challenges for the Directed Acyclic Graph (DAG) with Ripple and  Iota Coin",
    "post": "<p class=\"firstparagraph\">While coding up a better shell for this website, I thought it&#39;s remarkable how our lives get easier and easier\n  with each passing year of tech. Using JavaScript--the primordial web-coding language--I marvel at the convenience\n  of delegating mundande coding stuff to taskrunners, like\n  <i>Gulp</i>--a programmable package manager that &quot;bundles&quot; up the libraries to be used in the app. It is\n  truly a joy!</p>\n  \n  <p>I write four styling\n  <i>functions</i>, with about 16\n  <i>variables</i> and voil&agrave;! I finish in 3 hours what would have taken me 15 hours, then another 5 hours a month\n  for upkeep. Instead, now, it&#39;s as though I wind up the clock, and need only periodically check, and perhaps\n  update a variable or two ... Technology. I&#39;m gushing for joy.</p>\n  \n  <p>This was mere JavaScript--with a truly\n  <i>Turing Complete</i>--pan-algorithm status--languages, the possibilities are 100-fold with Python language library\n  collection; this library collection includes NASA modules, mathematical proofs, and limitless uses from web-scraping\n  for unstructured data to an excellent data visualization collection. Sometimes I feel like I&#39;m in the Library\n  of Congress, and better yet because, PIP, the Python package manager acts and automates like a cyborg librarian,\n  for lack of better imagery.</p>\n  \n  <p>I just have so much joy watching a project come to life, and it&#39;s even a greater delight if this project comes\n  to life and stays alive, through the joys of automation!</p>\n  ",
    "done": true
  },
  {
    "id": "3",
    "did": "18-02-26",
    "date": "Feb 26, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Cryptocurrency&#39;s Cumbersome Carbon Footprint",
    "post": "\n  <p class=\"firstparagraph\">I must confess that on the very day that Our Daily Tech Blog gets an under-the-head make-over for security&#39;s\n  sake, I wrote the new formatting file right over today&#39;s post. Amazing, and the two occurred nearly simultaneously\n  as I worked on them, their paths crossed and poof, gone! Same platform, and I paid the price! Whether I change my\n  ways is yet to be seen, but I shall continue with my original theme for the day, namely, Sustainability, a.k.a.\n  Carbon Footprint.</p>\n  \n  <p class=\"quote\">Power consumption is one of the major costs of bitcoin mining, as dedicated machines crunch the algorithms that build\n  a record of every single bitcoin transaction and are rewarded with tiny fractions of a bitcoin for their efforts.\n  <sup >1</sup>\n  </p>\n  \n  <p>Today I have a mild Critique and Praise for the blockchain sustainability problem caused by sky-high electricity\n  bills! Computer algorithms do waste electricity, not like your Widescreen. More electricity is gobbled up by small\n  and large mining operations in nearly every country than small nations!\n  <sup >1</sup>. Ethereum, Bitcoin and a handful of other &quot;Proof-of-Work&quot; designs require electricity because\n  the investment in equipment itself is investment, but more importantly, two-way incentivation for mining drives\n  the system, and the scarcity demand through difficulty computations.</p>\n  \n  <p>So, is the electricity consumption really\n  <i>correlated</i> with the value, scarcity, of the currency? Yes. Digiconomist--a cryptocurrency analysis site\n  <sup\n  id=\"digiconomist\">3</sup> estimates\n  <i>each</i>Ethereum transaction represents a 45 Kilowatt-hour of electricity&#39;s mining. (A visa credit card transaction\n  is 0.00651 kWh. The entire Ethereum global blockchain could be &quot;using as much as 4.2 Terawatt-hours (tWh),\n  or slightly more than the country of Cyprus\n  <sup  >1</sup>.&quot; So, electricity comparisons are telling, but how does this relate to its environment impact, sustainability\n  itself?</p>\n  \n  <p>Carbon Footprint, our energy consumption index, can be compared to another element of scarcity, which dictates fluctuations\n  in value: Gold. According to\n  <i>Digiconomist</i>, an average household&#39;s Carbon Footprint is about 10 tons of CO2 per year. The article does\n  the math for us very succinctly:</p>\n  \n  <p class=\"quote\">On top of this, we can find that the process of mining Bitcoin isn&rsquo;t just more energy-intensive, but also has\n  a bigger environmental impact. To reach that conclusion, we first need to estimate the carbon footprint for both.\n  For Bitcoin we can, again, get this number from the Bitcoin Energy Consumption Index. For gold, we assume a carbon\n  footprint of 20 tons of CO2e per every kilogram of gold mined\n  <sup >3</sup>.</p>\n  \n  <p>The article continues to clarify that 33,000 kilograms of CO2 per unit mines (comparatively, one Bitcoin&#39;s worth\n  of Gold is 4,000 kilograms of CO2). At the end of the day, the electricity costs--if not sustainable long-term--could\n  spell trouble. Hence, the three S&#39;s, mentioned last, sustainability is perhaps a larger issue than blockchain\n  Security and Scalability challenges. Again, this is a problem that the third largest cryptocurrency does not have:\n  <i>Ripple</i>, which does not bear a carbon footprint\n  <sup >4</sup>.</p>\n  \n  <p>&nbsp;</p>\n  \n  <p>0.\n  <a href=\"https://www.cnet.com/how-to/bitcoin-ethereum-or-litecoin-which-cryptocurrency-is-best-for-you/\" target=\"_blank\">https://www.cnet.com/how-to/bitcoin-ethereum-or-litecoin-which-cryptocurrency-is-best-for-you/</a>\n  <br /> For those new to cryptocurrencies, this is a fairly succinct article to cryptocurrencies, and their underlying\n  structure.</p>\n  \n  <p>1.\n  <a href=\"https://motherboard.vice.com/en_us/article/d3zn9a/ethereum-mining-transaction-electricity-consumption-bitcoin\"\n  target=\"_blank\">https://motherboard.vice.com/en_us/article/d3zn9a/ethereum-mining-transaction-electricity-consumption-bitcoin</a>\n  </p>\n  \n  <p>2.\n  <a href=\"http://www.wired.co.uk/article/how-much-energy-does-bitcoin-mining-really-use\" target=\"_blank\">http://www.wired.co.uk/article/how-much-energy-does-bitcoin-mining-really-use</a>\n  </p>\n  \n  <p>3.\n  <a href=\"https://digiconomist.net/bitcoin-mining-more-polluting-than-gold-mining\" target=\"_blank\">https://digiconomist.net/bitcoin-mining-more-polluting-than-gold-mining</a>\n  </p>\n  \n  <p>4.\n  <a href=\"https://ripple.com/xrp/\" target=\"_blank\">https://ripple.com/xrp/</a>\n  </p>\n  ",
    "done": true
  },
  {
    "id": "2",
    "did": "18-02-27",
    "date": "Feb 27, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "After Yesterday&#39;s Scathing Post, A Look at my own Carbon Footprint",
    "post": "<p class=\"firstparagraph\">In my reflections about environment sustainability issues, I confess I&#39;m sort of a hypocrite ... The whole matter\nthat caused my own introspection begins with my usual daily vexation: Tangles of wires!\n<br /> &nbsp; ... I&#39;ve been having electricity issues, here as of late ...</p>\n\n<p>On one side, my tiny Yoga Ultrabook usually likes to charge just fine with my phone charger--if I&#39;m stuck without\nmy charger. And due to an untimely end to the charger, I needed a replacement. So, singular errand of the day was\na trip to Best Buy to peruse for a 45-Watt USB-C charger ( the new oval charging port on Samsung 8&#39;s, LG G6&#39;s\nand newer Apple products).</p>\n\n<p>Meanwhile, my credit-card sized Raspberry Pi computer runs on an old-school USB charger--a whole Linux Server Tower\non a cell-phone charger. Then, we have my trusty Dell (actual) Tower with 16 Gigs of RAM, 2-terabytes, etc. that\nalso seems to need an extra fan to stay cool--probably the sustainability of 100 Raspberry computers. My entire\ncarbon footprint changes more with the electrical products that I use, than my vehicle! Well, I also confess my\nJeep Cherokee can&#39;t even boast 20 miles per hour ... oops, conscience pangs, ouch ... Well, hypocritical, slightly,\nbut found not guilty since I&#39;m a bike-commuter for life!</p>\n",
    "done": true
  },
  {
    "id": "1",
    "did": "18-02-28",
    "date": "Feb 28, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "One Last Word about Bitcoin&#39;s Carbon Footprint",
    "post": "\n<p class=\"firstparagraph\">Environmental Sustainability, again, and a higher-level view of the dilemmea...I couldn&#39;t resist:\n<br /> Bitcoin&#39;s Initial Coin Offering was 2011 or so, then Ethereum, with Ether for currency was 2015; These two,\never so prescient designs, also have their Achilles Heal. These two are\n<strong>&quot;Proof of Work&quot; currency algorithsms</strong>. This means that the &quot;Demand&quot; side of supply-and-demand,\nderives from\n<i>difficulty levels</i> of crypto-blocks to mine. So, miners are incentivized to spend $1500 on a semi-mediocre-good\nmining rig (which is basically 20 NVIDIA Graphics Cards tied together to stack of two-by-fours with lots of fans\n... erhem, sustainability?...</p>\n\n<p>And for each block that is &quot;solved&quot;, hence the block being validated, and somebody&#39;s cryptocurrency\npurchase/transaction is resolved! (takes about 12 minutes for the whole global blockchain to cycle, and Ethereum\nis less than a minute). So, the whole cycle continues, churning through coal- and carbon-stained hands of the electricity\nfed to these crypto-mining rigs\n<sup>1</sup>. For many it&#39;s a hobby, like the British Hobbyists&#39; love for ham- and short-wave radio setups, yet\nthis profitable, yet particular hobby resembles the 1870&#39;s coal factory smoke stacks in South London!</p>\n\n<p>Let&#39;s face it, if Ethereum is able to successfully hard-fork to a Proof-of-Stake system soon--and Vitalik Buterin\nand his crew assure us it is coming\n<sup>2</sup>--then great--problem solved, everything eventually converts to Ethereum. If\n<i>not</i>they face an existential threat. Because, in a more enlightened ten years from now, those mining depots\n<i>would</i> look like unfettered factory smoke-stacks. Proof-of-Stack, whose currency value is not set to difficult\nof algorithm puzzle (hence,\n<i>proof-of-work</i>, but rather to ownership of &quot;voting pools&quot;, which is a\n<i>\n<strong>Consensus-Based Blockchain algorithm</strong>\n</i> [Complex subject best reserved for a rainy day, or better yet, no day! I may revisit this alternative in a funner\nway, here&#39;s a glimpse from Vitalk&#39;s @VitalikButerin tweet yesterday:</p>\n\n<p class=\"quote\">Question for mathematicians: is there a assumed-to-be-normal number (ie. digits are random, like pi or e) where you\ncan calculate the nth digit in log(n) (or even polylog(n)) time? If so, then H(x) = digits[x ... x+100] seems like\nit would be a cool cryptographic hash algo.</p>\n\n<p>Now, I am by no means a detective, but by the sound of those tweets, the Proof-of-Work algorithm seems to still be\nof utmost importance ...</p>\n\n<p>1.\n<a href=\"https://blockexplorer.com/news/ethereum-launches-casper-testnet-paving-way-proof-stake/\" target=\"_blank\">https://blockexplorer.com/news/ethereum-launches-casper-testnet-paving-way-proof-stake/</a> and also,\n<a href=\"https://www.trustnodes.com/2017/11/28/ethereums-proof-stake-casper-testnet-nears-launch\"\ntarget=\"_blank\">https://www.trustnodes.com/2017/11/28/ethereums-proof-stake-casper-testnet-nears-launch</a>\n</p> \n\n<p>Copyright &copy; 2018 All Rights Reserved. &nbsp; | &nbsp;\n<a href=\"http://www.thomasmaestas.net\" title=\"Contact Information: thomasmaestas.net/\">\n  thomasmaestas.net</a>&nbsp; | &nbsp;\n<img src=\"dist/img/paypal.PNG\" alt=\"PayPal Emblem\" height=\"\n15\"></img>\n<a href=\"https://www.paypal.com/paypalme/ThomasMaestas\" style=\"color:white;text-decoration:none;\">\n  &nbsp; Blog Support Appreciated!</a>\n</p>\n",
    "done": true
  }
]