[
  {
    "id": "24",
    "did": "07-28-18",
    "date": "July 28-29, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "",
    "post": "<p class=\"firstparagraph\">Cloud.google.com wins the day for offering the Willy Wonka's of Technological Candy at a free tour's view: You won the Golden Ticket. Google Cloud CEO Diane Greene explains that prioritizing customers' needs rather than drifting with market forces offers solid growth moving past technological shifts and drifts with little course correction.</p>\n <p class=\"quote\">While Google is still looking up at Amazon Web Services and Microsoft Azure when it comes to infrastructure cloud computing, it appears to be finding the balance between keeping engineers happy with cloud-native computing tools and courting enterprise company suits with service-level agreements and steak dinners.<sup>1</sup></p>",
    "blogcite": "\n \n <p class=\"cite\">1. <a href=\"https://cloud.google.com\"   target=\"_blank\">https://cloud.google.com\n </a>\n </p><p class=\"cite\">1. <a href=\"https://www.geekwire.com/2018/google-cloud-ceo-diane-greene-wane-cloud-pricing-wars-never-want-win-price/\"   target=\"_blank\">https://www.geekwire.com/2018/google-cloud-ceo-diane-greene-wane-cloud-pricing-wars-never-want-win-price/\n </a>\n </p>"
  },
  {
    "id": "23",
    "did": "07-27-18",
    "date": "July 27, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Hooray for Planet Green!",
    "post": "<p class=\"firstparagraph\">Planet Green dodged a bullet recently, as activists' climate change research officially gains legitimacy from the Supreme Court, albeit a few of their qualms ... But who could deny that if there is one thing that will save the earth, it's knowledge, knowledge far outweighs any other salvo. This is because the more data, the more accurate the models to indicate specific environmental needs and threats--<i>not to mention all the clues the data could reveal toward helping earth regain balance. </i></p><p>A.I. training would starve if the Supreme Court would have allowed administration clamp-downs on knowledge. After all, the overwhelming popular and professional opinions favor earth-friendly policies. \n<p class=\"quote\">The Supreme Court on Monday denied the Trump administration’s plea to halt proceedings in a landmark lawsuit by young people seeking stronger federal action on climate change.<sup>1</sup>\n</p>",
    "blogcite": "<p class=\"footnotes\">1. <a href=\"http://thehill.com/policy/energy-environment/399562-supreme-court-denies-trump-admin-request-to-halt-youth-climate\"   target=\"_blank\">http://thehill.com/policy/energy-environment/399562-supreme-court-denies-trump-admin-request-to-halt-youth-climate\n</a>\n</p>\n<p class=\"cite\">1. <a href=\"http://thehill.com/policy/energy-environment/399562-supreme-court-denies-trump-admin-request-to-halt-youth-climate\"   target=\"_blank\">http://thehill.com/policy/energy-environment/399562-supreme-court-denies-trump-admin-request-to-halt-youth-climate\n</a>\n</p>\n "
  },
  {
    "id": "22",
    "did": "07-26-18",
    "date": "July 26, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Bot Mercenaries:<br />",
    "title": "As Long as I Can Feel the Beat, Baby I don't Need Dollar Bils to Have Fun Tonight<br /><span class=\"pull-left\"> - Sia",
    "post": "\n<p class=\"quote\"><i>“It feels like a magical mirror that reflects your moves with images of all kinds of human activity – from sports and dance to martial arts, acting and beyond.”</i></br></br>\n--Google creative technologist Irene Alvarado \n</p>\n<p class=\"firstparagraph\">Magical Mirror is a wonderful tool for A.I.-powered video imaging and mimicry. Google's soon-to-be open source software is freely available for A.I. developers ... now that should be amusing to have life-like personal avatars will certainly make for some interesting uses. \n The power of Big Data really proves itself, but Google's algorithm-sharing provides a real democracy of A.I. technology for everyone to use.  On the other side of the coin, accuracy in video and voice mimicry now means A.I.-driven authenticity detectors will soon prove pretty darn useful!\n</p>\n",
    "blogcite": "<p class=\"cite\"> \n<p class=\"footnotes\">1. <a href=\"https://www.standard.co.uk/tech/google-move-mirror-dancing-gif-a3892471.html\"   target=\"_blank\">https://www.standard.co.uk/tech/google-move-mirror-dancing-gif-a3892471.html\n</a>\n</p> \n</p>"
  },
  {
    "id": "21",
    "did": "07-25-18",
    "date": "July 25, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Bot Mercenaries:<br />Armies of Secret Shoppers",
    "post": "<p class=\"firstparagraph\">Wired.com ...</p>\n<p class=\"quote\"> \n\"But big retailers can sell millions of products, so it's not feasible to have workers browse each item and manually adjust prices. Instead, the companies employ software to scan rival websites and collect prices, a process called “scraping.” From there, the companies can adjust their own prices.\"<br /><br />\n\"Retailers want to see what their rivals are doing, but they want to prevent rivals from snooping on them; retailers also want to protect intellectual property like product photos and descriptions, which can be scraped and reused without permission by others. So many deploy defenses to subvert scraping ...\" <sup>1</sup></p>",
    "blogcite": " \n<p class=\"footnotes\">1. <a href=\"https://www.wired.com/story/scraper-bots-and-the-secret-internet-arms-race/\"   target=\"_blank\">https://www.wired.com/story/scraper-bots-and-the-secret-internet-arms-race/\n</a>\n</p>   "
  },
  {
    "id": "20",
    "did": "07-24-18",
    "date": "July 24, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Bot Mercenaries:<br />Warrior Bots in Space",
    "post": "<p class=\"firstparagraph\">Space.com ...</p>\n  <p class=\"quote\">\"NASA's Robonaut program and Roscosmos' FEDOR program seem to share the goal of creating robots that make it safer for humans to accomplish things in space that otherwise would be too dangerous for humans to attempt.<i> Still, the FEDOR androids' gun-wielding design might raise a few eyebrows.\"</i><sup>1</sup></p>\n  <img src=\"dist/img/droid.jpg\" class=\"zoom\" width=\"288px\" />\n  ",
    "blogcite": " \n<p class=\"footnotes\">1. <a href=\"https://www.space.com/41253-russian-robots-fly-to-space.html\"   target=\"_blank\">https://www.space.com/41253-russian-robots-fly-to-space.html\n</p>   "
  },
  {
    "id": "19",
    "did": "07-23-18",
    "date": "July 23, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Amazon's Prime Day Scaling Slip and Recovery:<br />A How-To Guide to Graceful Error Handling",
    "post": "<p class=\"quote\">\n  <i> One person familiar with the matter described the office scene as “chaotic” and said at one point more than 300 people tuned in to an emergency conference call.  “Currently out of capacity for scaling,” one of the updates said about the status of Amazon’s servers, roughly an hour after Prime Day’s launch. “Looking at scavenging hardware.” <sup>1</sup></i> </p>\n  <p class=\"firstparagraph\">Prime Day's saga of cascading failures stemming from an internal software reveals the <i> relentless challenge of Scalability</i>. In their words, the root cause was a \"breakdown in auto-scaling, a critical component when dealing with unexpected traffic spikes\"<sup>1</sup>. So the exponential spikes may be hard to expect because their nature is both spontaneous, but the inflection is calculable! ...only dramatically represented as the folding a sheet of paper 42 times to reach the moon ...\n  </p>\n  <img src=\"dist/img/paper.png\" width=\"340px\" class=\"zoom\" />\n  <p><small>Image Credits: Coder's Revolution</small></p>\n  <p class=\"quote\">  Amazon wasn't able to handle the traffic surge and failed to secure enough servers to meet the demand on Prime Day, according to expert review of internal documents obtained by CNBC.<br /><br />\n  That led to a cascading series of failures, including a slowdown in its internal computation and storage service called Sable and other services that depend on it, including Prime, authentication and video playback.\n  Amazon immediately launched a scaled-down \"fallback\" front page to reduce workload and temporarily killed all international traffic too. \n  </p><p>And so, the same Bezosian leadership that manages space exploration's <strong>Blue Origin</strong> inspired a system of fall-back redundencies to get back up to speed dramatically within 80 minutes. Perhaps the quick, albeit unconventional recovery strategy deserves great respect--because chance happens to all!   \n  </p>\n  ",
    "blogcite": " \n  <p class=\"footnotes\">Image Credit: <a href=\"http://wwvv.codersrevolution.com/blog/will-a-piece-of-paper-folded-42-times-reach-the-moon\"   target=\"_blank\">http://wwvv.codersrevolution.com/blog/will-a-piece-of-paper-folded-42-times-reach-the-moon\n  </a>\n  </p>   \n<p class=\"footnotes\">1. <a href=\"https://www.cnbc.com/2018/07/19/amazon-internal-documents-what-caused-prime-day-crash-company-scramble.html\"   target=\"_blank\">https://www.cnbc.com/2018/07/19/amazon-internal-documents-what-caused-prime-day-crash-company-scramble.html\n</a>\n</p>   \n "
  },
  {
    "id": "18",
    "did": "07-21-18",
    "date": "July 21-22, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Cloud Wars, Part III:<br />Creativity that Turns on a Dime",
    "post": "\n  <p class=\"firstparagraph\">Business models of all shapes and sizes, and the diversity of tech that comes with them, are the natural consequence of<i> unlimited <strong>creative</strong> potential in Tech. So, a small business with few resources now has unlimited resources in the cloud with game-changing access to A.I.</i> Luckily, investments in smaller tech sources cover all sectors:</p>\n \n  <p class=\"quote\">The Energy Department has announced that it will award 95 grants worth a total of $95 million to 80 small businesses located in 26 states as part of its Small Business Innovation Research and Small Business Technology Transfer programs. <sup>1</sup>\n  </p>\n  <p>So, for as much as tech giants grow out of proportion, so do smaller businesses; because not only is the economic horizon  not a zero-sum tech pie, but growing. Secondly, the pace of evolving needs and tech capabilities favor smaller, more maneuvrable entrepreneur-producers.",
    "blogcite": " \n<p class=\"footnotes\">1. <a href=\"http://www.executivegov.com/2018/07/doe-to-award-rd-grant-for-innovative-tech-to-80-small-businesses/\n  \"   target=\"_blank\">http://www.executivegov.com/2018/07/doe-to-award-rd-grant-for-innovative-tech-to-80-small-businesses/\n  \n</a>\n</p>   \n "
  },
  {
    "id": "17",
    "did": "07-20-18",
    "date": "July 20, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Cloud Wars, Part II:<br />EZ-Commerce ",
    "post": "\n  <p class=\"firstparagraph\"> Cloud computing has never offered more convenience--especially in e-commerce. Walmart ramps up online presence, Amazon's Whole Foods ramps up offline presence. More importantly, everything and all businesses in between these two vortices has the opportunity to ride the same wave of platform and supply chain integration. </p>\n  <p class=\"quote\"> \n  </p>\n  <p class=\"quote\"> Retail giant Walmart Inc said on Tuesday it entered into a strategic partnership with Microsoft Corp for wider use of cloud and artificial intelligence technology, in a sign of major rivals of Amazon.com Inc coming together.\n<br /><br />\n  The five-year agreement will leverage the full range of Microsoft's cloud solutions, including Microsoft Azure and Microsoft 365, to make shopping faster and easier for customers, the Bentonville Arkansas-based company said.\n  \n  As part of the partnership, Walmart and Microsoft engineers will collaborate to migrate a significant portion of walmart.com and samsclub.com to Azure, Walmart added. <sup>1</sup>\n  </p>",
    "blogcite": " \n<p class=\"footnotes\">1. <a href=\"https://www.usnews.com/news/technology/articles/2018-07-17/walmart-microsoft-in-partnership-to-use-cloud-tech\n  \"   target=\"_blank\">https://www.usnews.com/news/technology/articles/2018-07-17/walmart-microsoft-in-partnership-to-use-cloud-tech\n  \n</a>\n</p>   \n "
  },
  {
    "id": "16",
    "did": "07-19-18",
    "date": "July 19, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Cloud Wars, Part I:<br />Behomeths from Across the Sea  ",
    "post": "\n  <p class=\"firstparagraph\">Alibaba--a Chinese search giant akin to Google--dwarfs the market value of Amazon. So much so, that Alibaba's earnings last year don't compete with Amazon's year, <i>but  past several years</i>.<sup>1</sup> Their success isn't a haphazard event, but years of strategy that focused on integrating services, whether online or offline origins, a true supply chain no longer discriminating marketplaces, logistics, cloud computing and payments. With unlimited global reach, big gets bigger and bigger. </p>\n \n  <p class=\"quote\">  \"Alibaba Cloud has always been dedicated to empower enterprises of different sizes to tap into opportunities in the digital age. With digital transformation poised to add close to $154 billion to India's GDP, this is a great opportunity for us to do business in India,\" Alex Li, General Manager of Alibaba Cloud Asia Pacific, said in a statement.<sup>2</sup> \n   </p>\n   <p>\n   Ultimately, what goes up does not necessarily come back down with cloud computing. And the further integrated systems become, the less feasible to divide, no matter which part of the globe.<sup>3</sup></p>",
    "blogcite": "\n  <p class=\"footnotes\">1. <a href=\"\n  https://www.lemonde.fr/idees/article/2018/07/10/comment-alibaba-va-tuer-amazon_5329170_3232.html\"   target=\"_blank\">https://www.lemonde.fr/idees/article/2018/07/10/comment-alibaba-va-tuer-amazon_5329170_3232.html\n  </a>\n  </p>    \n  \n  <p class=\"footnotes\">2. <a href=\"https://economictimes.indiatimes.com/small-biz/startups/newsbuzz/india-presents-great-business-opportunities-alibaba-cloud/articleshow/64974989.cms\"   target=\"_blank\">https://economictimes.indiatimes.com/small-biz/startups/newsbuzz/india-presents-great-business-opportunities-alibaba-cloud/articleshow/64974989.cms\n  </a>\n  </p>      <p class=\"footnotes\">3. <a href=\"https://www.wsj.com/articles/breaking-up-big-tech-is-hard-to-do-1532290123\"   target=\"_blank\">https://www.wsj.com/articles/breaking-up-big-tech-is-hard-to-do-1532290123\n  </a>\n  </p>    \n "
  },
  {
    "id": "15",
    "did": "07-18-18",
    "date": "July 18, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Musing Blockchain",
    "title": "By the Light of Ethereum",
    "post": "\n  <p class=\"firstparagraph\">Ethereum Architect Vitalik Buterin's unwavering commitment to the Crypto-contract currency finally pays off. In my February blogposts, I recounted the technical challenges that Ethereum still faced: As a \"Proof of Work\" currency that requires Ether (in <i>Wei</i>) currency for each transaction hindered more widespread adoption. After the big boost from last month's Switzerland's Crypto Valley Conference, Ethereum walked away handily with scores of investors and renewed momentum. The 23-year old hero of the platform almost appears precocious for the recent feature in Fortune Magazine's Top 40 Under 40.</p>\n  <p class=\"quote\">\n  [Buterin's] visionary project has rocketed to a market cap of nearly $30 billion—as high as the private valuations Airbnb and Snapchat achieved—from $1 billion a year ago, when Fortune first placed him on its 40 under 40 list.<sup>2</sup>\n  </p>\n  <p>To recap the enormous advantages of Ethereum functions as a <i> global operating system--The Ethereum Virtual Machine--</i>  the platform upon which shared, distributed applications can be designed and deployed. Unlike Bitcoin's function-less platform, contracts from banking to betting to real-estate can easily be drawn up in Solidity code, into the DAPP, <i>Distributed Application  deployed onto a Fintech network so expansive</i>, no wonder that even a crypto-currency needs a Swiss bank account!\n  </p>\n  ",
    "blogcite": "<p class=\"footnotes\">1. <a href=\"\nhttps://www.cnbc.com/2018/07/18/ethereum-is-a-leading-driver-in-blockchain-says-circle-ceo.html\n\"   target=\"_blank\">\nhttps://www.cnbc.com/2018/07/18/ethereum-is-a-leading-driver-in-blockchain-says-circle-ceo.html\n</a> \n</p>\n<p class=\"footnotes\">2. <a href=\"\nhttp://fortune.com/40-under-40/vitalik-buterin-10/\"   target=\"_blank\">http://fortune.com/40-under-40/vitalik-buterin-10/\n</a>\n</p>   \n "
  },
  {
    "id": "14",
    "did": "07-17-18",
    "date": "July 17, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Annual Prime Day , Part II:<br /> The Credit Card Hangover",
    "post": "\n <p class=\"firstparagraph\">Prime's Allure begins with the greatest deals, the most convenient deliveries, and a new Accessibility of Whole Foods Breads, Pastries, and HoneyCrisp Apples to every citizen!</p>\n <p>On a darker note, many articles and studies focus on the vendors' side of the Amazon effect, i.e. the push to remote shopping;<sup>1</sup> But the consumer side of the Amazon effect is more insidious: the sheer off-scale underpricing of goods, mock holidays, and shopping-memberships push new spending habits. <i>The more convenient shopping with 'one-click buy' becomes, the 'less convenient' becomes the explorative, exciting-/debate-filled shopping experiences that reward the Creative Entrepreneurs'</i> cultural interaction with consumers  \n\n",
    "blogcite": "\n<p class=\"footnotes\">1. <a href=\"\nhttps://www.statista.com/chart/10295/shopping-on-amazon/\n\"   target=\"_blank\">\nhttps://www.statista.com/chart/10295/shopping-on-amazon/\n</a>\n</p>   \n"
  },
  {
    "id": "13",
    "did": "07-16-18",
    "date": "July 16, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Prime Day's Annual All-You-Can-Eat Buffet, Part I<br />",
    "post": "\n  <p class=\"firstparagraph\"> Now that 49% of American e-commerce passes through Amazon's gates, it's official: <i>50% market share signifies a hostile take-over of Amerian Culture.</i> From the remaining half of the Online Shopping pie goes to  the next top nine, 22%: \n </p>\n <p class=\"quote\">\n  eBay (EBAY): 6.6%<br /><br />\n  Apple (AAPL): 3.9%<br /><br />\n  Walmart (WMT): 3.7%<br /><br />\n  Home Depot (HD): 1.5%<br /><br />\n  Best Buy (BBY) 1.3%<br /><br />\n  QVC Group (QVCA): 1.2%<br /><br />\n  Macy's (M): 1.2%<br /><br />\n  Costco (COST): 1.2%<br /><br />\n  Wayfair (W): 1.1%<br /><br />\n  <small style=\"align:right;\">Business Insider, July 2018 </small></p>\n  </p>\n  <p>These are more palatable organizations, without Amazon's cardboard-like culture.  There you still have the lofty, beautify Apple products, and who doesn't love the umbrella-cane only available on QVC limited quantities do apply!</p>\n  <p>\n  Of course, the remaining free birds, the 32% comprise the millions of home-office,brick-and-mortars, and online market entrepreneurs. (These do not include the independent vendor sales using Amazon's Marketplace). </p><p>So why does this 32-percentile slice of e-commerce represent the last stand of American Culture? The Creative Spirit may survive, even thrive; but it changes, and <i> creative verve takes on a reshaped form and a new pace, fitting to bureaucratic constraints and pricing schema. </p>   ",
    "blogcite": "\n  <p class=\"footnotes\">1. <a href=\"\n  http://www.businessinsider.com/amazon-is-closing-in-on-owning-half-of-the-e-commerce-market-2018-7?utm_source=feedburner&amp%3Butm_medium=referral&utm_medium=feed&utm_campaign=Feed%3A+businessinsider%2Ftravel+%28Business+Insider%29&r=US&IR=T&IR=T\n  \"   target=\"_blank\">\n  http://www.businessinsider.com/amazon-is-closing-in-on-owning-half-of-the-e-commerce-market-2018-7 \n  </a>\n  </p>     \n\n  "
  },
  {
    "id": "12",
    "did": "07-14-18",
    "date": "July 14-15, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "Musing Blockchain",
    "title": "Crypto Valley, Switzerland",
    "post": "\n  \n  <p class=\"firstparagraph\">Fintech's revered \"Crypto Valley Conference on Blockchain Technology\" in Zug, Switzerland, featured blockchain expertise from all corners, including Keynote Speakers, Stefan Thomas CTO of Ripple [cryptocurrency] and Professor Emin G&uuml;n Sirer of Cornell University, along with Economists and Swiss Government officials. World-class economists, investors, and Regulation authorities aside, the host-countries whole-hearted commitment to cryptocurrency is evident: </p>\n  <p class=\"quote\">“They want Switzerland to be the place to make it happen — but they don’t want to be seen\n  as the ‘wild west’. It is Swiss pragmatism,” says Martin Eckert, partner at MME, a Swiss law firm. <br /><br /> \n  Digital pioneers say Switzerland emerged as an ICO hub because it has a cluster of rich\n  investors and technology specialists. The small canton of Zug, near Zurich, has unofficially\n  Switzerland embraces cryptocurrency culture Seite 2 von 7\n  25.01.2018\n  become “Crypto Valley”.<sup>4</sup>\n  </p>\n  <img src=\"dist/img/swissBlockchain.png\" width=\"350\" class=\"zoom\" />\n  <p><small>Image Credit: Source Lykke, Coindesk</small></p>\n",
    "blogcite": "<p class=\"footnotes\">3. <a href=\"\n  https://www.cryptovalleyconference.com\n  \"   target=\"_blank\">\n  \n  https://www.cryptovalleyconference.com\n  </a>\n  </p>\n  <p class=\"footnotes\">4. <a href=\"\n  https://www.crypto-finance-conference.com/resources/public/lava3/media/switzerland-embraces-cryptocurrency-culture.pdf\n  \"   target=\"_blank\">\n  \n  https://www.crypto-finance-conference.com/resources/public/lava3/media/switzerland-embraces-cryptocurrency-culture.pdf\n  </a>\n  </p>\n"
  },
  {
    "id": "11",
    "did": "07-13-18",
    "date": "July 13, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Simple is better than Complex. Complex is Better than Complicated.<br /><small>--Tim Peters</small>",
    "post": "\n  <p class=\"firstparagraph\"><i>Zen of Python: \"Beautiful is better than ugly.<i> Explicit is better than implicit.</i>  Simple is better than complex.  Complex is better than complicated. Flat is better than nested.  Sparse is better than dense\"<br /></i> -- Pythoneer Tim Peters<p> In my April 19th post, I recount Python's near-mystical author and leader of language's development up to this month's retirement:  About Guido van Rossum, </p>\n  <p class=\"quote\">After almost 30 years of overseeing the development of the world's<i> most popular language, Python, its founder and Benevolent Dictator For Life\" (BDFL), Guido van Rossum,</i> has decided he would like to remove myself entirely from the decision process.<sup>2</sup> </p><p>\nPython is NASA's drug-of-choice because of the language's superior handling of precision mathematics, and yet the syntax and module libraries makes the language easy for anyone to pick up. Few could argue against Guido van Rossum's reductionist philosophy that inspires the clear, expansive structure. So, farewell to the great Guido van Rossum's official leadership and Thank You! \n</p>\n",
    "blogcite": " <p class=\"footnotes\"><a>1. Tim Peters <p class=\"footnotes\">2. <a href=\"https://www.zdnet.com/article/python-language-founder-steps-down/  \"   target=\"_blank\">\n  https://www.zdnet.com/article/python-language-founder-steps-down/ </a>\n  </p>\n\n"
  },
  {
    "id": "10",
    "did": "07-12-18",
    "date": "July 12, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now.",
    "title": "Tools of the A.I. Trade, Part III:<br />  Operation Architecture Drilldown",
    "post": "<p class=\"quote\">\n...The colossal shift in the chip world came with the advent of artificial intelligence (AI) and machine learning (ML). With these emerging technologies, a flood of new processors has arrived—and they are coming from unlikely sources. <br /><br />\nMicrosoft is preparing an AI chip for its HoloLens VR/AR headset, and there’s potential for use in other devices. \n<i> Google has a special AI chip for neural networks called the Tensor Processing Unit, or TPU, which is available for AI apps on the Google Cloud Platform. </i>Apple is working on an AI processor called the Neural Engine that will power Siri and FaceID.  <sup>1</sup></p>\n<p class=\"firstparagraph\">All ... All the A.I. Tools a busy bee could ask for!\n</p>\n ",
    "blogcite": "\n<p class=\"footnotes\">1. <a href=\"\nhttps://arstechnica.com/gadgets/2018/07/the-ai-revolution-has-spawned-a-new-chips-arms-race/\n\"   target=\"_blank\">\nhttps://arstechnica.com/gadgets/2018/07/the-ai-revolution-has-spawned-a-new-chips-arms-race/\n</a>\n</p>     \n"
  },
  {
    "id": "9",
    "did": "07-11-18",
    "date": "July 11, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Tools of the A.I. Trade, Part II:<br />Machine Learning's Pedal to the Metal",
    "post": " \n<p class=\"firstparagraph\">Moore's Law--a function of transistor count--has guided CPU bench-mark expectations along a fairly linear path year-by-year. However, computing requirements have multiplied while the mathematical relevence of the law wanes. <br /><br />\n<img src=\"dist/img/moores_law.png\" width=\"400px\" class=\"zoom\" title=\"Moore's Law Graphic\" /><br />Image Credit: ourworldindata.org <br /><br /> <i>Enter the Decision Tree, the Random Forest, Na&iuml;ve Bayes, and K-Nearest Neighbors</i>: The machine learning tools and theoretical building blocks to get more bang for the buck from all that computing power. How? <i> Teaching software to teach itself, which is the pathway out of computing-power deficits and the move from theoretical to practical</i> ...</p> \n<p class=\"quote\">\nEvery technology follows a similar path of diszcovery, engineering, and transformation. In the case of electricity, Faraday uncovered new principles, but no one really knew how to make them useful. They first had to be understood well enough that people such as Edison, Westinghouse, and Tesla could figure out how to make things that people would be willing to buy.\n \n<br /><br />  The digital revolution, for all of its charms, has had a fairly limited economic impact, compared with earlier technologies such as electricity and the internal combustion engine. Even now, information technologies make up only about 6% of GDP in advanced economies. Compare that to manufacturing, health care, and energy, which make up 17%, 10%, and 8% of global GDP, respectively, and you can see how there is vastly more potential to make an impact beyond the digital world.\n<sup>2</sup></p>\n<p>As the saying goes, <i>One crowded hour of glorious life is worth an age without a name.</i><sup>3</sup> And now the tide is high for Tech to venture out into the world and make a name for herself!\n",
    "blogcite": "<p class=\"footnotes\">2. <a href=\"https://ourworldindata.org/wp-content/uploads/2013/05/Transistor-Count-over-time.pngArticle\"   target=\"_blank\">https://ourworldindata.org/wp-content/uploads/2013/05/Transistor-Count-over-time.png</a>\n</p>\n<p class=\"footnotes\">2. <a href=\"https://hbr.org/2018/07/the-industrial-era-ended-and-so-will-the-digital-era\"   target=\"_blank\">https://hbr.org/2018/07/the-industrial-era-ended-and-so-will-the-digital-era</a>\n</p>\n\n<p class=\"footnotes\">3. Thomas Osbert Mordaunt"
  },
  {
    "id": "8",
    "did": "07-10-18",
    "date": "July 10, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now.",
    "title": "Tools of the A.I. Trade, Part I: <br />The Proliferation of Machine Learning Modeling Libraries ",
    "post": "<p class=\"firstparagraph\">Advances in computer science and data research follow the path of the tools that pave a developer's path: The tools make the worker, and therefore the work. For example, any of the Industrial Revolutions leaped forward with every new tool. <i>Now, Artificial Intelligence research and design  lurches forward by the tooling, but in a new fashion: Open source tools owned and operated by the community, the work by and for any community.</i>\n</p>\n<p> Neural network tools like TensorFlow.js, a \"JavaScript library for training and deploying Machine Learning models in the browser and on Node.js\" <sup>1</sup>  along with other programming-library frameworks, abstract away a layer of the visible mechanics. On the one hand, it is the democratization of cutting-edge technology, formerly siloed apart and under government, corporate or university controls. </p>\n<p>\nThe genie is definitely out of the bottle, yet he or she is now at the keyboards across the globe. This has a clear effect in bringing technological innovation to the community, to the coffeeshops and meet-up groups, instead of clearly defined, bureaucratically-directed research ends. </p>\n<p>Therefore,  bootstrapping open-source projects brings the community to the forefront of technological innovation! Though the common mobile app has grown familiar for changing landscapes, those apps chiefly leverage the social network (links) of friends and professionals; while the common-use spread of machine-learning research provides leverage to the actual work (nodes) of progress</p>\n<p>Therefore, the tools provide one dimension of A.I.'s path, while the democratized distribution of tools across social networks provides a second dimensional path. This alters the A.I. evolution in the long-term, by means of short-term and frequent tooling revolutions.   </p>\n",
    "blogcite": "\n<p class=\"footnotes\">1. <a href=\" https://js.tensorflow.org/\"   target=\"_blank\"> https://js.tensorflow.org/</a>\n</p>   \n"
  },
  {
    "id": "7",
    "did": "07-09-18",
    "date": "July 9, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "187 million Snapchat Users and Enquiring Minds want to Know: Did Multiple Clusters Fail at once?...or is there Foul Play?",
    "post": "\n<p class=\"firstparagraph\">Panic and anxiety cover the Snapchat countries across far-flung locales from Latvia to Denver to Spain--</i>and in one case blighting the entire island of the United Kingdom...</i></p>\n<p class=\"quote\">Some users went to Twitter and shared their frustration.\n\"I've been sending people abuse on snapchat for not replying to me only to discover its down. Oops?\" one user tweeted.<br /><br />\n\"Snapchat just went down. I can literally feel the panic of a thousand generations in my bones. #snapchat,\" another user posted.\nSnapchat currently has 166 million users globally. <sup>2</sup>\n</p>\n<p> A chronic technical problem before May 2018 when SnapCrash went public   dating to October. <sup>1</sup> -- scalability challenges strike again!</p> \n<img src=\"dist/img/snapchat.jpg\" width=\"350\" class=\"zoom\" /><br /><br />\n<p>But inquiring minds want to know, <i>What's the Story with Snapchat? </i>Not to mention the Conspiracy Theorists that blame Snapchat's devotion to Advertisers--too many distractions?</p>\n<p class=\"quote\">\n[Snapchat] tweeted: “Some Snapchatters are having trouble with the app. We’re aware of the issue and working on a fix! We recommend staying logged into your account.”\n<br /><br />\nSnapchat recently confirmed that it is testing six-second long ads in Shows on its Discover section that won’t budge no matter how many times a user tries to tap to skip them.<br /><br />\n\nThis development has been coming for some time as Snapchat looks to placate advertisers who have grown frustrated by users who, on average, only stay on an ad for two seconds before skipping.</p> \n<p>Every kind of Server malfunction pales in comparison to the Affordable Healthcare Act web-app's abysmal first few months.<i> Get Well Soon, Snapchat--you're breaking our heart!</i></p>",
    "blogcite": "\n<p class=\"footnotes\">1. <a href=\" https://www.independent.co.uk/life-style/gadgets-and-tech/snapchat-down-not-working-android-broken-message-snap-inc-help-a8443236.html\"   target=\"_blank\"> https://www.independent.co.uk/life-style/gadgets-and-tech/snapchat-down-not-working-android-broken-message-snap-inc-help-a8443236.html</a>\n</p>    \n\n<p class=\"footnotes\">2. <a href=\" http://www.tribuneindia.com/news/science-technology/snapchat-outage-hits-users-globally/480068.html\"   target=\"_blank\"> http://www.tribuneindia.com/news/science-technology/snapchat-outage-hits-users-globally/480068.html</a>\n</p>    \n<p class=\"footnotes\">3. <a href=\"https://outage.report/snapchat\" target=\"_blank\">https://outage.report/snapchat</a></p>\n "
  },
  {
    "id": "6",
    "did": "07-07-18",
    "date": "July 7-8, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Theories of Extropy <sup>0</sup>",
    "post": "\n <p class=\"quote\"><sup>0</sup><strong><small>\n The term “extropy,” coined in 1967, is generally used to describe life’s capacity to reverse the spread of entropy across space and time. </small></strong><sup>1</sup>\n </p>\n <p class=\"firstparagraph\">\n Philosophies of A.I. range from the Aloof to Alarmed, from Punch-drunk Optimism to Harrowing Paranoia: A few vantage points from a Legacy New Yorker:</p>\n <p class=\"quote\">\n Last summer, Oren Etzioni, the C.E.O. of the Allen Institute for Artificial Intelligence, in Seattle, referred to the fear of machine intelligence as a “Frankenstein complex.” Another leading researcher declared, “I don’t worry about that for the same reason I don’t worry about overpopulation on Mars.”<sup>1</sup></p>\n <p class=\"quote\">\n Jaron Lanier, a Microsoft researcher and tech commentator, told me that even framing the differing views as a debate was a mistake. “This is not an honest conversation,” he said. “People think it is about technology, but it is really about religion, people turning to metaphysics to cope with the human condition. They have a way of dramatizing their beliefs with an end-of-days scenario—and one does not want to criticize other people’s religions.”\n <sup>1</sup></p>\n <p class=\"quote\">\n Bostrom had little interest in conventional philosophy—not least because he expected that superintelligent minds, whether biologically enhanced or digital, would make it obsolete. “Suppose you had to build a new subway line, and it was this grand trans-generational enterprise that humanity was engaged in, and everybody had a little role,” he told me. “So you have a little shovel. But if you know that a giant bulldozer will arrive on the scene tomorrow, then does it really make sense to spend your time today digging the big hole with your shovel? Maybe there is something else you could do with your time. Maybe you could put up a signpost for the great shovel, so it will start digging in the right place.” He came to believe that a key role of the philosopher in modern society was to acquire the knowledge of a polymath, then use it to help guide humanity to its next phase of existence—a discipline that he called “the philosophy of technological prediction.” \n <sup>1</sup></p>\n <p>At the end of the day, we can ask \"are we there yet?\" over again, but a more pointed query asks not about time, but about place: \"It may be highly unpredictable where a traveller will be one hour after the start of her journey, yet predictable that after five hours she will be at her destination.”\n ",
    "blogcite": "\n \n<p class=\"footnotes\">1. <a href=\" https://www.newyorker.com/magazine/2015/11/23/doomsday-invention-artificial-intelligence-nick-bostrom\"   target=\"_blank\"> https://www.newyorker.com/magazine/2015/11/23/doomsday-invention-artificial-intelligence-nick-bostrom</a>\n</p>    \n<p class=\"footnotes\">1. <a href=\"https://nickbostrom.com/\"   target=\"_blank\"> https://nickbostrom.com/</a>\n</p>  \n\n "
  },
  {
    "id": "5",
    "did": "07-06-18",
    "date": "July 6, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now.",
    "title": "The Canadian Mafia, Part II.<br />Data Better Recollected",
    "post": "\n <p class=\"firstparagraph\">It turns out that data is unevenly distributed between sectors, leading to monopoles of dominance: After all, who controls the data, controls the commanding heights. And yet, the very substance of Big Data derives from and belongs precisely to  individuals, aggregated, that checked \"Agree\" to a given app's Privacy Policy, from a given Internet Service Provider, using a given Browser ....</p>\n <p>Now that physical products lose relative value for many reasons (not to mention easy downloads for 3-D printing), and alternately<i> informational data products gain value in the digital economy: hence the problem of allocating the value of personal data back to the person </i>... To this, the Canadian A.I. Mafia chimes in:</p>\n  <p class=\"quote\">A persistent challenge for Element is the dearth of good data. The simplest way to train A.I. models is to feed them lots of well-labeled examples—thousands of cat images, or translated texts. Big Tech has access to so much consumer-oriented data that it’s all but impossible for anyone else to compete at building large-scale consumer products. But businesses, governments, and other institutions own huge amounts of private information. Even if a corporation uses Google for email, or Amazon for cloud computing, it doesn’t typically let those vendors access its internal databases about equipment malfunctions, or sales trends, or processing times. <br />\n  <br />That’s where Element sees an opening. If it can access several companies’ databases of, say, product images, it can then—with customers’ permission—use all of that information to build a better product-recommendation engine. Big Tech companies are also selling A.I. products and services to businesses—IBM is squarely focused on it—but no one has cornered the market. Element’s bet is that if it can embed itself in these organizations, it can secure a corporate data advantage similar to the one Big Tech has in consumer products.<sup>1.</sup></p>\n  <p>\n   <p>So will this kind of data democratization work? Not only so, but the Cambridge Analytica fiasco only briefly awakened public attention to the deep science underlying each of our \"online digital signatures\" ... the race is on among the Tech Giants to use A.I. to understand our lives, our keystrokes, our buying preferences better than we understand. And in turn, provide a great utility, and win our financial allegiance!\n",
    "blogcite": "\n\n<p class=\"footnotes\">1. <a href=\"http://fortune.com/longform/element-ai-startup-tech/\"   target=\"_blank\">http://fortune.com/longform/element-ai-startup-tech/</a>\n</p>    \n\n"
  },
  {
    "id": "4",
    "did": "07-05-18",
    "date": "July 5, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now.",
    "title": "The Canadian Mafia, Part I.<br /> On the Good-Natured Vision of the Godfathers of A.I.",
    "post": " \n  <p class=\"quote\">In the Modern Field of Artiificial Intelligence, all roads seem to lead to three researchers with ties to Canadian universities. The first, Geoffrey Hinton, a 70-year-old Brit who teaches at the University of Toronto, pioneered the subfield called deep learning that has become synonymous with A.I. The second, a 57-year-old Frenchman named Yann LeCun, worked in Hinton’s lab in the 1980s and now teaches at New York University. The third, 54-year-old Yoshua Bengio, was born in Paris, raised in Montreal, and now teaches at the University of Montreal. The three men are close friends and collaborators, so much so that people in the A.I. community call them the Canadian Mafia.<sup>1.</sup></p>\n\n  <p class=\"firstparagraph\">A curious path of punctuated advancement due to insufficient memory and cpu power, characterized late 20th century A.I. development: Deep Learning development   lulls interrupted by rapid growth with each successive technological period.\n   Toronto's Dr. Geoff Hinton's single-layered A.I. algorithm gained brief fame, yet A.I. research no longer advanced  for ten years. </p>\n   <p class=\"quote\">\n   Programs that performed well in the laboratory were useless in everyday situations; a simple act like picking up a ball turned out to require an overwhelming number of computations.\n\nThe research fell into the first of several “A.I. winters.” As Bostrom notes in his book, “Among academics and their funders, ‘A.I.’ became an unwanted epithet.”<sup>1</sup> \n</p>\n<p>\nThen came the GPU with Alex Khreshinski's famous image-recognition competition-winning penmanship detector, which notably is still in use by the banking system. This novel use of the GPU to accomplish parallel calculations rewrote the the A.I. field overnight. Also known as the \"Cambrian Explosion\", this event (and really just the algorithm) set off widespread advancements in the weeks and months follwoing, leading to new speciation ranging from the ANN, Neural Network, to a whole alphabet soup from Convolutional Neural Networks (CNN) <i>to far-reaching mutations of Reinforcement Learning</i>.<sup>2</sup>\n  </p>\n \n  <p> Along with Hinton's close collaborator throughout the 1980's and 90's, Dr. Yoshua Bengio of the University of Montr&eacute;al, the researchers remain committed to humanity's service:</p>\n   \n  <p class=\"quote\">\n  Hinton moved from the U.S. to Canada in part due to disillusionment with Reagan-era politics and disapproval of military funding of artificial intelligence.[22] He believes political systems will use AI to \"terrorize people\". Hinton has petitioned against lethal autonomous weapons. Regarding existential risk from artificial intelligence, Hinton has stated that superintelligence seems more than 50 years away, but warns that \"there is not a good track record of less intelligent things controlling things of greater intelligence\". Asked in 2015 why he continues research despite his grave concerns, Hinton stated \"I could give you the usual arguments. But the truth is that the prospect of discovery is too sweet.\" Hinton has also stated that \"It is very hard to predict beyond five years\" what advances AI will bring.<sup>1</sup></p>\n  \n  <p>While Hinton and company aren't necessarily Mahatma Gandhi-like, their devotion to a science prioritized to humanity' service and long-term best interest--free from monetary or other influence is admirable. No wonder their outlook on A.I.'s utility is so much brighter than that of Pessimist Elon Musk and company ... baah-humbug!\n </p>\n   \n \n  ",
    "blogcite": "\n\n\n  <p class=\"footnotes\">1. <a href=\"http://fortune.com/longform/element-ai-startup-tech/\"   target=\"_blank\">http://fortune.com/longform/element-ai-startup-tech/</a>\n  </p>    \n  <p class=\"footnotes\">2. <a href=\"https://www.benzinga.com/pressreleases/18/06/p11846924/join-ai-pioneer-geoffrey-hinton-in-toronto-and-learn-from-global-leade\"   target=\"_blank\">https://www.benzinga.com/pressreleases/18/06/p11846924/join-ai-pioneer-geoffrey-hinton-in-toronto-and-learn-from-global-leade</a>\n  </p>     \n\n\n  "
  },
  {
    "id": "3",
    "did": "07-04-18",
    "date": "July 4, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now.",
    "title": "Training Data, Big and Beloved Data<br />Big Datas Most Notorious Rule-Breaker and Rule-Enforcer: A.I.",
    "post": " \n  <p class=\"firstparagraph\">Already A.I. has shown its true colors as an ideal tool for solving disproportionately large, complex data problems: Similar to Watson's medical recommendations based on millions of pages read, the off-the scale amount of pages from every tech company is the item of interest. This is the flurry-to-snowstorm of Privacy Policies simultaneously released in response to the E.U.'s May 25th General Data Protection Regulations.  In reference to my June 30th post on A.I. workplace solutions, months of busy-reading-work all distilled to a fraction of the time to analyze those policies. Guess what? The rule-breaking is well under way!</p>\n  <p class=\"quote\">Researchers from the European Union Institute in Florence worked with an EU consumer organization to create the software. They then used the program to examine the privacy policies of 14 major technology businesses, including by Alphabet Inc., Amazon.com Inc., and Facebook Inc.<br /><br />\n \n  They found that a third of those clauses were \"potentially problematic\" or contained \"insufficient information.\" Another 11 percent of the policy’s sentences used unclear language, the academics said.  The researchers didn’t make public which companies’ policies violated which provisions of the law, publishing only aggregate findings for all of the companies in the study.<sup>1</sup></p>\n \n  <p>Aha! <i>The practices of Tech companies' use of A.I. to analyze customers' private data is well-known, but <strong>what do we actually know</strong> beyond just that? Behind the veil of commercial secret, much less is known than is led on ... until now. Now, A.I. becomes increasingly useful as a tattle-tale! </i> So by the same token that tech creates problems, Tech is the first to provide a solution. But A.I. rule-checking sounds good but raises another question: Who owns, or can access by alternate means, the personal data we have strewn across the internet? And what quality of data does each party have, or shares?  </p>\n  ",
    "blogcite": "\n  \n<p class=\"footnotes\">1. <a href=\"https://www.bloomberg.com/news/articles/2018-07-04/new-ai-tips-off-regulators-to-possible-eu-data-privacy-faults\"   target=\"_blank\">https://www.bloomberg.com/news/articles/2018-07-04/new-ai-tips-off-regulators-to-possible-eu-data-privacy-faults</a>\n</p>    \n  "
  },
  {
    "id": "2",
    "did": "07-03-18",
    "date": "July 3, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Musing Blockchain",
    "title": "What's Behind the Rebirth of the Nation-State?<br />There's a <i>Blockchain DAPP</i> for that!",
    "post": "\n<p class=\"quote\"><i>Power is “various forms of domination and subordination and the asymmetrical balance of forces which operate whenever and wherever social relations exist.”  </i><sup>1</sup><br /><br />--Michel Foucault</p>\n<p class=\"firstparagraph\">Ties and balances of power, at their fundamental core are constantly changing variations of symmetry between two agents, whether unilateral or bilateral: Two nodes interlinked. Magnified by overlapping networks and layers of relations, it's easy to see why long-standing institutions are interlocked, for better or worse ... Clearly the trend of turbulence and power grabs reaches far and wide:\n </p>\n<p class=\"quote\">Poland was once a beacon for countries struggling to escape the yoke of the Soviet Union and embrace Western democracy. But it is now in league with neighboring nations, like Hungary, whose leaders have turned to authoritarian means to tighten their grip on power, presenting a grave challenge to a European Union already grappling with nationalist, populist and anti-immigrant movements.<br /><br />\n\nThe forced retirements of up to 27 of 72 Supreme Court justices, including the top judge, and the creation of a judicial disciplinary chamber were the latest in a series of steps by Poland’s right-wing Law and Justice Party to take over the justice system.\n</p>\n<p>As it always is in film, it is so now that dire situations have to call upon the true Super Man, Technology, to save the day: And what form this time? Blockchain technology, which presents a cryptographic solution to the problem of trust:<i> If two agents can agree on a third cryptographic intermediary, then a bridge of trust is built--the kind that in the past only institutions could broker!</i>. </p>\n<p>And so, two humans devise a new means to exchange without disruption--an indestructable scaffolding firmly set in the foreground from today's creaking and swaying institutions. Sounds good, but where's the music? There seems to be a subtle interlude between the honeymoon stage of investing and inventing new currencies, and little in the way of micro-transactions and <i> the actual <strong>using</strong> it</i>. It takes a little trust to make trust, so the effort is on to make a bridge from the <i>early adopters</i> stage to <i>mainstream adoption</i>...<sup>3</sup>  \n</p>\n",
    "blogcite": "\n<p class=\"footnotes\">2. <a href=\"https://books.google.com/books?id=6rfP0H5TSmYC&printsec=frontcover\"   target=\"_blank\">Foucault, Michel. Discipline and punish: The birth of the prison. Vintage, 2012.</a>\n</p>   \n<p class=\"footnotes\">2. <a href=\"https://www.nytimes.com/2018/07/03/world/europe/poland-supreme-court-protest.html\"   target=\"_blank\">https://www.nytimes.com/2018/07/03/world/europe/poland-supreme-court-protest.html</a>\n</p>   \n<p class=\"footnotes\">3. <a href=\"https://www.nytimes.com/2018/07/01/technology/cryptocurrency-ripple.html?rref=collection%2Fsectioncollection%2Ftechnology&action=click&contentCollection=technology&region=stream&module=stream_unit&version=latest&contentPlacement=9&pgtype=sectionfront\"_blank\">https://www.nytimes.com/2018/07/01/technology/cryptocurrency-ripple.html</a>\n</p> \n\n"
  },
  {
    "id": "1",
    "did": "07-02-18",
    "date": "July 2, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Celestial Bodies: Always Out to Impress!",
    "post": "<p class=\"quote\">A vast majority of the half-million bodies in the inner asteroid belt may in fact be shrapnel from as few as five parent bodies called \"planetesimals,\" scientists say. But the tangled orbits of those lost worlds meant they were doomed to collide, producing fragments that also collided, producing still more fragments in a cataclysmic cascade that's been going on for more than 4 billion years.<sup>1</sup></p><p> \n</p>\n",
    "blogcite": "<p class=\"footnotes\">1. <a href=\"https://www.washingtonpost.com/news/speaking-of-science/wp/2018/07/03/many-asteroids-might-be-remnants-of-five-destroyed-worlds-scientists-say/?noredirect=on&utm_term=.4f1e000cc632\"   target=\"_blank\">https://www.washingtonpost.com/news/speaking-of-science/wp/2018/07/03/many-asteroids-might-be-remnants-of-five-destroyed-worlds-scientists-say/?noredirect=on&utm_term=.4f1e000cc632</a>\n</p> \n"
  }
]