[
  {
    "id": "21",
    "did": "18-03-24",
    "date": "March 24-25, 2018<br /> Weekend ",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "1968 Meets 2018: Scalability Issues in the Mean Time",
    "post": "<p class=\"firstparagraph\">Washington D.C.  \n  Not Normally does WonderWoman Show her Face, but the student protest takes the day on gun control. Emma Gonzalez--one of the Parkland School Shooting survivors, addressed, and marched with, hundreds of thousands of middle- and high-schoolers, took to the streets of D.C. to protest lax gun-control, e.g. AK-47's readily available at a moment's notice ... for home protection? I wouldn't want to be a neighbor for fear of collateral damage! So technology keeps one-upping the ol' six-shooter to something easily labeled as <i> a Weapon of Mass Destruction</i> ... so is it still a gun?\n  </p>\n  <p >Last week and this week, the out-of-control handgun problem is in the news. This leads one to believe there is the root problem with the <i>definition</i> of a gun. As always. Definitions start wars and world wars--after all of last century, did anyone decide who controls the Coal of Sudetenland?  You can bet everyone there speaks two languages, still. The <i>definitional </i> answer makes the answer: But this is a problem in the tech age because definitions change, <i>scale of effect changes</i>, and this makes the definition impossible to pin down. The definition is as relative as the technological change makes it.  \n  \n  </p>\n  <p class=\"cite\"><a href=\"http://www.latimes.com/local/california/la-me-saturday-walkouts-liveupdates-emma-gonzalez-leads-remarkable-moment-of-1521916931-htmlstory.html\">http://www.latimes.com/local/california/la-me-saturday-walkouts-liveupdates-emma-gonzalez-leads-remarkable-moment-of-1521916931-htmlstory.html</a> </p>"
  },
  {
    "id": "20",
    "did": "18-03-23",
    "date": "March 23, 2018 <br /> Weekend",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "<i>Its not about the Blockchain, the Efficient Network Data Distribution is the Answer!</i>",
    "post": "<p class=\"firstparagraph\">Last week and this week, the out-of-control handgun problem is in the news. This leads one to believe there is a problem with the <i>definition</i> of a gun. As always. Definitions start wars and world wars--after all of last century, did anyone decide who controls the Coal of Sudetenland?? You can bet everyone there speaks two languages, still. The <i>definitional </i> answer makes the answer: This is why Blockchain technology--straddled between myriad start-ups, countless institutions and a hundred brilliant minds is The answer to our scalability problems.   \n\n  </p><p>The problem is that data structures grow at differential rates, some exponential, some linear, some slower, some as a function of time or other variable.  Yet, our data analysis needs are clear: We need a new technology to handle quickly, securely and efficiently the <i>Networked, Relational Data Problem</i>, which scales exponentially with traditional data structures, like old-fashioned Excel-like Row-&amp;-Column data structures. Yet, as one would logarithmize the equation to best adapt new data, so must the computer data structure adjust accordingly. </p>\n  <p>Too rigid, the world turned to relational, non-Structured Query Language (SQL) data, partially for the need to dislate <i>data objects</i> from their tables. The world needed that cell as a free-radical in order to mimic the data structure of societally-networked society.  Alas, a science already at hard work with Cambridge Analytica--again what's that field of study called again, Sociology, right? </p>\n  <p>\n  \n  </p>"
  },
  {
    "id": "19",
    "did": "18-03-22",
    "date": "March 22, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "A.I. Part II: Problems with Scale, Kindly Resolved by A.I.",
    "post": "<p class=\"firstparagraph\">I mistakenly laid waste to A.I.'s reputation in my last post. It <i>did</i> let us, our whole society, let us down, and maybe the forensics will give us <i>a few excuses</i> down on the road. However, \"homicide by A.I. (aka Uber)\" will need to be updated in records. But, artificial intelligence is not at fault. There are a few software engineers that did the best they could--with the time their superiors gave them.  Uber leadership, let's hope, will be deterred from future carelessnes to come.   </p>\n\n  <p>That diatribe said, I do appreciate an Uber's proximity when I'm stranded at 2:00 am in a bad part of town. Why? Because I don't need to plan ahead -- Uber is there! And, sadly, I don't need to read or study -- Google is there! But wait, don't judge me, I'm not lazy! That being said, I have my own soul-searching to do: TECHNOLOGY AIDS AND ABETS ME AND MY ACTIONS, but it does not run my show> Only I take responsibility for my own actions: I allow technology into my life as a tool, and yet I   hold the power cord. I take responsibility for the tech that follows me--and believe me, I need that tech. And so do you. Not only so, but the world, and the ecological fate of our <i style=\"color:green\">green earth</i>> also depends on tech, A.I. specifically. </p>\n  <p>\n  Humankind has already dug an ecological (dare I say 'alkaline') pit deeper than can be dug out of: Flooding, forest fires, and Species Extinctions. A.I. is <i style=\"color:brown\"> is </i>> the only viable hope so we, i.e. Uber, shouldn't prematurely spoil its development. \n  </p>\n  <p class=\"quote\">Several questions raise their ugly head when A.I. can't help Earth or humankind. Like it or not, A.I. will need to 3-D print the dykes for the sunken coastal cities--like tiny island Den Haague, the most beautiful city in the world. Next, A.I. will make irrelevant fossil fuels by 2030, if not before; and those caught polluting would be fined to death, anyway. Without A.I., none of these worthwhile goals are possible. This precarious, difficult and most of all laborious job of designing our own solutions will take time: For this reason, Uber should be shamed even further for their short-cuts, and eventual errors of internal, organizational problems. <i>Uber's experiemental, tax-free \"Testing Sandbox\" cannot be the erstwhile safe neighborhoods of Surburban Phoenix, without proper caution.</i> </p>\t\t\n  <p>Are Uber's corporate desires, market stronghold, and shareholders' delight more worthwhile than <i>an entire sensitive field of machine-learning research?</i> No. Uber must be warned to not steal corporate secrets from Waymo, then proceed to be 86'd from California, then brush aside with excuses the <i>killing of an innocent Arizona bicyclist</i>.</p>\n  <p>\n  Who can count the number of very feisty taxi-men and -women that are not fans of the infamously hasty culture of Uber. The team of lawyers needed to be 86'd from France? Uber already knows, because maybe they know B.D.O! \n  </p>\n  <p></p>\n  <p class=\"cite\">3.\n  <a href=\"https://www.theguardian.com/technology/2017/apr/07/uber-waymo-lawsuit-lidar\" target=\"_blank\">https://www.theguardian.com/technology/2017/apr/07/uber-waymo-lawsuit-lidar</a>\n  </p>"
  },
  {
    "id": "18",
    "did": "18-03-21",
    "date": "March 21, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Hey Uber Driver, Please Slow Down!",
    "post": "\n  <p class=\"firstparagraph\">A.I. generally, and specifically Uber's Self-Driving Tech, both have failed society this week. Although we could all debate the merits of \"Lidar\", i.e. laser-based vision, the primary concern, in my view, is Uber's obvious carelessness in rushing their self-driving tech.  Although six thousand (6,000 too many) pedestrians are killed in the U.S. annually, I'd only hope AI wouldn't add to the problem.<sup>2</sup> The Arizona victim was walking her bicycle when struck, and I as bike-commuter can't help but take the affair personally. </p>\n  <p>This first human death is at least a <strong>big Wake-Up moment</strong> for the industry in its haste to roll out A.I. tech.  After all, Uber's questionable leadership morals<sup>2</sup> and being kicked out of San Francisco for running more than six red-lights raises eyebrows to begin with.<sup>3</sup> My problem with Uber is that the car's algorithm, with perfect Lidar vision, did not flinch or slow down for two seconds as it killed the victim. Humans flinch and humans swerve, because protecting fellow humans is in our DNA, not in A.I.'s. So, while we now know Uber's software hasn't caught up with its A.I.-Lidar hardware--let's hope we see defensive driving and some <i>TLC</i> programmed into those A.I. Algorithms!\n  </p>\n  <p class=\"cite\">1.\n  <a href=\"https://www.theguardian.com/technology/2018/mar/22/video-released-of-uber-self-driving-crash-that-killed-woman-in-arizona\" target=\"_blank\">https://www.theguardian.com/technology/2018/mar/22/video-released-of-uber-self-driving-crash-that-killed-woman-in-arizona</a>\n  </p>\n  \n  <p class=\"cite\">2.\n  <a href=\"https://www.theguardian.com/technology/2017/apr/07/uber-waymo-lawsuit-lidar\" target=\"_blank\">https://www.theguardian.com/technology/2017/apr/07/uber-waymo-lawsuit-lidar</a>\n  </p>\n  <p class=\"cite\">3.\n  <a href=\"http://fortune.com/2017/02/26/uber-self-driving-car-red-lights/\" target=\"_blank\">http://fortune.com/2017/02/26/uber-self-driving-car-red-lights/</a>\n  </p>\n  "
  },
  {
    "id": "17",
    "did": "18-03-20",
    "date": "March 20, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "The Facebook Fiasco: Why Zuckerberg Should not have Dropped out of Harvard",
    "post": "<p class=\"firstparagraph\">\n  Universities, private or public institutions, serve as a beacon for\n  <strong>the Fearless Protection and Ethical Regulation</strong> of information and data. This is because data and data research\n  is innate to the university's Mission Statement, whereas business and governmental institutions are relatively new\n  to the game, and often at odds with the\n  <i>Academy</i>, and occasionally against each other. </p>\n  <p class=\"quote\">Threats to student data privacy existed long before the internet. The FBI under J. Edgar Hoover infiltrated Berkeley\n  student groups to counter communism in the 1960s. Around the same time, the CIA manipulated the National Student\n  Association for intelligence gathering in other anti-communism efforts. But the privacy issue is more acute now\n  that the amount of student data in cloud-based systems has grown exponentially and is more widely dispersed.\n  <sup>2</sup>\n  </p>\n  <p> The University's expertise over ethically regulated data collection and management, is better than government, business,\n  and even medical domains for two reasons. First, the institution's long history and ethical motives with data are\n  unique. The norms of data-handling have been codified through the University's Institutional Review Board based\n  on its\n  <strong>stated mission</strong>. In other words, Universities take data seriously\n  <i>for reasons other than corporate profit or governmental control</i>. An example of personal data precautions has\n  played out with Harvard's recent data tiffs leading to the Supreme Court, illustrated by a 2016 article: </p>\n  <p class=\"quote\">Last week undergraduates at Harvard University raised concerns about the institution handing over their data to an\n  anti-affirmative action group as part of a lawsuit. Students for Fair Admissions, which is suing the university\n  for allegedly discriminating against Asian American applicants, will have access to “academic, extracurricular,\n  demographic and other information” from all undergrads who applied to Harvard between the fall 2009 and spring 2015,\n  omitting names and Social Security numbers.\n  <sup>2</sup>\n  </p>\n  <p>The second reason why Universities understand ethical implications for data is that data and more broadly data and\n  human information\n  <i>research</i> is the institutions' second highest priority, along with teaching and service. For example, in response\n  to the unethical Public Health research in\n  <i>Tuskegee Syphilis experiements</i>, the University instution\n  <i>stepped in</i> to help design the 1978\n  <strong>Belmont Principles</strong>. Currently, the University Institutional Review Board incorporates this with the Nuremburg\n  Code (developed after WWII NAZI research), in handling data research.\n  </p>\n  <p>In recent days,\n  <i>private companies</i> claim expertise for regulating \"Fake News\", and you guessed it,\n  <strong>regulation of data privacy &amp; confidentiality.</strong><sup>3</sup> The ethical authority over data privacy norms are nowhere\n  else than the University campus, case in point Harvard... Let the governments govern and the enterprises enterprise,\n  and leave the\n  <i>thoughtful, ethical regulation of data collection and precaution </i> to the Ivory Tower. Corporate and Government\n  self-regulation is opaque enough!</p>\n  \n  \n  <p class=\"cite\">1.\n  <a href=\"https://www.theguardian.com/technology/2018/mar/21/mark-zuckerberg-response-facebook-cambridge-analytica\"\n  target=\"_blank\">https://www.theguardian.com/technology/2018/mar/21/mark-zuckerberg-response-facebook-cambridge-analytica</a>\n  </p>\n  <p class=\"cite\">2.\n  <a href=\"https://www.edsurge.com/news/2016-10-26-pursuing-academic-freedom-and-data-privacy-is-a-balancing-act\"\n  target=\"_blank\">https://www.edsurge.com/news/2016-10-26-pursuing-academic-freedom-and-data-privacy-is-a-balancing-act</a>\n  </p>\n  <p class=\"cite\">3.\n  <a href=\"https://www.bloomberg.com/news/articles/2018-03-21/paul-ford-facebook-is-why-we-need-a-digital-protection-agency\"\n  target=\"_blank\">https://www.bloomberg.com/news/articles/2018-03-21/paul-ford-facebook-is-why-we-need-a-digital-protection-agency</a>\n  </p>\n  "
  },
  {
    "id": "16",
    "did": "18-03-19",
    "date": "March 19, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "A New Politics of Power:<br /> The Cryptographic Financial Escape Hatch",
    "post": "\n  <p class=\"firstparagraph\">Today, US inserted itself into a large, deep debate about crypto-legitimacy by imposing new sanctions on Venezuela.\n  In case you hadn't heard, here's a quick recap:</p>\n  <p class=\"quote\">The administration’s announcement came a few hours after Mr. Trump signed an executive order barring the use of any\n  digital currency issued by the Maduro government since Jan. 9. Mr. Maduro announced last month that his country\n  had begun a presale of the Petro, backed by the nation’s vast petroleum reserves.\n  <br />\n  <br />The Venezuelan government called the launch a response to a financial crisis that has prompted a profound devaluation\n  of the national currency, the bolívar, and quadruple-digit inflation.\n  <sup>1</sup>\n  </p>\n  <p>\n  This turn of events, both Maduro et al.'s financial cleverness and Trump's action to de-legitimate the Petro crypto-currency,\n  are examples of the undefined, near-limitless political uses for Blockchain Tech, both offensively and defensively.\n  In fact, the ensuing events may be of great interest as we will witness a major first actual use-case of the decentralizing\n  aims of crypto-technology tool. A tool that softens the financial leverage wielded by centralized authorities, whether\n  governemntal or private.\n  </p>\n  <p>I used the term \"de-legitimate\" above because there are two processes at work: First, crypto-currencies are\n  <i>in themselves</i> not legitimate. A\n  <strong>crypto-currency platform gains legitimacy through a series of both technical and financial trust-building stages</strong>.\n  So legitimacy is earned first privately, and some currency platforms continue publicly to Initial Coin Offering,\n  and so on--purely financial and technical legitimacy.\n  </p>\n  <p>And then, there is the another kind of legitimacy, which involves political leverage ... </p>\n  <p class=\"cite\">1.\n  <a href=\"https://www.nytimes.com/2018/03/19/world/americas/trump-venezuela-sanctions-petro.html\" target=\"_blank\">https://www.nytimes.com/2018/03/19/world/americas/trump-venezuela-sanctions-petro.html</a>\n  </p>\n  "
  },
  {
    "id": "15",
    "did": "18-03-17",
    "date": "March 17-18 2018 <br /> Weekend",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Energy Alternatives Signal the Power Shift to Come, Part II: A Ripple and an Iota of Sustainable Crypto-Currency",
    "post": "\n  <p class=\"firstparagraph\">Iota and Ripple cryptocurrencies use different technology than traditional blockchain in order to achieve their distributed\n  ledgers. Traditionally, outside \"miners\" validate the block's\n  <i> transaction records</i> as it replicates to the next \"block.\" For example, a transaction is validated 2 or three\n  times, and since three miners' validations all agree, one is kept and two are destroyed, in a nutshell; one example\n  of computations (\n  <strong>and hence coal</strong>) that cost too much time and energy.</p>\n  <p>Unlike this arrangement, Iota, Ripple, and Hedera use a directed-acyclic-graph (DAG) data structure (shaped like\n  a sideways genealogy tree) that relies on \"consensus\" from its nearest neighbor transaction nodes.\n  <sup>1</sup>\n  </p>\n  <p>Enough with the jargon! The bottom line is that Bitcoin's tech is not eco-sustainable,\n  <sup>2</sup> and so alternatives are already closing in on Bitcoin. Iota, the 8th largest cryptocurrency Iota delivers\n  open-source transparency, lightning speed, and yet is it cryptographically sound? Not according to some tech pundits:\n  </p>\n  <p class=\"quote\">You might think that IOTA, a cryptocurrency worth over a billion dollars, and working with organizations like Microsoft,\n  University College London, Innogy, and Bosch, BNY Mellon, Cisco, and Foxconn (through the Trusted IOT Alliance)\n  would not have fairly obvious vulnerabilities, but unfortunately, that’s not the case. When we took a look at their\n  system, we found a serious vulnerability and textbook insecure code.\n  <br />\n  <br /> “In 2017, leaving your crypto algorithm vulnerable to differential cryptanalysis is a rookie mistake. It says that\n  no one of any calibre analyzed their system, and that the odds that their fix makes the system secure is low,” states\n  Bruce Schneier, renowned security technologist, about IOTA when we shared our attack.\n  <sup>3</sup>\n  </p>\n  <p>And so, with a 1.9 billion market cap, I sometimes have to reflect on the immensity and non-relational fact and figures\n  of our technological world! Security and other bugs are hard to avoid when an industry is moving too fast for thoroughly\n  tested betas; and each iteration involves a series of bug-patches, with short- and long-term priorities stretched\n  with new design &amp; function trade-offs.</p>\n  <p>\n  Full life-cycle software development, from napkin-idea to rolling specs, always follows these patterns yet not always with\n  so much money on the line! Here's a closer look at one critique of Iota:</p>\n  <p class=\"quote\">\n  IOTA developers had written their own hash function, it was a huge red flag ... I think it’s important to reiterate that\n  the IOTA developers do not agree with our characterization of this as an issue of concern. Our report lays out more\n  details about why we are concerned.\n  <br />\n  <br /> There are other red flags — unlike every other program running on your laptop or phone, IOTA uses ternary instead\n  of binary. Since all computer hardware today uses binary, IOTA converts to ternary in software, which is less efficient\n  and more complex. This complexity prevents IOTA from benefiting from existing security analysis tools that are designed\n  to work with binary, and makes the code harder to read and understand.\n  <br />\n  <br /> The current IOTA tangle requires a trusted party (the coordinator) for security, suggesting that in its current\n  form it’s not ready to run as a truly permissionless, decentralized system.\n  <sup>3</sup>\n  </p><p>\n  Optimizing, not sacrificing, should be the name of the game as Tech closes in on Blockchain challenges of security, scalability,\n  and that evers-so-costly\n  <strong>Sustainability!</strong>\n  </p>\n  <p>1.\n  <a href=\"https://www.bloomberg.com/news/articles/2018-02-14/next-generation-crypto-ledgers-take-the-block-out-of-blockchain\"\n  target=\"_blank\">https://www.bloomberg.com/news/articles/2018-02-14/next-generation-crypto-ledgers-take-the-block-out-of-blockchain</a>\n  </p>\n  <p>2.\n  <a href=\"\n  https://digiconomist.net/bitcoin-electricity-consumption-surpasses-singapore-portugal\n  \" target=\"_blank\"> https://digiconomist.net/bitcoin-electricity-consumption-surpasses-singapore-portugal </a>\n  </p>\n  <p>3.\n  <a href=\"\n  https://medium.com/@neha/cryptographic-vulnerabilities-in-iota-9a6a9ddc4367\n  \" target=\"_blank\"> https://medium.com/@neha/cryptographic-vulnerabilities-in-iota-9a6a9ddc4367</a>\n  </p>\n  "
  },
  {
    "id": "14",
    "did": "18-03-16",
    "date": "March 16, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Energy Alternatives Signal the Power Shift to Come",
    "post": "\n  <p class=\"firstparagraph\">Sustainability for the environment means an accelerated transition to renewables. While other nations have undertaken\n  big steps toward wind and solar - even China's pollution declined in 2014 for the first time\n  <sup>1</sup>. EU is now 30% renewable--from 12% in 2000 to expected 50% renewable energy by 2030\n  <sup>2</sup>. Us, it appears, not so much...ouch.</p>\n  <p>What can we do then, in our lives, to make our own contribution. Well, besides less fossil fuels and red meat, we\n  can choose our cryptocurrencies more conscientiously. One NY town's recent actions echo my own concerns about the\n  enormous carbon footprint of \"Proof-of-Work\" blockchain mining.\n  </p>\n  <p class=\"quote\">\n  The city of Plattsburgh has put a moratorium on cryptocurrency mining to preserve natural resources, the health of its residents\n  and the city’s “character and direction,” officials said after a public hearing Thursday. For 18 months, the 20,000-resident\n  city will not consider new applications for commercial cryptocurrency mining. Violators will face fines of up to\n  $1,000 for each day they defy the moratorium.\n  <sup>3</sup>\n  </p>\n  <p>So, me too - count me out, I can't help but do the same, and pronounce my own refrain from Bitcoin (this is more\n  spiritual since I don't own, nor mine). In contrast, I'll put Ethereum on hold since they are transitioning to a\n  zero carbon-footprint by year's end. </p>\n  <p>And, for the most environmentally friendly cryptocurrencies, I wholly support Ripple (3rd highest valued cryptocurrency)\n  and also clean\n  <i>Iota</i> (8th highest valued )\n  <sup>5</sup>. Ripple, unfortunately, is a private company with a less-accessible internal distributed ledger. And yet,\n  Hedera Hashgraph heralds the most optimistic news of all: A blindlingly fast Hashgraph structure, unbound from any\n  carbon footprint.\n  </p>\n  <p>1.\n  <a href=\"http://www.wri.org/blog/2017/01/china%E2%80%99s-decline-coal-consumption-drives-global-slowdown-emissions\"\n  target=\"_blank\">http://www.wri.org/blog/2017/01/china%E2%80%99s-decline-coal-consumption-drives-global-slowdown-emissions</a>\n  </p>\n  <p>2.\n  <a href=\"https://qz.com/1193603/two-countries-are-the-reason-the-eu-is-hitting-its-ambitious-renewable-energy-targets/\"\n  target=\"_blank\">https://qz.com/1193603/two-countries-are-the-reason-the-eu-is-hitting-its-ambitious-renewable-energy-targets/</a>\n  </p>\n  <p>3.\n  <a href=\"https://www.washingtonpost.com/business/economy/upstate-new-york-town-bans-bitcoin-mining/2018/03/16/bd6f669e-2947-11e8-bc72-077aa4dab9ef_story.html?utm_term=.6282ea8429d5\"\n  target=\"_blank\">https://www.washingtonpost.com/business/economy/upstate-new-york-town-bans-bitcoin-mining</a>\n  </p>\n  <p>4.\n  <a href=\"https://www.bloomberg.com/news/articles/2018-02-14/next-generation-crypto-ledgers-take-the-block-out-of-blockchain\"\n  target=\"_blank\">https://www.bloomberg.com/news/articles/2018-02-14/next-generation-crypto-ledgers-take-the-block-out-of-blockchain</a>\n  </p>\n  "
  },
  {
    "id": "13",
    "did": "18-03-15",
    "date": "March 15, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "I Love this Record Baby but I Cant See Straight Anymore:<br />Its Gonna be Okay, Flip that Record and Just Dance!",
    "post": "<p class=\"firstparagraph\">\n  <strong>Creators in the Digital Age</strong>, especially Musicians, have faced just a panoply of business model challenges,\n  notably since the 2000s'\n  <i>Napster Era</i>. And yet, this is the age-old-case of new technologies reshaping long-standing fields, especially\n  financial structure - the bottom line! All creative fields also have technological features on the horizon that\n  may, potentially move the playing field. First some recent background: </p>\n  <p class=\"quote\">\n  While [Taylor Swift] is certainly making money in retail sales and digital downloads, both of those metrics are spiraling\n  downward as people migrate away from the concept of owning music at all. Nielsen recently released numbers indicating\n  substantial drops in both CD and digital-track sales, which are down almost $100 million\n  <i>year over year</i> from 2014; streaming music continues to grow, but the revenue it generates isn’t close to making\n  up the difference, yet.\n  <sup>1</sup>\n  </p>\n  <p>Most remember Taylor Swift's 2014 industry-shaking album withdraw in protest to Spotify's payment structure. The\n  next year Taylor took on Apple iTunes--to which Apple bended to Taylor's Way\n  <sup>2</sup>. These wins are amazing but not enough, if only for winning battles in a losing war. </p>\n  <p class=\"quote\">Spotify is the future. Spotify is the enemy. Spotify doesn’t pay enough. Spotify is music’s best bet for revenue\n  growth. Since it arrived in the United States from Sweden in 2011, Spotify has been cast as both hero and villain\n  in the music industry’s continuing debate over streaming music. </p>\n  <p class=\"quote\">\n  It has been hailed as a potential savior through a two-tiered “freemium” model that would gradually lure listeners away from\n  piracy. Yet Spotify’s royalty rates have also terrified many artists already worried that each new step in music’s\n  digital evolution further devalues their work.\n  <sup>3</sup>\n  </p>\n  <p>So the trend looks dire, and yet is it really? Where, just where are the\n  <strong>Tech Platforms </strong> leading us? Tech is leading us\n  <i>nowhere</i>, at least not to one\n  <strong>singular, centralized place</strong>; rather, decentralized tech--including but not limited to blockchain--is busy\n  rewriting the boundaries between creators and consumers. This Tuesday's Forbes article reported on new subscription-based\n  model by Patreon. Still classical Web 2.0, it's novelty appears so simple, almost intuitive in potentially new pathway:</p>\n  <p class=\"quote\">\"On Kickstarter and Indiegogo, creators essentially have to start over every time,\" says Danny Rimer, a partner at\n  Index Ventures who is a Patreon investor and board member. \"It's the same reason software companies went from licensed\n  software to subscriptions: predictable revenue and better service for customers.\"\n  <sup>4</sup>\n  </p>\n  <p>\n  Apparently Patreon, along with last November's\n  <i>Drip</i> by KickStarter have made headway. Patreon paid out $150 million to its artists in 2017, and each are doubling\n  annually. Decentralizing again. Well, we say we can't\n  <i>go back to the way it was</i>, but Tech always seems to lead us back to the way it was!\n  </p>\n  <p>1.\n  <a href=\"https://www.nytimes.com/2016/01/25/magazine/touring-cant-save-musicians-in-the-age-of-spotify.html\" target=\"_blank\">https://www.nytimes.com/2016/01/25/magazine/touring-cant-save-musicians-in-the-age-of-spotify.html\n  </a>\n  </p>\n  <p>2.\n  <a href=\"http://www.businessinsider.com/taylor-swift-new-album-reputation-not-on-spotify-apple-music-streaming-2017-11\"\n  target=\"_blank\">http://www.businessinsider.com/taylor-swift-new-album-reputation-not-on-spotify-apple-music-streaming-2017-11\n  </a>\n  </p>\n  <p>3.\n  <a href=\"https://www.nytimes.com/2014/11/12/business/media/taylor-swifts-stand-on-royalties-draws-a-rebuttal-from-spotify.html\"\n  target=\"_blank\">https://www.nytimes.com/2014/11/12/business/media/taylor-swifts-stand-on-royalties-draws-a-rebuttal-from-spotify.html\n  </a>\n  </p>\n  \n  \n  <p>4.\n  <a href=\"https://www.forbes.com/sites/kathleenchaykowski/2018/02/13/digital-medici-how-this-musician-turned-entrepreneur-plans-to-save-creators-from-advertising/#6063ea771313\"\n  target=\"_blank\">https://www.forbes.com/sites/kathleenchaykowski/2018/02/13/digital-medici-how-this-musician-turned-entrepreneur-plans-to-save-creators-from-advertising\n  </a>\n  </p>\n  "
  },
  {
    "id": "12",
    "did": "18-03-14",
    "date": "March 14, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "<i>Tou <strong>Demou</strong> tes<strong> Krates</strong></i>:<br />Strength of the People",
    "post": "\n  <p class=\"firstparagraph\">Today's demonstrations and walk-outs, led by America's Youth and followed by many of the education staff, has aimed\n  directly at Gun-Control legislation. Yet, the message more powerfully articulated than ever by adolescent-turns-adult\n  students, takes aim at something further afield. </p>\n  <p>Students, remembering the February 14th massacre victims, take aim at the corruption stemming from the 2010 Supreme\n  Court \"Person-hood\" protection for Corporations, also known as the\n  <i>Citizens United</i> Decision. A dated, but poignant, article from National Public Radio explains:\n  </p>\n  <p class=\"quote\">The Supreme Court extended that protection to corporations, and over time also extended some — but not all — of the\n  rights guaranteed to individuals in the Bill of Rights.\n  <sup>1</sup>\n  </p>\n  <p>\n  Yet, it appears deceptively harmless for Congressional Law-makers to protect corporations, in the form of\n  <strong>Gun Manufacturers' Lobbyists, </strong>\n  as equally as it protects humans. The origin or this ruling dates to a 70's Neo-Liberal, right-leaning legislation and Court\n  rulings that include a pivotal 1978\n  <i>First National Bank of Boston v. Belloti</i> decision allowing for corporations' ballot-initiative campaign contributions,\n  citing the First Amendment.\n  <sup>2</sup>\n  </p>\n  <p>\n  \n  The Result? The corporation, in \"person\" form, takes on Pseudo-Human qualities: immortal, beyond-measure capital, and programmatically\n  serving stock-holders' interests with cut-throat competition at all costs. No match against a sympathetic human,\n  yet the Corporation is given the same rights and privileges as the man in the street. Now, in the face of two decades'\n  dead humans--as young as\n  <i>Sandy Hook Elementary</i>, which were not protected by Legislation, due to commitments made to corporate lobbying.\n  </p>\n  <p>It appears increasingly difficult for Marco Rubio to accept money from gun lobbyists\n  <i>in exchange</i> for executing their legislation demands. As I mentioned in my\n  <a href=\"#18-02-14\">February 14th post</a> on the topic, it is clear a generation is awakening: And, the Humans have begun to revolt\n  against the\n  <strong>Heavily-Armed Lobbying Machines!\n  </strong>\n  </p>\n  <p>1.\n  <a href=\"https://www.npr.org/2014/07/28/335288388/when-did-companies-become-people-excavating-the-legal-evolution\"\n  target=\"_blank\">https://www.npr.org/2014/07/28/335288388/when-did-companies-become-people-excavating-the-legal-evolution</a>\n  </p>\n  <p>2.\n  <a href=\"http://www.ncsl.org/research/elections-and-campaigns/campaign-finance-and-the-supreme-court.aspx#dnn_ctr77443_HtmlModule_lblContent\"\n  target=\"_blank\">http://www.ncsl.org/research/elections-and-campaigns/campaign-finance-and-the-supreme-court.aspx</a>\n  </p> \n  "
  },
  {
    "id": "11",
    "did": "18-03-13",
    "date": "March 13, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "The Sharing Economy Hand-in-Hand with the Market Economy:<br /> Part III and Sustainability of Shared, Distributed Ledger Types",
    "post": "\n  <p class=\"firstparagraph\">March 13th, 2018 marks the day that certain types of blockchain technologies, notably Bitcoin and Ethereum, face\n  an existential crisis: Today, a new distributed ledger technology has been announced, which departs from the traditional\n  \"Proof-of-Work\" (energy-intensive calculations) Blockchain technologies. This is critically important to zero carbon-footprint.\n  For example, Bitcoin calculations drain more energy, 50 TeraWatt/hrs per year--higher than Singapore's 49.8!</p>\n  <p>Next, the primary security flaw of consensus-based leadership like Ripple, Iota (as opposed to\n  <i>random-selection blockchain leadership</i> based on carbon-intensive calculations) is they are susceptible to Hacking:\n  Denial-of-Service Attacks are possible because the next leader Block can be anticipated and followed by a Bot),\n  so the blockchain cycle is attacked at every cycle. </p>\n  <p>The Heder Hashgraph unveiled today overcomes this problem by using a 39-node-leader hashgraph data structure. Interestingly,\n  this is based on the original Visa Credit Card design from the 1950's (then called AmericaBank) for authenticating\n  system. </p>\n  <p>\n  Next, The Heder Hashgraph overcomes the problem of \"fairness\" because blockchain transactions are\n  <i>\n  <strong>not ordered in each cycle</strong>.</i> Bitcoin transactions are haphazardly lumped together in each block-cycle,\n  which is ~12 minutes. Which means that time-sensitive financial data queries will always lose! </p>\n  <p>\n  Swirld's unveiled their consensus-based\n  <strong>Hashgraph, a type of distributed ledger technology (DLT),</strong> last year. Today, it has now been announced to\n  deploy in late 2018 on the Hedera Hashgraph public network. This is tremendous news! Tremendous, since I explained\n  in my\n  <a href=\"#18-03-01\">March 1st </a> blog post that older blockchain technologies incentivize miners' efforts by directly tying electrical-cost(\n  (in calculations) to the Bitcoin/hour profit margin. For this reason, the future horizon just considerably shortened\n  Bitcoin's runway for establishing anything beyond \"early-adopter\" status. </p>\n  <p>So, we'll see if the innovating crew with Vitalik Buterin's Ethereum can successfully alter the crypto algorithm\n  into it's planned carbon-free consensus-based, \"proof-of-stake\" form. For the moment, Bitcoin, Ethereum, and other\n  electricity-draining \"proof-of-work\" designs, have their\n  <strong>exchange value trapped inside their own Carbon Footprint</strong>.\n  <sup>4</sup> And so, because environmental sustainablity is foremost of concerns for future investment, survival may\n  depend on digging out of that Carbon Footprint much more quickly!</p>\n  \n  <p>1.\n  <a href=\"https://www.forbes.com/sites/jeffkauflin/2018/03/13/hedera-hashgraph-thinks-it-can-one-up-bitcoin-and-ethereum-with-faster-transactions/#175e5c79abcb\">\n  https://www.forbes.com/sites/jeffkauflin/2018/03/13/hedera-hashgraph-thinks-it-can-one-up-bitcoin-and-ethereum-with-faster-transactions/#175e5c79abcb\n  </a>\n  </p>\n  \n  <p>2.\n  <a href=\"https://www.coindesk.com/hedera-hashgraph-swirlds-no-fork-guarantee-cryptocurrency-touts-resistance-code-splits/\"\n  target=\"_blank\">\n  https://www.coindesk.com/hedera-hashgraph-swirlds-no-fork-guarantee-cryptocurrency-touts-resistance-code-splits/</a>\n  </p>\n  \n  <p>3.\n  <a href=\"https://venturebeat.com/2018/03/13/hedera-hashgraph-and-mz-unveil-next-generation-blockchain-alternative/\"\n  target=\"_blank\">\n  https://venturebeat.com/2018/03/13/hedera-hashgraph-and-mz-unveil-next-generation-blockchain-alternative/</a>\n  </p>\n  \n  \n  <p>4.\n  <a href=\"https://blog.ethereum.org/2016/02/09/cut-and-try-building-a-dream/\" target=\"_blank\">https://blog.ethereum.org/2016/02/09/cut-and-try-building-a-dream/</a>\n  </p>\n  "
  },
  {
    "id": "10",
    "did": "18-03-12",
    "date": "March 12, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "The Sharing Economy Hand-in-Hand with the Market Economy:<br /> Part II and New Forms of Trust",
    "post": "\n  <p class=\"firstparagraph\">\n  Throughout the centralized-tech period of the\n  <i>mobile-powered </i> Web 2.0, most Sharing transactions take place on a centralized platform that simply facilitates\n  the peer-to-peer transactions. However, the trust is based on some third-party authority. For instance, Uber serves\n  as the centralalized, third-party authority between both consumers (whether resource-obtaining or resource-providing)\n  must place their trust. Similarly, centralized authorities like Paypal, etc. enable peer-to-peer collaboration.\n  Yet, the notion of trust remains unsolved: Both parties must place their faith in the third party. By definition,\n  this problem that undermines the\n  <i>Sharing Economy</i> is resolved by Blockchain technologies, through cryptography. Now, Decentralized Apps (DAPPS)\n  provide a truer sharing platform for value transactions.\n  </p>\n  <p>In short, neither peer,\n  <strong>neither consumer needs to be trusted, because both parties share a mutual trust in their shared ledger</strong>\n  (think of a thick book with an indexed log of each and every transaction, with unchangeable entries etched by cryptography.\n  In this fashion the forms of Exchange Value include:\n  <br /> 1. Value Funds &amp; Investments\n  <br /> 2. Immutable Insurance &amp; Risk Management\n  <br /> 3. Account for &amp; Audit Commodified Value 4. Authenticate &amp; Attest to Value\n  <br /> 5. Transfer, Store, Lend Value\n  <br />\n  </p>\n  "
  },
  {
    "id": "9",
    "did": "18-03-10",
    "date": "March 10-11, 2018  <br /> Weekend",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "The Sharing Economy Hand-in-Hand with the Market Economy:<br /> Part I and the Race for Sustainability Solutions",
    "post": "\n  <p class=\"firstparagraph\">Sharing can be a philosophy and even an ideology, but it is also\n  <strong> a concept sewn into the Technology of the Era</strong>. Sharing economy refers to both democratized peer-to-peer\n  marketplaces,\n  <i>and</i> collaborative, resource-circulating consumption systems where the consumer&#39;s role is provider or obtainer\n  of resources. By either sense, the\n  <i>Uberized</i> economy is made possible by the underlying platform of Decentralized Technologies. Mobile social media,\n  internet, and blockchain tech creates the conditions needed for a convenient, community-based transactions.</p>\n  \n  <p>Bitcoin and Ethereum crypto-contracts grab the headlines, however it is the very nature of blockchain&#39;s\n  <i>distributed, i.e. shared, </i>ledger that revolutionizes how humans interact, and how they exchange and share goods\n  and services. So, how might a transactional, zero-sum Market Economy merge with a Sharing Economy?</p>\n  \n  <p>In\n  <i>The Third Industrial Revolution, </i>Social and Economic theorist, Dr. Jeremy Rifkin, provides insight into how\n  the\n  <strong>Sharing Economy can grow alongside the traditional Market Economy</strong>.\n  <sup>1</sup> The theory argues three (3) breakthroughs are needed to create the conditions necessary for a new &quot;general\n  purpose technological platform,&quot; and thus an Industrial Revolution. They are management/commmunication of power,\n  sources of new power/energy, and the transportation of this power.</p>\n  \n  <p>The first condition: New forms of communication to\n  <i>manage</i> power, for example steam-powered printing press, trans-oceanic telegraph, then later telephone. The second\n  condition: New energy sources, for example steam-engine using coal and other fossil fuels. The third condition:\n  New methods to transport energy, i.e. the steam engine on rails, then later fossil fuel vehicles.</p>\n  \n  <p>So what&#39;s new about today? 5G Cellular technology coupled with decentralized, blockchain internet; Second, improving\n  solar &amp; wind power coupled with decentralized, bi-directional energy grid; and third, transporation by automatated,\n  driverless shipping for example. So, why is this important, even vital to adapt a new paradigm that fits the new\n  technology? exponential populstion growth and exponential climate changes are top of the list.</p>\n  \n  <p>Britain&#39;s innovations with steam &amp; coal characterized the first Industrial Revolution, and America&#39;s\n  innovations in telephones, oil-fueled vehicles, and centralized transportation grid, however the innovations in\n  the present era are much quicker than previous eras... which means we as a society can embrace more proactively\n  the New Paradigm needed to adapt.</p>\n  \n  <p>So, how can we change the way we\n  <i>think</i> and how we\n  <i>react</i> depends on our worldview, and how deeply entrenched. Thomas Kuhn&#39;s 2004 publication on\n  <strong>\n  <i>The Structure of Scientific Revolution</i>\n  </strong>\n  <sup>3</sup> explains how society will drag its feet in the face of change, and only after decades of controversy will\n  a New Paradigm Shift emerge. In this occasion however, we as a society may not have the luxury of decades to adapt\n  to New Technologies, as the carbon hangover from the previous Industrial Era imperils the safe arrival of the next!</p>\n  \n  <p>&nbsp;</p>\n  \n  <p>1.\n  <a href=\"https://www.foet.org/books/the-third-industrial-revolution/\" target=\"_blank\">https://www.foet.org/books/the-third-industrial-revolution/</a>\n  </p>\n  \n  <p>2.\n  <a href=\"https://www.economist.com/node/21553017\" target=\"_blank\">https://www.economist.com/node/21553017</a>\n  </p>\n  \n  <p>3.\n  <a href=\"https://projektintegracija.pravo.hr/_download/repository/Kuhn_Structure_of_Scientific_Revolutions.pdf\"\n  target=\"_blank\">3. Kuhn, Thomas, The Structure of Scientific Revolutions, </a>\n  </p>\n  "
  },
  {
    "id": "8",
    "did": "18-03-09",
    "date": "March 9th, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "&#39;Alexa, can you laugh?&#39;",
    "post": "\n  <p class=\"firstparagraph\">Alexa has made headlines about reports of unexplained laughter responses\n  <sup id=\"0309-1\">1</sup>. Information like this needs a\n  <i>\n  <strong>fact-check</strong>\n  </i> &agrave; la Snopes.com.\n  <sup id=\"0309-2\">2</sup> And, whether or not Alexa misheard, &quot;Alexa, laugh&quot;, or not, is less important than the\n  <i>socially-intrusive consequences</i> of simple app-development errors. The first issue is simply that programmer\n  <strong>logic </strong> and user-interface intuition should be as clear (and generalized) as possible. This is easier said\n  than done, for example the recent case of Hawaii&#39;s mistaken\n  <i>incoming-ballistic-missile warning system</i>.\n  <sup >3</sup> As it turned out, the dropdown-menu design placed the &quot;Send Test Warning&quot; next to &quot;Send Warning&quot;\n  in an unintuitive, fail-possible manner. Oops.</p>\n  \n  <p>While most focus on Alexa et al.&#39;s actions and abilites, in the name of caution, but rather the larger issue\n  falls on how much we allow ourselves to mentally depend on tech for things.</p>\n  \n  <p>1.\n  <a href=\"https://www.buzzfeed.com/venessawong/amazon-alexa-devices-are-laughing-creepy?utm_term=.um6P18a8a#.cgggP2j2j\"\n  target=\"_blank\">https://www.buzzfeed.com/venessawong/amazon-alexa-devices-are-laughing-creepy?utm_term=.um6P18a8a#.cgggP2j2j</a>\n  </p>\n  \n  <p>2.\n  <a href=\"https://www.snopes.com/fact-check/is-amazons-alexa-emitting-unprompted-creepy-laughing/\" target=\"_blank\">https://www.snopes.com/fact-check/is-amazons-alexa-emitting-unprompted-creepy-laughing/</a>\n  </p>\n  \n  <p>3.\n  <a href=\"https://www.washingtonpost.com/news/morning-mix/wp/2018/01/16/that-was-no-wrong-button-in-hawaii-take-a-look/?utm_term=.a2aa65329002\"\n  target=\"_blank\">https://www.washingtonpost.com/news/morning-mix/wp/2018/01/16/that-was-no-wrong-button-in-hawaii-take-a-look/?utm_term=.a2aa65329002</a>\n  </p>\n  "
  },
  {
    "id": "7",
    "did": "18-03-08",
    "date": "March 8, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "1.4 Million Reasons for More Women in Tech, Part II <br /><br /> * Continuation of Women in Tech Theme from<a href=\"#18-02-23\">Feb. 23rd Blog</a>",
    "post": "\n\n  <p class=\"quote\">This is the first time in human history that we have the ability to see enough about ourselves that we can hope to\n  actually build social systems that work qualitatively better than the systems we&#39;ve always had.</p>\n  \n  <p class=\"quote\">--Author unknown</p>\n  \n  <p class=\"firstparagraph\">My February 23rd Post on women in tech focused on the\n  <i>workforce demand</i> for more women in tech positions, however today I&#39;m writing on the\n  <strong>\n  <i>social need</i> for more female insight within the tech workforce</strong> , given that programming will increasingly\n  shape our future institutions. This means that every institution, whether private hospitals, non-profit charity\n  foundations, or government bureaus, will effectively restructure (optimize) their own organizational structure in\n  an increasingly\n  <i>data-driven</i> paradigm. From a Sociology of Organizations perspective, the changes to come are breath-taking to\n  consider.</p>\n  \n  <p>So why women? Where could I start? Better stated, why is a quintessentially important job sector, a sector in desperate\n  need for insight, comprised primarily of men?\n  <sup >1</sup> The facts are evident: ~15-20% of women comprising tech positions.\n  <sup  >2</sup> Numbers aside, I argue there is a quintessential societal need for more women in tech: This is because computing\n  and understanding data has changed since the data collection from Web 2.0 (mobile), becoming more networked and\n  relational.</p>\n  \n  <p>The challenge for society in this age is historic, and women must absolutely be included in the process of the age:\n  Please consider, that in the 1650&#39;s, the invention of the microscope opened a new world of data and\n  <i>information</i> about the bacteriological, microscopic surroundings--hitherto blind to all. Likewise, the telescope\n  has allowed us as a society to explore the outer universe and earth&#39;s position within it.</p>\n  \n  <p>Now, the inventions of machine-learning, computing coupled with Big Data analytics, allows us to explore (and manage)\n  a universe of knowledge--about\n  <i>ourselves</i>, human society--with unfathomably complex, unstructured relational data structures. Accessing the\n  data to computer-readable form is one thing, but meaning in data is inaccessible until the\n  <i>output</i> can be\n  <i>re-</i>programmed into meaningful, human-readable data, i.e. information. This latter stage of development is the\n  key challenge--for which success depends on representative female participation in Tech.</p>\n  \n  <p>Adding to the challenge of finding meaningful trends is the backdrop of noise from spurious variables. This is akin\n  to finding a needle in an increasingly complex and growing haystack.</p>\n  \n  <p class=\"quote\">What&#39;s different now and has changed is it&#39;s no longer about taking this data, putting it into a computer\n  running a calculation and getting a balance sheet answer ...</p>\n  \n  <p class=\"quote\">What&#39;s important now is what is the context of the data, what is it connected to, what effect is it having on\n  data around it... It&#39;s basically a network of the data, it&#39;s no longer sort of tabular columns, of rows\n  of data, it&#39;s\n  <i>interconnected patterns</i>.\n  <br /> --Tim Cook</p>\n  \n  <p>This quote means that as we move away from rule-based, mechanistic data analytics toward more complex, relational\n  and networked data, we need an equally complex paradigm to keep up. Excluding the female mind from this challenge\n  is not simply a clumsy, myopic mistake. Worse yet, so long as the Tech Industry remains gender lop-sided, Tech will\n  increasingly resemble another myopic beast, a cave-dweller named Cyclops.</p>\n  \n  <p>1.\n  <a href=\"https://www.huffingtonpost.com/2015/03/27/women-in-tech_n_6955940.html\" target=\"_blank\">https://www.huffingtonpost.com/2015/03/27/women-in-tech_n_6955940.html</a>\n  </p>\n  \n  <p>2.\n  <a href=\"https://fairygodboss.com/articles/women-in-tech-facts-figures-and-percentages\" target=\"_blank\">https://fairygodboss.com/articles/women-in-tech-facts-figures-and-percentages</a>\n  </p>\n  \n  <p>3.\n  <a href=\"https://www.aauw.org/research/why-so-few/\" target=\"_blank\">https://www.aauw.org/research/why-so-few/</a>\n  </p>\n  "
  },
  {
    "id": "6",
    "did": "18-03-07",
    "date": "March 7, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "About the April 23 Implementation of the FCC Net Neutrality Laws: <br /> The Coming Battle of States&#39; versus Federal Rights Part II",
    "post": "\n  <p class=\"firstparagraph\">Washington&#39;s assertion of States&#39; Rights yesterday may augur the first of many lawsuits over control over\n  bandwidth.</p>\n  "
  },
  {
    "id": "5",
    "did": "18-03-06",
    "date": "March 6, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "April 23 Implementation of the FCC Net Neutrality Laws: <br /> The Coming Battle of States&#39; versus Federal Rights",
    "post": "<p class=\"firstparagraph\">Net Neutrality Rules, potentially one of the more important set of Individual Rights for us as citizens in the tech\n  age, will soon undergo the rule changes voted by the Federal Communications Commission (FCC) this past December.\n  In a nutshell, the Internet Service Providers (ISP&#39;s), e.g. Comcast, Cox, Verizon are granted the power--as\n  a Title I &quot;information service&quot;--to slow down traffic, make fast- &amp; slow-lanes. Of course this is\n  bad news for internet-users because even premium users may experience &quot;throttling&quot; if using the ISP&#39;s\n  preferred apps. The only stipulation holds that the ISP&#39;s rules are made public. However, 21 states are bringing\n  lawsuits to fight these changes, and the first assertion of State Law by Washington State today:</p>\n  \n  <p class=\"quote\">The FCC is already embroiled in a variety of lawsuits related to its rollback of net neutrality rules, including\n  an effort from 21 state attorneys general to get a court to block the FCC&#39;s move.</p>\n  \n  <p class=\"quote\">&quot;This is symbolic politics, because the states know it is illegal to do,&quot; Roslyn Layton, a visiting scholar\n  at the American Enterprise Institute, told NBC News. &quot;But they can put rules on the book and make it look like\n  they&#39;re doing something.&quot; The FCC is already embroiled in a variety of lawsuits related to its rollback\n  of net neutrality rules, including an effort from 21 state attorneys general to get a court to block the FCC&#39;s\n  move.\n  <sup>1</sup>\n  </p>\n  \n  <p>S The big question arises over\n  <i>who</i> has jurisdiction between the States&#39; and Federal authority; yet one thing is certain, the coming battle\n  for protecting citizens&#39; rights will take place over jurisdiction of Internet Bandwidth turf.</p>\n  \n  <p>\n  <a href=\"https://www.nbcnews.com/tech/tech-news/washington-state-passes-net-neutrality-law-states-push-back-against-n854086\"\n  target=\"_blank\">https://www.nbcnews.com/tech/tech-news/washington-state-passes-net-neutrality-law-states-push-back-against-n854086</a>\n  </p>\n  "
  },
  {
    "id": "4",
    "did": "18-03-05",
    "date": "March 5, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "A Return to the Question of Guns, Germs, and Steel: Part II and the Germs",
    "post": "<p class=\"firstparagraph\">Germs present a timely topic for today, given the especially virulent\n  <strong>Flu Virus strain</strong>. Many, like me, have wondered why our 1940&#39;s-era\n  <sup>1</sup> technology in Flu Vaccine fabrication wouldn&#39;t invite more innovative solutions. Without feigning any\n  medical expertise, I have to still ask about the progress made with the ever-mutating--i.e., drifting--Flu virus&#39;\n  surface protein &quot;head,&quot; called hemaglutinin. This strategy &quot;guesses right&quot; very effectively,\n  and provides an effective solution for most, in most years. Yet this winter has revealed that effectiveness statistics\n  are\n  <i>not always</i> in our favor.</p>\n  \n  <p class=\"quote\">For many decades, researchers believed the flu vaccine offered solid protection if it was a good match to the circulating\n  strains; studies from the 1940s through the 1960s routinely showed an efficacy of 70% to 90%. But those studies\n  relied on a misleading methodology.</p>\n  \n  <p class=\"quote\">Danuta Skowronski, an epidemiologist at the BC Centre for Disease Control in Vancouver, Canada, instead blames mutations\n  in the vaccine strain itself. The most common influenza vaccine contains an &quot;inactivated&quot; virus, which\n  manufacturers grow in chicken eggs. As Skowronski&#39;s team first reported in 2014, the virus can mutate while\n  it is growing in the eggs, resulting in a vaccine unable to block circulating strains.\n  <sup>1</sup>\n  </p>\n  \n  <p>Earlier, I casually mentioned &quot;guessing&quot;, yet with great respect, the science behind estimating the flu\n  virus between the time of R &amp; D, fabrication, and the flu\n  <i>season</i>. (This antigenic drift, not to be confused with\n  <i>Antigenic Shift</i> in which the Flu Virus makes an abrupt change.) I&#39;ll let the CDC abbreviate this:</p>\n  \n  <p class=\"quote\">One way they change is called &ldquo;antigenic drift.&rdquo; These are small changes in the genes of influenza viruses\n  that happen continually over time as the virus replicates. These small genetic changes usually produce viruses that\n  are pretty closely related to one another, which can be illustrated by their location close together on a phylogenetic\n  tree. Viruses that are closely related to each other usually share the same antigenic properties and an immune system\n  exposed to an similar virus will usually recognize it and respond\n  <sup>2</sup>.</p>\n  \n  <p>So, ultimately, the strategy is to estimate the form, location, of that virus--what it will look like--at a particular\n  period each year. This implicates a strategy to estimate the trajectory, stage by stage, of this virus, i.e. a longitudinal\n  time-series morphology, each year. The article makes this point more precise:</p>\n  \n  <p class=\"quote\">But these small genetic changes can accumulate over time and result in viruses that are antigenically different (further\n  away on the phylogenetic tree). When this happens, the body&rsquo;s immune system may not recognize those viruses.\n  <sup>2</sup>\n  </p>\n  \n  <p>Petri dishes aside, let&#39;s focus on the changing nature of the Flu Virus, which makes itself a\n  <i>research </i>challenge in itself because of an ever-mutating object of study. Yet, this ever-changing nature also\n  provides the very tool Statisticians need most for estimating: Big Data. The Law of Large Numbers means that plain\n  math can accurately plot, and in most cases predict with a moderate statistical significance, future events, sort\n  of.</p>\n  \n  <p>Sort of I say because too often we predict that two separate events are more likely to occur, conditional on each\n  other, then conditional upon other factors. This being\n  <i>correlation</i>, but the Statistician&#39;s Holy Grail is the other kind: Causality. Causality hinges on only thre3e\n  things: 1) Association, 2) Time Precedence, and 3) Ruling out any\n  <i> effect</i> of spurious variables. (Hang with me, I&#39;m still getting back to the subject of our annual predictions\n  about a few months&#39; worth of antigenic drift.)</p>\n  \n  <p>Therefore, Big data, and new advances in the statistical sciences, and the technology that increasingly defines our\n  sciences, may soon refine and supercharge research into the first and third of the three points of causality. The\n  first of these, the associations, along the phylogenetic tree, are merely a network at its base, the science of\n  which gains computational strength each year. Rare as it is in Academia, in this case Might makes Right!</p>\n  \n  <p>\n  The third tenet of causality, after association and time direction, is ruling out the effect of other factors when separating\n  <i>cause</i> and consequence. Advances in managing big data, and statistical analysis of it, means gaining a better\n  handle on the multiple effects of\n  <sup>spurious </sup>factors, hence analysis optimized by new, network-graph data structure technology. The Law of Large\n  Numbers\n  <sup>3</sup>, i.e. the sheer number of mutations and other factors, coupled with new\n  <strong>technology</strong>, will better inform the morphology of the\n  <i>path</i> of the virus, along the phylogenetic tree itself. Who knows where a cure may come from, perhaps a bio-statistician\n  out there, churning the numbers, may be the one to stumble upon a better Flu Vaccine!\n  \n  </p>\n  <p>1.\n  <a href=\"http://www.sciencemag.org/news/2017/09/why-flu-vaccines-so-often-fail\" target=\"_blank\"> http://www.sciencemag.org/news/2017/09/why-flu-vaccines-so-often-fail </a>\n  </p>\n  \n  <p>2.\n  <a href=\"https://qz.com/1143420/the-2017-2018-flu-vaccine-is-less-effective-than-usual\" target=\"_blank\"> https://qz.com/1143420/the-2017-2018-flu-vaccine-is-less-effective-than-usual </a>\n  </p>\n  \n  <p>3.\n  <a href=\"https://www.cdc.gov/flu/about/viruses/change.htm\" target=\"_blank\"> https://www.cdc.gov/flu/about/viruses/change.htm </a>\n  </p>\n  "
  },
  {
    "id": "3",
    "did": "18-03-03",
    "date": "March 3-4, 2018 <br /> Weekend",
    "author": "by Thomas Maestas, MA",
    "cat3": "Sociology Tomorrow!",
    "title": "A Return to the Question of Guns, Germs, and Steel",
    "post": "\n  <p class=\"firstparagraph\">Back in 1997, a Pulitzer-Prize winning theory--based on Dr. Jared Diamond&#39;s\n  <i>Guns, Germs, and Steel: The Fate of Human Societies</i> --provided the recipe book for the success of societies.\n  Not without controversy, the theory posits that geographic and environmental preconditions, once met, provide tech\n  &amp; resources trading opportunities, within a network of other nation-states also vying for technogical innovation.</p>\n  \n  <p>A nation&#39;s Technology, in turn, opens the means necessary to expansive, stable, independent sovereignty that\n  lasts and thrives. Equally so, the nation&#39;s friends, especially those making the best-friends list, share and\n  receive a secondary, &quot;residual&quot; technological bump over the time-course of the network&#39;s future trading,\n  i.e. network transactions. So, if our best friends Canada and Mexico are less keen, then there is network reverberation!</p>\n  \n  <p>Given the advent of a real, lasting Trade-War, I would think that a network theorist wouldn&#39;t be betting on one\n  particular node within this network. I say this because a disproportionately asymmetrical flow of technology and\n  resources, while simultaneously raising prices on most staple goods, may spell trouble for the Every-Day person.\n  So far, Nation-State: 0, People: 0 ... So, who wins with a Trade War? Alas, let&#39;s hope not the resurrection\n  of the Neo-Multi-National Corporations, born from NAFTA deals, coincidentally, from the late 1990&#39;s. Bah humbug!</p>\n  \n  <p>&nbsp;</p>\n  \n  <p>1.\n  <a href=\"http://www.jareddiamond.org/Jared_Diamond/Guns,_Germs,_and_Steel.html\" target=\"_blank\">Guns, Germs, and Steel. &quot;Steel: The Fates of Human Societies.&quot; Diamond J (1997).</a>\n  </p>\n  "
  },
  {
    "id": "2",
    "did": "18-03-02",
    "date": "March 2, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Web Dev Affairs",
    "title": "Widening Circles of Mobile-App Security Risks",
    "post": "\n<p class=\"firstparagraph\">Security, security, another day another platform risk, or risks from your device, or risks from transactions, Today&#39;s\nheadline buried beneath a techy jargon provides a glimpse of the rising threat of web-application-based hackery:\nCryptojacking.\n<i>Coindesk</i> reports, &quot; Opera browser introduces cryptocurrency miner protection for smartphones ... &quot;</p>\n\n<p class=\"quote\">Cryptocurrency miners can overload smartphones&#39; CPUs, forcing 100 percent usage and potentially causing a phone\nto overheat. And the damage can sometimes be permanent. According to a ZDNet article, one trojan generated so much\nheat in a phone, its battery became swollen, permanently damaging the phone. While excessive ads were one reason\nfor the heat generation, the main cause was that the phone&#39;s CPU was hijacked to mine for Monero.\n<sup>1</sup>\n</p>\n\n<p>The larger issue here is that the lines between trusted mobile-app authorities, i.e., certified by Play Store or\nApple&#39;s is increasingly irrelevent. This is because an increasing number of app-users are ditching device-downloaded\napps, preferring for browser applications--hence, a much more appetizing market for the newest generation of blackhat\nhackers, online thieves, peeping-toms, and other ill-wishers. There are a few driving factors for this issue--one\nof which is the onset of Decentralized Applications (DAPPs), which use the\n<i>browser</i> to interface between the Every-Day blockchain client/merchant/programmer and the actual byte-code of\nthe blockchain (via WEB).</p>\n\n<p>More importantly, the larger issue is that we live in an age in which the exclusive, native browser language since\n1995, i.e. JavaScript. Security issues with browser-based apps were very low, because JavaScript never left the\nbrowser, ever. Until 2009, Data, Servers were the domain of PHP, JAVA, Python, etc. or some other language for the\nhighly sensitive, dirty work of dipping into all that data sitting ontop of centralized servers around the world.\nPHP wasn&#39;t easy, so power and responsibility usually followed with all the extra effort and expertise.</p>\n\n<p>2015 augured in the Node.js server-accessing (can create, read, update, and delete date) new-born capabilities of\nJavaScript</p>\n\n\n<p>1.\n<a href=\"\nhttps://www.coindesk.com/opera-browser-introduces-cryptocurrency-miner-protection-for-smartphones/\n\" target=\"_blank\"> https://www.coindesk.com/opera-browser-introduces-cryptocurrency-miner-protection-for-smartphones/ </a>\n</p>\n"
  },
  {
    "id": "1",
    "did": "18-03-01",
    "date": "March 1, 2018",
    "author": "by Thomas Maestas, MA",
    "cat3": "Musing Blockchain",
    "title": "Blockchain Sustainability Issues and The Double-Edged Sword",
    "post": "\n<p class=\"firstparagraph\">I couldn&#39;t help but revisit the\n<strong>Environmental Sustainability</strong> problem I addressed in my February 28th post. This problem, experienced by\nthe top two crypto-currencies Bitcoin and Ethereum, is that the\n<i>monetary</i> value of the currency is matched to the\n<i>computing difficulty</i>--measured either by how much the computer is sweating, or by electricity KiloWatt Hours\nper year.\n<sup>1</sup> Digiconomist succinctly writes:</p>\n\n<p class=\"quote\">The continuous block mining cycle incentivizes people all over the world to mine Bitcoin. As mining can provide a\nsolid stream of revenue, people are very willing to run power-hungry machines to get a piece of it. Over the years\nthis has caused the total energy consumption of the Bitcoin network to grow to epic proportions, as the price of\nthe currency reached new highs.\n<sup>2</sup>\n</p>\n\n<p>And, so the issue I&#39;m addressing is a side-effect of the deepening incentivization for miners to invest more\nequipment, and in turn, more electricity. The article goes on to report Bitcoin&#39;s surpassing 50 TeraWatt-Hours-per-year\nusage has surpassed that of Portugal and Singapore, which are 49.5 TWh per year, and 49.8 TWh per year, respectively.\nIn other words, the usage by the Bitcoin miner&#39;s cost (in electricity) compared with the miner&#39;s gain (in\nBitcoins accrued by incentivized mining) drives up and incentives a deeper Carbon Footprint.</p>\n\n\n<p class=\"quote\">Fueled by a meteoric rise in the Bitcoin price over the past few months, the power usage of the Bitcoin network has\nbeen increasing at a feverish pace. Just a little over three months ago, at the start of November 2017, the Bitcoin\nEnergy Consumption Index was estimating the total electricity consumption of the Bitcoin network to be half of the\ncurrent amount. On the first day of November, the estimated consumption was equal to 24.3 TWh per year.\n<sup>1</sup>\n</p>\n\n<p>\nCarbon Footprint, measured in this way, equates as a double-edged sword: The miner&#39;s electricity costs account for approximately\n65% of the profit (Bitcoin units&#39; value, measured when mined). So the\n<i>economic </i>usage means the cheapest available fuel is part of the business model--and it would lead to the cost\nof the cheapest source of energy: Dirty Coal. At the end of the day, if the\n<i>currency&#39;s </i>rising value means that more computationally-intensive mining is more and more profitable, then\nperhaps the other edge looks preferred!\n</p>\n\n<p>1.\n<a href=\"\nhttps://digiconomist.net/bitcoin-electricity-consumption-surpasses-singapore-portugal\n\" target=\"_blank\"> https://digiconomist.net/bitcoin-electricity-consumption-surpasses-singapore-portugal </a>\n</p>\n\n<p>2.\n<a href=\"\nhttps://digiconomist.net/bitcoin-energy-consumption\n\" target=\"_blank\"> https://digiconomist.net/bitcoin-energy-consumption </a>\n</p>\n"
  }
]