[
  {
    "id": "22",
    "did": "08-25-18",
    "date": "August 25-26, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "The Quantum Chip for All",
    "post": "<p class=\"firstparagraph\">Quantum computing, now readily available for science-venturing public consumption: IBM's Quantum Community and Resources offer cloud access to quantum hardware:\n  </p>\n  <p class=\"quote\">Check out our User Guides and interactive Demos to learn more about quantum principles. Or, dive right in to create and run algorithms on real quantum computing hardware, using the Quantum Composer and QISKit software developer kit.<sup>1</sup></p>\n  <p>With an uncanny resemblence to 21st century chandeliers, the hardware itself is no light matter: Each successive layer cools down to    final chamber that runs at a cool .0017&deg; Kelvin--colder than space!\n  </p>\n  ",
    "blogcite": "<p class=\"cite\">1. <a   href=\"https://quantumexperience.ng.bluemix.net/qx/experience\"   target=\"_blank\">https://quantumexperience.ng.bluemix.net/qx/experience\n  </a>\n  </p>"
  },
  {
    "id": "21",
    "did": "08-24-18",
    "date": "August 24, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Air, More Air, and the Tech of Fast Air",
    "post": " \n  <p class=\"quote\">The Lamborghini Aventador SVJ already made a splash last month when it set a new Nürburgring Nordschleife record for production cars, running an incredible 6:44.97 lap time. Now, it sheds its camouflage, and yep, it looks exactly as crazy as we hoped. This might be one of the wildest Lamborghinis yet.<br /><br />\n  Since we've tackled the SVJ's Nürburgring lap time, let's cover some other numbers. Its 6.5-liter V12 produces 770 horsepower, making this one of the most powerful naturally aspirated road cars of all time. Maximum torque is 531 lb-ft at 6750 rpm, while the power peak comes at 8500 rpm. Lamborghini claims a dry weight of 3362 lbs, which is 110 lbs lighter than an Aventador S coupe according to the factory. Acceleration is jaw-dropping, too, with 62 mph arriving in 2.8 seconds and 124 mph coming in 8.6. Top speed is 217 mph.<sup>1</sup></p>\n  <img src=\"dist/img/aventador.jpg\" width=\"350\" class=\"zoom\"  /><br />\n  <p>Image credit: Road &amp; Track</p>\n \n    ",
    "blogcite": "   <p class=\"cite\">1. <a   href=\"https://www.roadandtrack.com/car-shows/monterey-car-week/a22822020/2019-lamborghini-aventador-svj-debut-specs-photos-price/\"   target=\"_blank\">https://www.roadandtrack.com/car-shows/monterey-car-week/a22822020/2019-lamborghini-aventador-svj-debut-specs-photos-price/\n    </a></p> \n    "
  },
  {
    "id": "20",
    "did": "08-23-18",
    "date": "August 23, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "The Best Offense is a Good Defense",
    "post": "<p class=\"firstparagraph\">Security patches that couldn't have arrived sooner ... </p><p class=\"quote\">The Fortnite Installer was easily exploitable to hijack the request to download the full game.      The problem, as Google's security team discovered, was that the Fortnite Installer was very easily exploitable to hijack the request to download Fortnite from Epic and instead download anything when you tap the button to download the game. It's what's known as a \"man-in-the-disk\" attack: an app on your phone looks for requests to download something from the internet and intercepts that request to download something else instead, unbeknownst to the original downloading app.<br /><br />Here's where things get really bad. Because of the way Android's permissions model works, you won't have to accept installation of an app from \"unknown sources\" beyond the time you accepted that installation for Fortnite.<sup>1</sup> </p>\n       \n      ",
    "blogcite": "   <p class=\"cite\">1. <a   href=\"https://www.androidcentral.com/epic-games-first-fortnite-installer-allowed-hackers-download-install-silently\"   target=\"_blank\"> \n    https://www.androidcentral.com/epic-games-first-fortnite-installer-allowed-hackers-download-install-silently </a></p> \n      "
  },
  {
    "id": "19",
    "did": "08-22-18",
    "date": "August 22, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Quantum Data",
    "title": "Quantum Data V:<br />The Bits and Bolts of Zero, One, and the Superposed Third State",
    "post": "<p class=\"firstparagraph\">Quantum leap from traditional electromagnetic on/off bits (eight bits per byte) is intuitive to the binary qubit, and yet the the superposition third option is less evident: Rather, our observation of the <i>superposition depends on the <strong>probability</i> that, when observed, the value will be affirmative or negative. Better explained by Wired ...</p>\n  <p class=\"quote\">\nComputers do calculations using bits, too. After all, we want them to plug into our existing data and computers. But quantum bits, or qubits, have unique and powerful properties that allow a group of them to do much more than an equivalent number of conventional bits.\n\nQubits can be built in various ways, but they all represent digital 0s and 1s using the quantum properties of something that can be controlled electronically. Popular examples—at least among a very select slice of humanity—include superconducting circuits, or individual atoms levitated inside electromagnetic fields. The magic power of quantum computing is that this arrangement lets qubits do more than just flip between 0 and 1. Treat them right and they can flip into a mysterious extra mode called a superposition.<sup>1</sup>\n</p> \n<p class=\"quote\">For some problems that are very time consuming for conventional computers, this allows a quantum computer to find a solution in far fewer steps than a conventional computer would need. Grover’s algorithm, a famous quantum search algorithm, could find you in a phone book with 100 million names with just 10,000 operations. If a classical search algorithm just spooled through all the listings to find you, it would require 50 million operations, on average.<sup>1</sup> </p>\n        \n        ",
    "blogcite": " <p class=\"cite\">1.  <a   href=\"https://www.wired.com/story/wired-guide-to-quantum-computing/\"   target=\"_blank\">https://www.wired.com/story/wired-guide-to-quantum-computing/\n      </a></p>     "
  },
  {
    "id": "18",
    "did": "08-21-18",
    "date": "August 21, 2018 ",
    "author": "by Thomas Maestas",
    "cat3": "Quantum Data",
    "title": "Quantum Data IV:<br />The Business of Quantum Data  ",
    "post": "<p class=\"firstparagraph\">Quantum research has finally progressed beyond proof-of-concept to practical utility. First photon state transfer, and now solid state transfer of \"entangled states\" allowing for binary, instant data transfer. Beyond medical and enterprise use, quantum entanglement's incremental progress now raises a few eyebrows: \n    </p>\n   <p class=\"quote\">That’s because Google, IBM, and others have decided it’s time to invest heavily in the technology, which, in turn, has helped quantum computing earn a bullet point on the corporate strategy PowerPoint slides of big companies in areas such as finance, like JPMorgan, and aerospace, like Airbus. In 2017, venture investors plowed $241 million into startups working on quantum computing hardware or software worldwide, according to CB Insights. That’s triple the amount in the previous year. <sup>1</sup></p>\n  \n<p>   The cause for excitement accelerates at the pace of progress on the technical engineering side:\n   </p>\n<p class=\"quote\">Physicists have experimentally demonstrated 18-qubit entanglement, which is the largest entangled state achieved so far with individual control of each qubit. As each qubit has two possible values, the 18 qubits can generate a total of 218 (or 262,144) combinations of output states. Since quantum information can be encoded in these states, the results have potential applications anywhere quantum information processing is used.\n .<sup>2</sup></p>\n   <p>So, while there are algorithms, like <i>Shor's SHA-defeating algorithm, that have only existed in theory, can now be applied using capable computational power for the job.</i>\n </p> \n   ",
    "blogcite": "  <p class=\"cite\">1.  <a   href=\"https://www.wired.com/story/wired-guide-to-quantum-computing/\"   target=\"_blank\">https://www.wired.com/story/wired-guide-to-quantum-computing/\n   </a></p> \n   \n   <p class=\"cite\">2. <a   href=\"https://phys.org/news/2018-07-qubit-entanglement.html\"   target=\"_blank\">https://phys.org/news/2018-07-qubit-entanglement.html\n   </a></p>  \n   "
  },
  {
    "id": "17",
    "did": "08-20-18",
    "date": "August 20, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Data that Go Up but Do not Go Down",
    "post": "<p class=\"firstparagraph\">Silicon Valley's tide has rolled in and the ships are tucked away for the night. At dawn, Silicon Valley arises and inherits the kingdom, along with Seattle: And, so   become <i> the intractable data needs of all institutions, public or private, big and small--needs only the cloud can answer.</i> </p>\n    <p>And why not? Cloud data storage offers security, direct service providers with big data jobs, Netflix and Linkedin's extensive real-time network analsyis using Kafka speeds up their ever-ready recommendations.  Reuters shows a glimpse of the Pentagon's (and other nations's) accelerating need to secure data as the intertwining networks of world data migrates to distributed, cloud storage. In this domain, public infrastructure, whether platform-as-a-service or servers, technology -- as usual -- must swoop to save the day. </p>\n\n    <p class=\"quote\">Consultants associated with the $927 billion Seattle juggernaut occupied top positions at the Pentagon ahead of the rollout of a massive cloud contract worth some $10 billion that Amazon looks poised to snag. Rivals complain the requirements were written to favor Bezos’s company. Either way, investors should be prepared for its government business to attract greater scrutiny.<sup>1</sup> \n    </p>\n    <p>Surely controversy awaits any bid decision down here on earth, but all things that go up to the cloud need not come down.</p>\n    ",
    "blogcite": "   <p class=\"cite\">1. <a   href=\"https://www.reuters.com/article/uk-usa-pentagon-breakingviews/breakingviews-amazon-pentagon-ties-may-receive-greater-scrutiny-idUSKBN1L10AS\"   target=\"_blank\">https://www.reuters.com/article/uk-usa-pentagon-breakingviews/breakingviews-amazon-pentagon-ties-may-receive-greater-scrutiny-idUSKBN1L10AS\n    </a></p> \n    "
  },
  {
    "id": "16",
    "did": "08-18-18",
    "date": "August 18-19, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "Quantum Data",
    "title": "Quantum Data III: Sudden Data ",
    "post": "<p class=\"firstparagraph\">Einstein's remark on quantum entanglement's 'spooky' characteristics holds for those caught off-guard, but sudden isn't spooky when sudden is expected. Tokyo's first photon to satellite back to earth with a button switch control almost leads to banality. Yet, transmitting data through a shared quantum state from the first party to second party appears intuitive, even if it is   other-worldly. Wired Magazine:  </p>\n    <p class=\"quote\">You may have heard that a qubit in superposition is both 0 and 1 at the same time. That’s not quite true and also not quite false—there’s just no equivalent in Homo sapiens’ humdrum classical reality. If you have a yearning to truly grok it, you must make a mathematical odyssey WIRED cannot equip you for. But in the simplified and dare we say perfect world of this explainer, the important thing to know is that the math of a superposition describes the probability of discovering either a 0 or 1 when a qubit is read out—an operation that crashes it out of a quantum superposition into classical reality.<sup>1</sup>  \n    </p>\n    <p>Yale researchers on the topic:</p>\n    <p class=\"quote\">\n    In a quantum process known as teleportation the unknown state of a quantum bit can be relayed to a distant party using shared entanglement and classical information. Here we present experiments in a solid-state system based on superconducting quantum circuits demonstrating the teleportation of the state of a qubit at the macroscopic scale. In our experiments teleportation is realized deterministically with high efficiency and achieves a high rate of transferred qubit states. This constitutes a significant step towards the realization of repeaters for quantum communication at microwave frequencies and broadens the tool set for quantum information processing with superconducting circuits. </i><sup>2</sup></p>\n    ",
    "blogcite": "<p class=\"cite\">1. <a href=\"https://www.wired.com/story/wired-guide-to-quantum-computing/\"   target=\"_blank\">https://www.wired.com/story/wired-guide-to-quantum-computing/\n    </a></p>\n    <p class=\"cite\">2. <a href=\"https://seas.yale.edu/news-events/news/quantum-technology-chip\"   target=\"_blank\">https://seas.yale.edu/news-events/news/quantum-technology-chip\n    </a></p>"
  },
  {
    "id": "15",
    "did": "08-17-18",
    "date": "August 17, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Quantum Data, Part II:<br /> Quantum State-Entanglement across a Solid State",
    "post": "\n    <p class=\"firstparagraph\">Quantum communication of data offers instant data transfer, and impenatrability from 3rd parties ... Among the exciting on events on New Haven's public space Green Park, Yale researchers' quantum advances steal the headlines: </p>\n    <p class=\"quote\">The two essential requirements for a scalable quantum information processor are quantum interference (in which a photon – able to be in more than one place at a time – crosses its own path) and single-photon detectors. The chip that the researchers designed contains a nanophotonic waveguide, which can guide light into small spaces and to wherever is needed on the chip. It also has a directional coupler that can split a light beam into two identical beams, or conversely, combine two beams into one output.\n    <br /><br />\n    With this research, Schuck said the research team should eventually realize a programmable optical quantum processor that can run a quantum algorithm. The scalability of the nanofabrication routines for silicon chips will then allow them to solve problems difficult for classical computers.<sup>1</sup></p>\n    <p>Besides the quantum characteristic of a third party's observation/interference, the state is broken and data transfer disappears--and, yet another state is but a button flip's switch away!</p> ",
    "blogcite": "\n    </p>\n    <p class=\"cite\">1. <a href=\"https://arxiv.org/abs/1302.5621\"   target=\"_blank\">https://arxiv.org/abs/1302.5621\n    </p>\n    <p class=\"cite\">1. <a href=\"https://www.nature.com/articles/ncomms10352\"   target=\"_blank\">https://www.nature.com/articles/ncomms10352\n    </a>\n    </p>\n    \n    "
  },
  {
    "id": "14",
    "did": "08-16-18",
    "date": "August 16, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": " ",
    "post": "<p class=\"firstparagraph\">      </p>\n    <p class=\"quote\">   </p> \n    ",
    "blogcite": " \n    <p class=\"cite\">1. <a href=\"https://www.zdnet.com/article/how-brand-new-science-will-manage-the-fourth-industrial-revolution/\"   target=\"_blank\">https://www.zdnet.com/article/how-brand-new-science-will-manage-the-fourth-industrial-revolution/\n    </a>\n    </p>\n    <p class=\"cite\">1. <a href=\"https://scitechdaily.com/physicists-teleport-information-in-a-solid-state-system/amp/\"   target=\"_blank\">https://scitechdaily.com/physicists-teleport-information-in-a-solid-state-system/amp/\n    </a>\n    </p>\n    "
  },
  {
    "id": "13",
    "did": "08-15-18",
    "date": "August 15, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Quantum Data",
    "post": "<p class=\"firstparagraph\"> \n</p><p class=\"quote\"> \n<p >“Historically, magnetism and superconductivity were very disparate fields of physics,” Birge said. “The 1960s’ point of view was that if you were to bring a ferromagnet near a superconductor, you would kill the conductivity.<br /><br />\n“It was found that you can put a ferromagnet near a superconductor; in fact, you can even make a ‘sandwich’—superconductor, ferromagnet, superconductor,” said Joseph Glick, a former doctorate student in Birge’s lab and the paper’s lead author. “Any sandwich of this type is called a Josephson junction, which is at the heart of everything we are doing.<sup>1</sup> </p> \n",
    "blogcite": "  \n<p class=\"cite\">1. <a href=\"https://msutoday.msu.edu/news/2018/msu-physicists-solve-a-storied-problem/\"   target=\"_blank\">https://msutoday.msu.edu/news/2018/msu-physicists-solve-a-storied-problem/\n</a>\n</p>\n"
  },
  {
    "id": "12",
    "did": "08-14-18",
    "date": "August 14, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Quantum Data",
    "title": "",
    "post": "<p class=\"firstparagraph\">      </p>\n    <p class=\"quote\"> <sup> </sup>\n    </p><br />    <p > </p>",
    "blogcite": "<p class=\"cite\">  <a href=\"https://www.nature.com/articles/ncomms10352\"   target=\"_blank\">https://www.nature.com/articles/ncomms10352\n    </a>\n    </p>"
  },
  {
    "id": "11",
    "did": "08-12-18",
    "date": "August 12-13, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now.",
    "title": " ",
    "post": "<p class=\"firstparagraph\">Marvels of anomaly detection extend from business and state security to software integriy -- why not extend the use to <i>social integrity traced by network interaction signatures ...</i> \n    </p>\n    <p class=\"quote\">While some attempts to detect social-media accounts of malicious actors rely on content or language filters that terrorists and disinformers have proved capable of confusing, Mr. Alvari’s algorithm looks for accounts that spread content further and faster than expected. Since this is the goal of terrorist recruiters and propagandists alike, the method could be on the front lines of algorithmic filtering across social networks. Humans still need to make the final determination, to avoid false positives. <sup>1</sup>\n    </p>\n    <p class=\"quote\">While some attempts to detect social-media accounts of malicious actors rely on content or language filters that terrorists and disinformers have proved capable of confusing, Mr. Alvari’s algorithm looks for accounts that spread content further and fas                                                                                                         ter than expected. Since this is the goal of terrorist recruiters and propagandists alike, the method could be on the front lines of algorithmic filtering across social networks. Humans still need to make the final determination, to avoid false positives. <sup>1</sup>\n    </p><br />  \n    <p > </p>.\n ",
    "blogcite": " \n    <p class=\"cite\">1. <a href=\"https://www.wsj.com/articles/bots-vs-trolls-how-ai-could-clean-up-social-media-1533849001?mod=djemCIO_h\"   target=\"_blank\">https://www.wsj.com/articles/bots-vs-trolls-how-ai-could-clean-up-social-media-1533849001?mod=djemCIO_h\n    </a>\n    </p>"
  },
  {
    "id": "10",
    "did": "08-11-18",
    "date": "August 11, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "The Good Doctor, Part IV: Good Doctor, Heal Thyself!",
    "post": "<p class=\"firstparagraph\"> \n    </p>\n    <p class=\"quote\">Machines used to be serviced according to a plan, and late maintenance would mean a risk of production downtime. Today, process data from machines is used for predicting remaining service life. Especially critical parameters such as temperature, noise, and vibration are recorded to help determine the optimal operating state or even necessary maintenance times. This allows unnecessary wear to be avoided and possible faults and their causes to be detected early on. With the help of this monitoring, considerable optimization potential in terms of facility availability and effectiveness arises, bringing with it decisive advantages.\n\n    The main element in this predictive maintenance (PM) is condition-based monitoring (CBM)\n\n    Addressing Sensor Challenges and Demands for Future Servicing<sup>1</sup>\n    </p><br />\n    <img src=\"dist/img/mechDegrade.jpg\" width=\"350px\" class=\"zoom\" /><br />\n    <p > </p>",
    "blogcite": " \n    <p class=\"cite\">1. <a href=\"https://www.sensorsmag.com/components/addressing-sensor-challenges-and-demands-for-future-servicing\"   target=\"_blank\">https://www.sensorsmag.com/components/addressing-sensor-challenges-and-demands-for-future-servicing\n    </a>\n    </p>"
  },
  {
    "id": "9",
    "did": "08-10-18",
    "date": "August 10, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now.",
    "title": "The Good Doctor, Part III: Magneto Encephelop",
    "post": "<p class=\"firstparagraph\"> \n    </p>\n    <p class=\"quote\">. Arrays of SQUIDs (superconducting quantum interference devices) are currently the most common magnetometer, while the SERF (spin exchange relaxation-free) magnetometer is being investigated for future machines.<sup>1</sup>\n    </p><br /> \n    <p > </p>.\n ",
    "blogcite": "  \n    <p class=\"cite\">1. <a href=\"https://www.xlstat.com/en/solutions/features/classification-and-regression-trees\"   target=\"_blank\">https://www.xlstat.com/en/solutions/features/classification-and-regression-trees\n    </a>\n    </p>"
  },
  {
    "id": "8",
    "did": "08-09-18",
    "date": "August 9, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "The Good Doctor, Part II:  <br />About that Second Opinion . . . <br />",
    "post": "<p class=\"firstparagraph\">Classification and Regression (Decision) Trees are not just accurate, multipurpose and foundational to predictive machine learning algorithms (e.g. random forests, bayesian trees, bagging), but the trees' final product reveals the different rationale for the output. Printed onto a sheet   of paper, both statistical practitioner and the domain professional intuitively and heuristically understand practical use for an analysis. This July 2017 Cancer study exemplifies the utility of healthcare-based algorithms of analysis ... \n    </p>\n    <p class=\"quote\">The aim of this study was to develop and validate a clinical predictive model for 1-year mortality among patients with colon cancer who survive for at least 30 days after surgery.<br /><br />Random forest, genetic algorithms and classification and regression trees were combined in order to identify the variables and partition points that optimally classify patients by risk of mortality. The resulting decision tree was categorized into four risk categories. Split-sample and bootstrap validation were performed.<sup>1</sup>\n    </p><br />\n    <img src=\"dist/img/irisCART.jpg\" width=\"350px\" class=\"zoom\" /><br />\n    <p >And, now that sound methodology meets an increasingly user-friendly Machine Learning software toolset for wider practical applications, beginning firstly within healthcare technologies <i>and that second opinion!</i></p>.\n ",
    "blogcite": "Image credits: https://www.xlstat.com/en/solutions/features/classification-and-regression-trees\n    <p class=\"cite\">1. <a href=\"https://www.dovepress.com/combining-statistical-techniques-to-predict-postsurgical-risk-of-1-yea-peer-reviewed-article-CLEP#\"   target=\"_blank\">https://www.dovepress.com/combining-statistical-techniques-to-predict-postsurgical-risk-of-1-yea-peer-reviewed-article-CLEP#\n    </a>\n    </p>"
  },
  {
    "id": "7",
    "did": "08-08-18",
    "date": "August 8, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now.",
    "title": "The Good Doctor, Part I: <br /> How A.I.-Driven Predictive Analytics Rewrites Healthcare",
    "post": "<p class=\"firstparagraph\">Predictive analytics  has slowly progressed in sophistication over the past 45 years, and the current nexus with powerful machine-learning tools changes the health game: </p>\n    <p class=\"quote\"> A report by ABI Research June 2018 report highlighted a significant rise in patient monitoring devices, including AI for home-based preventative healthcare and predictive analytics, which could save hospitals around $52bn by 2021.<br /><br />\n\n    Accenture’s Digital Health Technology Vision 2018 report also claims that 85% of health executives in the US believe that every human will be directly impacted on a daily basis by an AI-based decision within the next three years.<br /><br />\n    \n    Utilising big data generated by clinical information and research can reveal clusters and patterns which can benefit all aspects of healthcare, leading patient care to become increasingly strategic.<sup>1</sup>  </p>\n    <p>It should be noted that the long road paved by statistical theory has revolutionized the above-mentioned fields as much as it now powers the practical use of analytics:</p>\n    <p class=\"quote\">Originating in the statistical (e.g., Holland\n      1986; Rosenbaum 2002; Rubin 2005, 2006) and\n      econometrics literature (see Heckman 2000,\n      2001, 2005; Heckman & Vytlacil 2007a,b;\n      Manski 1995, 2007), the counterfactual,\n      Rubin, or potential outcomes model of causality\n      has, over the past three decades, become\n      the standard conceptual tool to unify the notion\n      of causality, to understand the identification\n      problem at the heart of causal inference,\n      and to assess the utility of alternative estimation\n      techniques (Sobel 2005).<sup>2</sup></p>\n      <p>So, the take-away here is that A.I. and <i>Machine-Learning Research could have never progressed so quickly if not for the settled scientic paradigm over sound analysis that rules out spurious variables, while properly weighting the conditions that matter.</i> Furthermore, the mistakes in algorithm design were made in the 1970's, 1980's, and 1990's--misleading mistakes--have been swept aside, providing much-tested and refined strategies. The medical field's case exemplifies this evolution:</p>\n    <p class=\"quote\">Randomized controlled trials are considered the gold\n    standard for assessing the efficacy of medications, medical\n    procedures, or clinical strategies. Nevertheless, particularly\n    for research on the prevention of chronic disease, randomized\n    trials are often infeasible because of their size, time,\n    and budget requirements, as well as questionable generalizability\n    or ethical constraints.<br /><br />\n    On the other hand, nonexperimental studies of interventions\n    have frequently been criticized because of their potential\n    for selection bias. This concern reached a crescendo\n    with the disparity in estimated effects of hormone replacement\n    therapy from randomized trials and nonexperimental\n    studies. This imbroglio highlighted the need to develop\n    and apply improved methods to reduce bias in nonexperimental\n    studies in which selection bias or confounding is\n    likely to occur .<sup>3</sup></p>\n    <p>So, nowadays we don't ask for a second opinion when we can ask for a trillion opinions narrowed down to one heck of a second opinion!</p>",
    "blogcite": "\n    <p class=\"cite\">1. <a href=\"https://www.healthcareglobal.com/technology/ai-seen-less-threat-and-welcomed-health-professionals-research-reveals\"   target=\"_blank\">https://www.healthcareglobal.com/technology/ai-seen-less-threat-and-welcomed-health-professionals-research-reveals\n    </a>\n    </p>\n    <p class=\"cite\">2. <a href=\"https://www.annualreviews.org/doi/abs/10.1146/annurev.soc.012809.102702\"   target=\"_blank\">https://www.annualreviews.org/doi/abs/10.1146/annurev.soc.012809.102702\n    </a>\n    </p>    <p class=\"cite\">3. <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1448214/\"   target=\"_blank\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1448214/\n    </a>\n    </p>"
  },
  {
    "id": "6",
    "did": "08-07-18",
    "date": "August 7, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "New Math &amp; the Speed of Antiquation, a Case Study:<br />Mobile 8th Generation Intel",
    "post": "<p class=\"quote\">  <i>[Intel's]  i9-8950HK processor is the first mobile Intel processor with six cores and 12 threads. It comes fully unlocked. It has the new Intel thermal Velocity Boost, which automatically increases clock frequency up to 200 MHz if the processor temperature is low enough and there's enough turbo power, giving a turbo frequency of up to 4.8 GHz.</i></p>\n    <p class=\"quote\" The i9-8950HK processor is the first mobile Intel processor with six cores and 12 threads. It comes fully unlocked. It has the new Intel thermal Velocity Boost, which automatically increases clock frequency up to 200 MHz if the processor temperature is low enough and there's enough turbo power, giving a turbo frequency of up to 4.8 GHz.</i>\n    </p>\n    <p class=\"firstparagraph\"> Needs shape our inventions and our inventions shape our needs: With the brand new set of mobile computing requirements serve up utility for the i9.  Intel's advances pale in comparison, however, to GPU and newer computing trends. This theme arises time after time in my posts, but mathematics will rewrite the rules of performance . . .</p>\n    <p class=\"quote\">The 8th Gen processors incorporate Intel Octane memory, a smart and adaptable system accelerator for desktop and mobile platforms using SATA-based storage technology.<br /><br />\n\n    Intel also has released a new Data Drive Acceleration feature that boosts a large secondary HDD hard drive.\n    \n    Together, Intel Octane and Data Drive Acceleration provide up to 4.7x the game loading speed and 1.7x faster media loading, Intel said.\n     </p>\n    <p class=\"quote\">\n    The actual task of processing AI is a very different process from standard computing or GPU processing, hence the perceived need for specialized chips. A x86 CPU can do AI, but it does a task in 12 steps when only three are required; a GPU in some cases can also be overkill.\n    <br /><br />\n    Generally, scientific computation is done in a deterministic fashion. You want to know two plus three equals five and calculate it to all of its decimal places—x86 and GPU do that just fine. But the nature of AI is to say 2.5 + 3.5 is observed to be six almost all of the time without actually running the calculation. What matters with artificial intelligence today is the pattern found in the data, not the deterministic calculation. \n    <br /><br />\nThe result of this predictive problem solving is that AI calculations can be done with single precision calculations. So while CPUs and GPUs can both do it very well, they are in fact overkill for the task. A single-precision chip can do the work and do it in a much smaller, lower power footprint.</p>\n\n<p class=\"quote\">Intel \"can deliver on CPU functionality, which has dropped in performance, but still lags on GPUs and modems,\" noted Rob Enderle, principal analyst at the Enderle Group.\n\n\"Much of the performance these days is gated by the modem and the GPU, not the CPU, which just isn't as importance as it once was,\" he told TechNewsWorld.\n\nDevelopers may not benefit much from the new processors, Enderle said, because \"with IDF shut down, Intel's developer efforts are largely moot.\"\n</p> ",
    "blogcite": " \n    <p class=\"cite\">1. <a href=\"https://www.technewsworld.com/story/85252.html\"   target=\"_blank\">https://www.technewsworld.com/story/85252.html\n    </a>\n    </p>\n    \n    <p class=\"cite\">2. <a href=\"https://www.cnet.com/news/intel-core-i9-9900k-may-boost-to-5ghz/\"   target=\"_blank\">https://www.cnet.com/news/intel-core-i9-9900k-may-boost-to-5ghz/\n    </a>\n    </p>\n     "
  },
  {
    "id": "5",
    "did": "08-06-18",
    "date": "August 6, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Android Pi(e) Day",
    "post": "<p class=\"firstparagraph\">Batteries optimized by machine learning is a feature in the latest version of Android OS, Pie. Some may roll theirs, but the only of desserts that share nameship with the great constant, pi. <i>Mystical 3-1-4 also features A.I.-empowered Textual Analysis, which opens to multiple new possibilities:</i></p>\n    <p class=\"quote\">The other new machine learning-powered feature is the smart text selection tool that recognizes the meaning of the text you selected and then allows you to suggest relevant actions like opening Google Maps or bringing up the share dialog for an address.<sup>1</sup></p>\n    <p>Further, Android Pie's <i>Digital Wellness</i> features offer all the trending self-obedience features--not the least of which FitBit's guilt-inducing, and highly effective,<strong>walk prompts--already the bots are running my life and I obey!</p></strong>",
    "blogcite": " \n    <p class=\"cite\">1. <a href=\"https://techcrunch.com/2018/08/06/say-hello-to-android-9-pie/\"   target=\"_blank\">https://techcrunch.com/2018/08/06/say-hello-to-android-9-pie/\n    </a>\n    </p>\n     "
  },
  {
    "id": "4",
    "did": "08-04-18",
    "date": "August 4-5, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "The New Age of Digital Responsibility",
    "post": "<p class=\"quote\"><i>Bone is constantly turning over through a process in which cells called osteoclasts dig tunnels through bone, and then cells called osteoblasts re-pave those tunnels with new bone. Econs acknowledges that it sounds like an inefficient system, but it has to work this way because you obviously need to be able to use your bones while those repairs are taking place.</i><br /><br />\n     --Michael Econ, physician and member of the American Society for Bone and Mineral Research   \n     <p class=\"firstparagraph\"><i>Bone loss in space can reach 5 to 10% over the course of a year, however the sure cure is Digital Responsibility, the trending fad of 2018, spans from the upcoming Android Pie's in-device digital behavioral tools across the spectrum to Fitbit, Youtube, and others' timed get-up-and-walk push notifications.       </p>  ",
    "blogcite": "<p class=\"cite\">1. <a href=\"https://tonic.vice.com/en_us/article/ne5zg8/this-is-the-effect-working-out-has-on-your-bones\"   target=\"_blank\">https://tonic.vice.com/en_us/article/ne5zg8/this-is-the-effect-working-out-has-on-your-bones\n     </a>\n     </p> \n     "
  },
  {
    "id": "3",
    "did": "08-03-18",
    "date": "August 3, 2018",
    "author": "by Thomas Maestas",
    "cat3": " ",
    "title": "Tour of Google's Chocolate Factory, Part II:<br />Glass Elevator into the Cloud",
    "post": "<p class=\"quote\"><i>Responsive experience with real-time inferencing. There are many tasks where speed matters. This includes interactive speech, visual search, and video recommendations. As AI models increase in accuracy and complexity, traditional CPUs can’t keep up, and the Tesla P4 GPUs can cut latency by an order of magnitude.<br /><br />\n  Video decoding. The Tesla P4 has a dedicated hardware-accelerated decode engine that works in parallel with the GPU, enabling it to transcode and infer up to 35 HD video streams in real time. The integration of deep learning into video pipelines lets organizations offer smarter video services.<br /><br />\n  The inferencing engine that the Tesla P4 uses is based on Nvidia’s Pascal architecture and is designed to increase the performance of servers running deep learning workloads. Google didn’t give a date for general availability other than saying it’s “coming soon” to its public cloud.</i></p>  \n  <p class=\"firstparagraph\">Toys, if they are offered as presents remain unconditional gifts, and yet the devotion they procure make for a reciprocal gift: Google's Developer Tools and little to no cost serve the same purpose as Microsoft's free provisions of Integrated Develepment Environments, i.e. VS Code and recent purchase of GitHub. The New Data Economy, applies as much to the developers' field as it does to consumers'. </p>  ",
    "blogcite": "<p class=\"cite\">1. <a href=\"https://www.cio.com/article/3293424/artificial-intelligence/more-artificial-intelligence-options-coming-to-google-cloud.html\"   target=\"_blank\">https://www.cio.com/article/3293424/artificial-intelligence/more-artificial-intelligence-options-coming-to-google-cloud.html\n  </a>\n  </p> \n  "
  },
  {
    "id": "2",
    "did": "08-02-18",
    "date": "August 02, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Tour of Google's Chocolate Factory, Part II:<br />Google's Golden Ticket",
    "post": "<p class=\"quote\"><i>Google announced it is making Nvidia's Tesla P4 GPU available as a cloud service, enabling more businesses to get started with AI projects quicklyi><sup>1</sup></p>\n  <p class=\"firstparagraph\">API Services &agrave; la Google Cloud have become a new Hallmark--available for 12-month free trial--of <i>Google's ambitious  kit: Cloud IoT (Internet of Things) API, Cloud Genomics API, Cloud Machine Learning Engine API, among dozens of others.</i> Rivers of Kubernetes Data,Tensor-Processing-Unit Automotons for Oompah-Loompahs, and the ever-lasting flavor of chewing gum in the name of publicly available data for your tasting pleasure!   </p>",
    "blogcite": "<p class=\"cite\">1. <a href=\"https://www.cio.com/article/3293424/artificial-intelligence/more-artificial-intelligence-options-coming-to-google-cloud.html\"   target=\"_blank\">https://www.cio.com/article/3293424/artificial-intelligence/more-artificial-intelligence-options-coming-to-google-cloud.html\n  </a>\n  </p>"
  },
  {
    "id": "1",
    "did": "08-01-18",
    "date": "August 1, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Musing Blockchain",
    "title": "Fintech Auchtung!",
    "post": "<p class=\"quote\"><i>In July, Blackrock — the world’s largest exchange-traded fund (ETF) — announced that it has launched a working group to assess the potential of investing in Bitcoin.  <br /><br />\n    Blackrock’s move could be described as a preemptive strike to avoid missing the crypto bus. Goldman Sachs is making headway with cryptocurrency involvement and Blackrock is following suit.</i><sup>1</sup></p>\n    <p class=\"firstparagraph\">\n    <p class=\"quote\">Fintech broke onto the scene as a disruptive force following the 2008 crisis, but the industry's influence on the broader financial services system is changing.\n  \n    The fintech industry no longer stands clearly apart from financial services proper, and is increasingly growing embedded in mainstream finance. We're now seeing the initial stages of this transformation.<br /><br />\n    \n    For instance, funding is growing more internationally distributed, and startups are making necessary adjustments to prove sustainability and secure a seat at the table. Most fintech segments in the ascendant a year ago have continued to rise and grow more valuable to the broader financial system. Meanwhile, several fintech categories have had to make adjustments to stay on top. New subsegments are also appearing on the scene — such as digital identity verification fintechs — as new opportunities for innovation are discovered. \n    <br /><br /> ... \n    The rising influence of fintechs is having a dramatic effect on incumbents, from banks to insurers to wealth managers, pushing them to respond proactively to stay relevant. Incumbents are reacting to changes wrought by fintechs on three key fronts: the front end, the back end, and in their core business operations. As such, incumbents and fintechs are converging on a digital middle ground.\n  <br /><br />\n    As this happens, the fintech industry is on the cusp of becoming an integral component of the broader financial services ecosystem. But it will likely first have to go through a complete credit cycle, and survive an economic downturn like the one that set the stage for its arrival in 2008, for this to happen.<sup>2</sup>\n    </p>\n    ",
    "blogcite": "\n    <p class=\"cite\">1. <a href=\"https://cointelegraph.com/news/institutional-investors-and-fintech-will-wall-street-go-head-first-into-crypto\"   target=\"_blank\">https://cointelegraph.com/news/institutional-investors-and-fintech-will-wall-street-go-head-first-into-crypto\n    </a>\n    </p> \n    <p class=\"cite\">2. <a href=\"https://www.businessinsider.com/8-3-2018-fintech-ecosystem-financial-technology-research-and-business-opportunities-2018-8?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+clusterstock+%28ClusterStock%29&r=US&IR=T&IR=T\"   target=\"_blank\">https://www.businessinsider.com/8-3-2018-fintech-ecosystem-financial-technology-research-and-business-opportunities-2018-8 \n  </a>\n  </p> \n    "
  }
]