[
  {
    "id": "14",
    "did": "06-30-18",
    "date": "June 30-July 1, 2018<br />Weekend ",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "The Space Powers that Be:<br />When Boeing issues a Ticket to the Moon",
    "post": "\n<p class=\"quote\"><i>\nAll people going to the International Space Station must do so through Kazakhstan today. Since the space shuttle retired in 2011, there's no other ship capable of carrying people up there besides Soyuz, the Russian workhorse of many decades. NASA purchases seats for its astronauts; each mission is worth tens of millions of dollars. But the situation is going to change soon. \nTwo companies — Boeing and SpaceX — are developing commercial crew vehicles to carry astronauts to the ISS. They should start flying crews in the next year or two...</i><sup>1</sup>\n</p>\n<p class=\"firstparagraph\">If there is ever a global stage marked by camaderie besides the World Cup, space would have to take a strong 2nd place--ISS collaboration breaks all bounds! But what's really going on with that place anyway? Past 2024--apparently not much, but that's because the moon is going on ...</p>\n<p class=\"quote\">The latest [Congressional Budget Office's] request has no money for the space station past then[2024]. That's so that NASA can focus its resources on the Deep Space Gateway, a lunar space station that plays a part in the administration's request to send astronauts to the moon again before going on to Mars.\n<br /><br />\nThe Europeans have expressed some interest in the Deep Space Gateway, but as for [Russian] Roscosmos, their direction is unclear. The [Russian] agency could join NASA on another space station, go on its own, or ally itself with newer space powers (such as China) for other work.<sup>1</sup>\n</p>\n<p>Besides the moon, I wouldn't be opposed to a year-and-a-half long trip to Mars--so long as I had plenty of reading material, and a round-trip ticket!\n",
    "blogcite": "\n<p class=\"footnotes\">1. <a href=\"https://www.space.com/41038-roscosmos-russian-space-strategy-commercial-crew.html\"   target=\"_blank\">https://www.space.com/41038-roscosmos-russian-space-strategy-commercial-crew.html</a>\n</p>   \n"
  },
  {
    "id": "13",
    "did": "06-29-18",
    "date": "July 29, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now",
    "title": "A.I. &amp; Work, Part II<br />Learning to Learn alongside a Cheerful Automoton Work-Partner",
    "post": "\n<p class=\"firstparagraph\">If there was ever a thing called \"Continuing Education,\" that thing has become a learning, thinking mandate in the modern professional world. Learning to work side-by-side with our A.I. \"automation workmates\" has become a somewhat paradoxical burden whereby the more we learn, the more we get to shovel our work onto our <i>Ever-Cheerful automators</i>, and this is the least onerous burden I have ever had to bear...</i> It's called the <i>Abolition of boring tasks!</i> </p>\n<p>Many writers have touched on the freedom that digital automation affords us: The repetitive, mundane (i.e. mindless) tasks that once occupied days and weeks of our time can now be evaporated away in hours when we just ask for help from our digital automotons--but we first have to ask! </p>\n<p>And so, the work is no longer the work we do: <i>Our work is learning new digitally automated short-cuts, hacks, and clever work-arounds to better shovel the work off to our automotons</i>. But we can only be so clever, and so we have to learn to be more clever: hence the latest rage from colleges and universities with programs offering 'perpetual learning.' The Washington Post reports,</p>\n<p class=\"quote\">\n\nIn the future of work, robots are supposed to wipe out tons of jobs, create a bunch of new ones or deliver some combination of both. Economists predict any of these scenarios will force the average worker to do practically the same thing throughout their careers: keep learning and learning and learning.\n<br /><br />\nSome colleges in the United States are already preparing for this age of perpetual education, including the University of Michigan’s Ross School of Business. The Ann Arbor school launched a scholarship program that pays for graduates to take classes there forever, and the number of students is slowly growing.<sup>1</sup></p>\n<p>\n<p>But what really is the time-scale on this big transformation? Most things operate like they always have, and honestly, maybe we can be a little more picky about what, how, and <strong>why  we \"optimize\" the things we do. But that kind of old-fashioned Ludditism is not the age we live in. Today, everything has to change to stay compatible!  A more telling detail from the New York Times:</p>\n<p class=\"quote\">And we’ve digitized only about 20 percent of the economy, meaning there’s tremendous technological climate change yet ahead. These climate changes are reshaping the ecosystem of work — wiping out huge numbers of middle-skilled jobs — and this is reshaping the ecosystem of learning, making lifelong learning the new baseline for advancement.<sup>2</sup></p>\n<p>20%? Really? So, it sounds like our productivity is <i>inversely proportional to work <strong>we</strong> do</i>, but rather the work--boring, mundane work--that we can effectively hand off to our automon partners--whatever the sector.  \n\n",
    "blogcite": "\n\n<p class=\"footnotes\">1. <a href=\"https://www.nytimes.com/2018/06/26/opinion/political-parties-climate.html\"   target=\"_blank\">https://www.nytimes.com/2018/06/26/opinion/political-parties-climate.html</a>\n</p> \n<p class=\"footnotes\">2. <a href=\"https://www.washingtonpost.com/news/wonk/wp/2018/06/06/in-the-future-college-never-really-ends/?noredirect=on&utm_term=.4d7810952eb7\"   target=\"_blank\">https://www.washingtonpost.com/news/wonk/wp/2018/06/06/in-the-future-college-never-really-ends/?noredirect=on&utm_term=.4d7810952eb7</a>\n</p>  \n\n"
  },
  {
    "id": "12",
    "did": "06-28-18",
    "date": "June 28, 2018 ",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now",
    "title": "A.I. &amp; Work, Part I<br />Fighting Obsessive Compulsive Quantitative Optimization Disorder and the Slide into a Weberian Iron Shell",
    "post": "\n<p class=\"firstparagraph\">Obnoxious misuse of A.I.Tech is a rare thing because developers are among the smartest and most humane among all professions, if I my humbly claim.  But <i>Tech consumers are not necessarily bound by such thoughtful solidarity.</i> The following exemplifies the darker side of A.I. tech...                                          </p>\n<p class=\"quote\">Cogito is one of several companies developing analytics tools that give agents feedback about how conversations with customers are going. Its software measures in real time the tone of an agent’s voice, their speech rate, and how much each person is talking, according to Dr. Place. “We measure the conversational dance,” he says.\n\nThat dance is sometimes out of sync, such as when an agent speaks too quickly or too much, cuts a customer off, has extended periods of silence or sounds tired.\n<br /><br />\nWhen the software detects these mistakes, a notification pops up on a window on an agent’s screen to coax them to change their strategy. The alerts are useful not just for the agents, but also for their supervisors, Cogito says.<sup>1</sup></p>\n<p>For all the fanfare of A.I. and Learning algorithms, let's hope that those who wield such power will not yield to obnoxious misuse. Famed Sociologist Max Weber wrote on the over-rationalizing tendencies of bureaucratic devotion to mass production. He calls it the iron shell, and the ... </p>\n<p class=\"quote\">\"more complex idea that Weber himself sought to evoke with the \"shell as hard as steel\": a reconstitution of the human subject under bureaucratic capitalism in which \"steel\" becomes emblematic of modernity ... Further, whereas a cage confines human agents, but leaves their powers otherwise intact, a \"shell\" suggests ... a new kind of being.</i>\" <sup>2</sup></p>\n<p>This 19th century sociologist Dr. Weber lived in simpler times, pre-dating the 1910's  industry-wide adoption of \"Tayloristic\" calculations in factory settings for optimized and maximum efficiency--all invented by a Factory Supervisor named Frederick Taylor, armed with a pencil and a heavy-duty clipboard!\n</p><p>\nNow imagine starting a new job with a feisty robot, as one proud supervisor proclaims: <i>\"One of her 14 agents said the software noticed he wasn’t speaking with enough energy, so it prompted him with a message to pep up plus a coffee-cup icon, she says.\" </i><sup>1</sup>\n</i> The horror, the horror.</p>\n</p>\n",
    "blogcite": "\n\n\n<p class=\"footnotes\">1. <a href=\"https://www.wsj.com/articles/call-center-agents-get-a-human-touch-1528984801?mod=foesummaries\"   target=\"_blank\">https://www.wsj.com/articles/call-center-agents-get-a-human-touch-1528984801?mod=foesummaries</a>\n</p> \n<p class=\"footnotes\">2. <a href=\"https://www.jstor.org/stable/2678029?seq=1#page_scan_tab_contents\"   target=\"_blank\">https://www.jstor.org/stable/2678029?seq=1#page_scan_tab_contents</a>\n</p> \n"
  },
  {
    "id": "11",
    "did": "06-27-18",
    "date": "June 27, 2018 ",
    "author": "by Thomas Maestas",
    "cat3": "Web Dev Affairs",
    "title": "Apple: You are our Tech Leader!",
    "post": "\n<p class=\"firstparagraph\">As if Apple needed any more money--now Samsung will be writing a half-billion dollar check to right the wrongs of patent infringement and \"slavish\" copying.<sup>1</sup> Well, history certainly repeats itself as it was IBM that played the relentless copy-cat of Apple's technological leadership way-back-when. \n</p>\n\n<p class=\"quote\">Apple Inc and Samsung Electronics Co Ltd on Wednesday settled a seven-year patent dispute over Apple’s allegations that Samsung violated its patents by “slavishly” copying the design of the iPhone.<br /><br />In May, a U.S. jury awarded Apple $539 million, after Samsung had previously paid Apple $399 million to compensate for patent infringement. Samsung would need to make an additional payment to Apple of nearly $140 million if the verdict was upheld.<sup>1</sup>\n</p><p class=\"paragraph\">Isn't it true that Apple is made by and wholly devoted to the Creatives from every sector? And thus the Creator will inevitably create followers ... I guess in retrospect my various Samsung phones and products have been \"inspired\" by Apple...so close, yet so far away--another case of the six-degrees of connections to a celebrity! \n</p>\n<p>My love affair with Apple products is still riding the pink cloud--less than a year now. I have the good luck to use a Macbook Pro that feels, types, and views like a sports car. You can rev the engine by running some heavy-duty map imaging from data calculations--<i>talk about the MacBook's grace and power, when lo, your root is sitting right on top of a Linux Shell. These words come from a 25-year serf to Microsft's ownership.</i> The feel of a 1967 Corvette with very little between you and 350 Horse Power. I honestly haven't experienced this high quality since the first time I listened to Radiohead on my friend's new I-pod in 2007.  \n</p>\n<p>An Ode to Apple products: Apple! You are our Creative Leadership and your Apple Watch is beyond our realm--a postcard from another world. Apple, you alone bear the high standard of quality tech products--because you, Apple, do occupy the highest, and wealthiest, seat among the Tech Giants!\n</p>\n",
    "blogcite": "\n<p class=\"footnotes\">1. <a href=\"https://www.reuters.com/article/us-apple-samsung-elec/apple-samsung-settle-u-s-patent-dispute-idUSKBN1JN2S4\"   target=\"_blank\">https://www.reuters.com/article/us-apple-samsung-elec/apple-samsung-settle-u-s-patent-dispute-idUSKBN1JN2S4</a>\n</p> \n\n"
  },
  {
    "id": "10",
    "did": "06-26-18",
    "date": "June 26, 2018 ",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "T-Nation Makes the Case: Sprint Merger takes on the Senate",
    "post": "\n<p class=\"firstparagraph\">5G Technology, ever so close to life-changing implementation, conjures up fantastic musing over how our everyday products will interact in real-time with our personalized data-cloud. Certainly IoT (Internet of Things) products will be carrying a whole lot of machine-to-machine to machine communication. From the IoT edge (encircling a router, for instance) to communicate sensors to mid-range \"listeners\".</p>\n<p>So, although Sprint-T-Mobile Oneness spells monopoly, the scale of work that needs to be done to convert everything to 5G <i>means we Need a great tech innovator like T-Mobile's John Legere to push with fervor the right ways to deliver 5G connectivity to every American, anywhere.</i> My<a href=\"#18-04-27\"> April 27 post</a> talks more on their affair, but the reality is that Sprint doesn't contribute value to American innovation; that claimed, <i>Sprint's bandwidth rights and spare parts really <strong>will truly</strong>  add value</i> to American Tech!</p>\n",
    "blogcite": "<p class=\"footnotes\">1. <a href=\"https://www.reuters.com/article/us-sprint-corp-m-a-t-mobile-us/sprint-t-mobile-defend-proposed-tie-up-before-u-s-senate-panel-idUSKBN1JN33A\"   target=\"_blank\">https://www.reuters.com/article/us-sprint-corp-m-a-t-mobile-us/sprint-t-mobile-defend-proposed-tie-up-before-u-s-senate-panel-idUSKBN1JN33A/a>\n</p> \n"
  },
  {
    "id": "9",
    "did": "06-25-18",
    "date": "June 25, 2018 ",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now",
    "title": "Modern Prometheus, Part III: <br />Accelerating Evolution of Neural Networks &agrave; la Nvidia GPU",
    "post": "\n<p  class=\"firstparagraph\">\nWhy the GPU rather than CPU for speed? 90% of deep learning algorithms use distributed, parallel problem-calculations. So, who needs a steering wheel racing on the Bonneville Salt Flats? Certain kinds of algorithms do, though, such as recursive, tree-traversing kinds. But I'm just a tourist.\n</p> \n\n<p class=\"quote\"><i>\n[Alex Khrizhevsky] says he recalls reading some paper about matrix multiplication algorithms on the GPU (I don’t know the specific one), and basically the idea he had at the time was just to re-implement the original Lenet architecture[1], but use the GPU to train a network (of unprecedented size in 2012) really fast.\n</i><sup> 1</sup></p>\n\n<p>Evolution of these new AI's, and AI's designing AIs, require voracious amounts of training data to implement and improve learning designs.  So where would AI research stand if not for the ultra-fast and efficient modern-day Graphical Processing Unit? Better asked, what inspired Krizhevski's novel, paradigm-shattering design?  Clearly <i>the Need for Speed!</i> </p>\n \n  ",
    "blogcite": "\n<p class=\"footnotes\">1. <a href=\"https://www.quora.com/How-did-Alex-Krizhevsky-come-up-with-the-idea-of-AlexNet-How-does-the-designer-think\"   target=\"_blank\">https://www.quora.com/How-did-Alex-Krizhevsky-come-up-with-the-idea-of-AlexNet-How-does-the-designer-think</a>\n</p>\n\n \n"
  },
  {
    "id": "8",
    "did": "06-23-18",
    "date": "June 23-24, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now",
    "title": "Modern Prometheus, Part II: <br />Broadening Evolution of Deep Learning Species &agrave; la Neural Network",
    "post": "  <p class=\"quote\"><i>\nDeep learning allows computational models that are composed of multiple processing layers to learn representations of data with multiple levels of abstraction. These methods have dramatically improved the state-of-the-art in speech recognition, visual object recognition, object detection and many other domains such as drug discovery and genomics. Deep learning discovers intricate structure in large data sets by using the backpropagation algorithm to indicate how a machine should change its internal parameters that are used to compute the representation in each layer from the representation in the previous layer. Deep convolutional nets have brought about breakthroughs in processing images, video, speech and audio, whereas recurrent nets have shone light on sequential data such as text and speech.</i><sup>1.</sup>\n</p> \n  <p class=\"firstparagraph\">Artificial Intelligence has evolved from a prototypal event known as the \"Cambrian Explosion, only five years ago.\"<sup>1</sup> An architect named Alex Krizhevsky offered a new paradigm for <i>deep learning</i> at an image recognition event, Imagenet Competition. Mr. Krizhevsky's \"Alex Net\" became the pivotal <i>Convolutional Neural Network</i>, with a mere 8 layers' depth (think of the decision tree mentioned in post 6/20) &amp; millions of parameters. </p>\n\n<p>The handwriting-signature recognition algorithm is still in use today! The design--using a training technique called \"Stochastic Gradient Descent\", by Geoff Hinton--blew the competition away and revolutioned machine learning. </p>\n<p>Today, neural netwoks boast <i>hundreds of layers and billions of paremeters: The last five years has been busy!</i> And the varied species of designs since the original Convolutional Neural Network (CNN) include Recurrent Neural Networks (RNN), Generative Adverserial Networks (GAN) and Reinforcement Learning.\n</p> \n",
    "blogcite": "<p class=\"footnotes\">1. <a href=\"https://www.nature.com/articles/nature14539\"   target=\"_blank\">https://www.nature.com/articles/nature14539</a>\n</p> \n\n<p class=\"footnotes\">2. <a href=\"https://papers.nips.cc/paper/4824-imagenet-classification-with-deep-convolutional-neural-networks\"   target=\"_blank\">https://papers.nips.cc/paper/4824-imagenet-classification-with-deep-convolutional-neural-networks</a><br />\nPDF:  <a href=\"https://www.nvidia.cn/content/tesla/pdf/machine-learning/imagenet-classification-with-deep-convolutional-nn.pdf\"   target=\"_blank\">https://www.nvidia.cn/content/tesla/pdf/machine-learning/imagenet-classification-with-deep-convolutional-nn.pdf</a>  \n</p> \n"
  },
  {
    "id": "7",
    "did": "06-22-18",
    "date": "June 22, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now",
    "title": "Modern Prometheus, Part I.<br />Made from 8 billion transistors and 1,000 Cuda Cores:<br /> Today's Irreplaceable NVidia GPU",
    "post": "  <p class=\"quote\"><i>I sat one evening in my laboratory; the sun had set, and the moon was just rising from the sea; I had not sufficient light for my employment, and I remained idle, in a pause of consideration of whether I should leave my labour for the night, or hasten its conclusion by an unremitting attention to it. As I sat, a train of reflection occurred to me, which led me to consider the effects of what I was now doing. <br />\n  <br />\n  --Victor Frankenstein<sup>1</sup>\n  </i><br /> \n</p>\n<p class=\"firstparagraph\">Nvidia's latest 12\" by 4\" by 4\" GPU accelerates algorithmic work from 1<sup>1/2</sup> months to 4 days. The most recent exponential leaps in computing power--most notably for A.I. purposes, are thanks only to the Graphical Processing Unit. Progress followed a linear path in as 1998 world, a world enlightened by the pivotal A.I. publication, \"Convolutional Neural Netowrks for Handwritten Digital Recognition\" (Lecun, Bottou, <strong>Bengio</strong>, Haffner, 1998) to the present use in blockchain computing and deep learning algorithms, among many other purposes. The technical advantage offered by Nvidia explained by 2012's \"ImageNet Classification with NVIDIA GPUs (Krizhevsky, Hintou, et al.). Ten years ago, Daniele G. Spamintato and Anne C. Elstery offer a succinct explanation:\n</p>\n<p class=\"quote\">Optimization algorithms are becoming increasingly more important in many areas, such as finance and engineering. Typically, real problems involve several hundreds of variables, and are subject to as many constraints. Several methods have been developed trying to reduce the theoretical time complexity. Nevertheless, when problems exceed reasonable sizes they end up being very computationally intensive. Heterogeneous systems composed by coupling commodity CPUs and GPUs are becoming relatively cheap, highly performing systems.\n<br />\n<br /> Recent developments of GPGPU technologies give even more powerful control over them. In this paper, we show how we use a revised simplex algorithm for solving linear programming problems originally described by Dantzig for both our CPU and GPU implementations. Previously, this approach has showed not to scale beyond around 200 variables. However, by taking advantage of modern libraries such as ATLAS for matrix-matrix multiplication, and the NVIDIA CUDA programming library on recent GPUs, we show that we can scale to problem sizes up to at least 2000 variables in our experiments for both architectures. On the GPU, we also achieve an appreciable precision on large problems with thousands of variables and constraints while achieving between 2X and 2.5X speed-ups over the serial ATLAS-based CPU version. With further tuning of both the algorithm and its implementations, even better results should be achievable for both the CPU and GPU versions.<sup>2</sup></p>\n<p>So, given the exponential development advantages of GPU use, it's clear the horizon for more and more developers implicates high computing needs.  So, what exactly is novel yet increasingly a household developer tool? </p>\n<p class=\"quote\">\nCUDA® is a parallel computing platform and programming model developed by NVIDIA for general computing on graphical processing units (GPUs). With CUDA, developers are able to dramatically speed up computing applications by harnessing the power of GPUs.<br /><br />\n\nIn GPU-accelerated applications, the sequential part of the workload runs on the CPU – which is optimized for single-threaded performance – while the compute intensive portion of the application runs on thousands of GPU cores in parallel. When using CUDA, developers program in popular languages such as C, C++, Fortran, Python and MATLAB and express parallelism through extensions in the form of a few basic keywords.\n<br /><br />\nThe CUDA Toolkit from NVIDIA provides everything you need to develop GPU-accelerated applications. The CUDA Toolkit includes GPU-accelerated libraries, a compiler, development tools and the CUDA runtime.\n<sup>3</sup></p>\n<p>And, this tech is arriving at both the mainstream PC-optimization level as much as typical university research, the potential of both laid out in a June 2018 Wired Magazine article:</p>\n<p class=\"quote\">PCs that work on smartphone parts. Devices that run all day, but for real this time. A 32-core hellbeast processor. The first GPU shrunk down to a 7nm process. Always-connected 5G laptops. And while not a PC, the ASUS ROG put vapor cooling in gaming-focused smartphone. (Vapor cooling. In a smartphone.) \n<br /> . . .\n<br />And then there's arguably the real star of the show, an AMD prototype of the first-ever GPU built on a 7nm process. Unlike some of the other blockbuster announcements out of Taipei this week, this one won't make its way to your computer any time soon. It'll find a home in data centers, helping AI and machine learning compute at blistering speeds, using a lot less energy to do so.<sup>4</sup>\n  </p>\n  <p>And so, with blistering speed and the joining of disciplines of science, the spear's tip of innovation accelerates ... without a spare nanosecond for reflection!\n  ",
    "blogcite": "<p class=\"footnotes\">1. Frankenstein, or Modern Prometheus, Mary Shelley, 1818. <br /><a href=\"https://www.gutenberg.org/files/84/84-h/84-h.htm\"   target=\"_blank\"> PDF https://www.gutenberg.org/files/84/84-h/84-h.htm</a>\n  </p>  \n  \n  <p class=\"footnotes\">2.  <a href=\"https://www.gutenberg.org/files/84/84-h/84-h.htm\"   target=\"_blank\">2009 IEEE International Symposium on Parallel & Distributed Processing</a>\n  </p>  \n  <p class=\"footnotes\">3.  <a href=\"https://developer.nvidia.com/cuda-zone\"   target=\"_blank\">https://developer.nvidia.com/cuda-zone</a>\n  </p> \n     <p class=\"footnotes\">4.  <a href=\"https://www.wired.com/story/computex-2018-new-chips-qualcomm-amd-intel/\"   target=\"_blank\">https://www.wired.com/story/computex-2018-new-chips-qualcomm-amd-intel/</a>\n  </p>  \n  \n  "
  },
  {
    "id": "6",
    "did": "06-21-18",
    "date": "June 21, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "\"Taxation Without Representation is Tyranny!\"<br /><br />-- James Otis, 1776",
    "post": "\n  <p class=\"firstparagraph\">\n  <p class=\"firstparagraph\">Small, online businesses face the music today to pay state sales taxes, thanks to the Supreme Court's <i>Wayfair V. South Dakota</i>.<sup>2</sup> My <a href=\"#18-04-14\">April 14th blog</a>, <i>Clash of the Brick &amp; Mortars against Online Stores</i> goes more in depth... </p>\n  <p>What this means is that imminently, 50 variations of newly permitted State internet sales taxes for small businesses.<sup>2</sup> This will inevitably hurt variety, and likely lead to a lot of inter-state confusion: </p>\n  <p class=\"quote\">The new law may seem straightforward, but there are fairly complicated specifics when it comes to different jurisdictions and categorization of goods.\n<br /><br />\n  For example, New Jersey places a tax on marshmallows, which are considered candy and a luxury, but they don’t tax marshmallow fluff which is considered food. In some states Kitkat bars are categorized as food because they contain flour, but a snickers bar is candy. Meanwhile a snickers ice cream bar, which needs to be refrigerated, would be considered food and not taxed.<sup>1</sup></p>\n  <p>Small, online businesses: Get your calculators ready!\n  </p> \n ",
    "blogcite": " \n  <p class=\"footnotes\">1.  <a href=\"https://www.forbes.com/sites/advisor/2018/06/21/state-sales-tax-which-states-are-most-affected-by-the-supreme-court-online-retail-ruling/#791a05383e66\"   target=\"_blank\">https://www.forbes.com/sites/advisor/2018/06/21/state-sales-tax-which-states-are-most-affected-by-the-supreme-court-online-retail-ruling/#791a05383e66</a>\n  </p> \n  \n  <p class=\"footnotes\">2.  <a href=\"http://money.cnn.com/2018/06/21/technology/wayfair-vs-south-dakota/index.html\"   target=\"_blank\">http://money.cnn.com/2018/06/21/technology/wayfair-vs-south-dakota/index.html</a>\n  </p> \n  \n  "
  },
  {
    "id": "5",
    "did": "06-20-18",
    "date": "June 20, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "A Healthy Internet is a Fast, Cooperative Internet: <br />Net Neutrality Protections move to State-Level Legislation",
    "post": " \n  <p class=\"firstparagraph\">What difference does it make for Net Neutrality to morph into 50 different variations now that the neutrality protections leave the federal arena to fall into  state legislation?<sup>1</sup> Who can tell. Unfortunately, a potential micro-balkanization of bandwith rules within an interdependent network doesn't spell faster service for anyone. </p>\n  \n  <p>\n  What people seem to forget is that the key win for the 2015 net neutrality laws were merely <i>a small reflection of the larger significance of <strong>the net's reclassification as a service, like water, natural gas, and electricity.</i></strong> State legislators need to focus on the air we breathe as critical to providing enough at reasonable cost, to merely survive in the times.</p>\n  <p>After all, the internet venues are what color the web...the last thing we need is the vast and varied imagination of 5 umbrella content-providers. Wired Magazine makes a good point that </p>\n  <p class=\"quote\">California's current legislative debates may lead the precedent for others, more influential than Seattle's--California's economy is equally sized with France at 2.5 trillion. \n  <br />\n  <br />[California State Senator Scott Wiener's] original bill included all the major provisions of the FCC's old rules, which banned broadband providers from blocking, throttling, or otherwise discriminating against lawful content. But it went further than the FCC rules by banning companies from blocking or throttling content as it enters their network from other networks, under so-called interconnection agreements.<sup>2</sup> </p>   \n  <p>The Internet, after all, is a Network, and a network is by definition a singular entity.</p>\n  ",
    "blogcite": " \n  <p class=\"footnotes\">1.  <a href=\"http://www.latimes.com/politics/la-na-pol-court-online-taxes-20180621-story.html\"   target=\"_blank\">http://www.latimes.com/politics/la-na-pol-court-online-taxes-20180621-story.html</a>\n  </p>\n  <p class=\"footnotes\">2.  <a href=\"https://www.wired.com/story/california-net-neutrality-bill-was-hijacked-lawmaker-says/\"   target=\"_blank\">https://www.wired.com/story/california-net-neutrality-bill-was-hijacked-lawmaker-says/</a>\n  </p>\n    "
  },
  {
    "id": "4",
    "did": "06-19-18",
    "date": "June 19, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Musing Blockchain",
    "title": "Rise of the Embattled 4th Estate",
    "post": "<p class=\"quote\"><i>\n  They left The Denver Post amid newsroom layoffs and interference in the editorial process by the newspaper’s hedge-fund owners. And now those reporters and editors are creating their own news outlet, The Colorado Sun.  They will be partnering with the Civil Media Company, an ambitious New York start-up that aims to use blockchain technology and crypto economics to start 1,000 publications nationwide by the end of the year. </i>\n  <br /><br />- New York Times, June 17, 2018</p><br />\n  <p class=\"firstparagraph\">Power from the 4th Estate tends to flow in the form of printers' ink, however Blockchain Tech empowers journalists with  new resources for their trade: free money and data, and more importantly, an empowered readership in Cooperative form: \n  </p>\n  <p class=\"quote\">\n  The new publication will have a conventional website whose data will be written permanently into the secure digital ledger known as the blockchain. Expenses for the fledgling outlet will be covered by a grant from Civil, whose sole investor, for now, is ConsenSys, a Brooklyn-based blockchain software technology company founded by the Canadian entrepreneur Joseph Lubin. Mr. Lubin is also a co-founder of the Ethereum, a virtual currency and blockchain database platform. As part of its plan to fund new media entities, Civil plans to unveil a new token this summer called CVL.\n<br /><br />\nPeople who purchase the CVL token, a form of cryptocurrency, will have a say concerning the projects hosted by Civil — meaning that they can vote on whether one of its websites violates the company’s journalism standards, which are outlined in the Civil Constitution.<sup>1</sup> \n  </p>\n  <p>Who would have guessed that through Crypto-Currency for money and Distributed Ledger Tables for data, modern Journalism would rise from the ashes of tech-induced impoverishment and so-called 'fake-news' delegitimization to regain limitless ink for influence, with a renewed and democratized legitimacy.  <br />\n  <br />\n  Thank you, Blockchain, for restoring Truth to Power!\n  </p>\n  ",
    "blogcite": "\n  <p class=\"footnotes\">1.  <a href=\"https://www.nytimes.com/2018/06/17/business/media/denver-post-blockchain-colorado-sun.html\"   target=\"_blank\">https://www.nytimes.com/2018/06/17/business/media/denver-post-blockchain-colorado-sun.html</a>\n  </p>\n  \n  "
  },
  {
    "id": "3",
    "did": "06-18-18",
    "date": "June 18, 2018",
    "author": "by Thomas Maestas",
    "cat3": "A.I.Now",
    "title": "Machine Learning, Democratized:<br />Part II: Deep Learning's Origin Story",
    "post": "<p class=\"firstparagraph\">Deep Learning--a 70's thing--clearly predates   personal computing, the web, and even the 70's Show. But the true advances have been a long time in development, and credit belongs to Statistics and Data Science, and specifically quantitative analysis' ever cleverer classification trees that deliver the goods with greater accuracy, coupled with less intensive computing costs. And this origin is interesting in itself: </p>\n <p class=\"quote\">\nFifty years have passed since the publication of the first regression tree algorithm. New techniques have added capabilities that far surpass those of the early methods. Modern classification trees can partition the data with linear splits on subsets of variables and fit nearest neighbor, kernel density, and other models in the partitions ... <br />\n<br />Classification And Regression Trees (CART) (Breiman et al., 1984) was instrumental in regenerating interest in the subject. It follows the same greedy search approach as  Automatic Interaction Detection (AID) and THeta Automatic Interaction Detection (THAID), but adds several novel improvements. Instead of using stopping rules, it grows a large tree and then prunes the tree to a size that has the lowest cross-validation estimate of error. The pruning procedure itself is ingenious, being based on the idea of weakest-link cutting, with the links indexed by the values of a cost-complexity parameter. This solves the under-fitting and over-fitting problems of  AID and THeta Automatic Interaction Detection (THAID), although with increased computation cost.<sup>1</sup>\n</p>\n<p>Today, Machine Learning curricula usually begin with the same sample datasets on Iris characteristics (pictured below)</p>\n<img style=\"min-width:300px;\"  src=\"dist/img/learningData.PNG\"><br /><br />\n<p>So how does it really work, in oversimplified terms? Contrary to most algorithms' step-by-step manual decision-making through for- and while-loops, if-else, and so on, the scalability of design clearly falls off. Enter Deep Learning, which is nothing more mystical than simple classification--i.e. decision--trees. Beginning with a million choices, a decision passes through multiple layers that may or may not be activated, and with each activated layer, a decision is narrowed down, until finally a decision is reached between recognizing a dog and a cat!\n</p><img style=\"min-width:300px;\" src=\"dist/img/classifTree.PNG\">\n</p><img style=\"min-width:300px;\" src=\"dist/img/classifTree2.PNG\"><br /><br />\n<p>And yet, for all of this science, up until 2011, the error rate for simple shape recognition, like say a dog from a cat still averaged a 26% error rate! A mere 7 years later? Today, that error rate averages less than 3% error, most recently due to computing, power, and memory advances.   Those come in handy for delivering a warehouse worth of computing onto your smartphone! That's a boon for delivering sensors, i.e. training data, into the environment. My last post mentioned Google's upcoming, yet unnamed Android OS...but we do know it's a candy that starts with \"P\"...my guess is Peppermint Patties? Or maybe Pez has more of a ring to it.</p>  \n<p  >\nWhatever the new OS is called, it comes with a developing potential to exponentially advance <i>Tree Science</i>:  ML Kit behaves like an API layer connecting the ML software to the app developers' models, making dev easy to run and deploy with an \"experimental model compression flow that aims to reduce model size (up to orders of magnitudes) while maintaining similar accuracy.\"<sup>3</sup> Talk about maturing exponentially quickly! Now, this origin story can't compete with Wolverine's nor Han Solo's, but this gem carries a mythical and futuristic potential to satisfy screen-goers from all devices, frame-sizes, and platforms!</p>\n",
    "blogcite": "\n\n<p class=\"footnotes\">1. Loh, W. Y. (2014). Fifty years of classification and regression trees. International Statistical Review, 82(3), 329-348.\n<a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/insr.12016\"   target=\"_blank\">https://onlinelibrary.wiley.com/doi/full/10.1111/insr.12016</a>\n</p>\n\n<p class=\"footnotes\">2. Classification and Regression Trees Leo Breiman, Jerome Friedman, Charles J. Stone, R.A. Olshen (1984).\n<a href=\"https://www.taylorfrancis.com/books/9781351460491\"   target=\"_blank\">https://www.taylorfrancis.com/books/9781351460491</a>\n</p> \n\n<p class=\"footnotes\">3. \n<a href=\"https://developers.google.com/ml-kit/\"   target=\"_blank\"> https://developers.google.com/ml-kit/</a>\n</p>\n<p>Images:Maurice Roux\nUniversité Marseille 3\nSaint-Jérôme</p>\n"
  },
  {
    "id": "2",
    "did": "06-16-18",
    "date": "June 16-17, 2018<br />Weekend",
    "author": "by Thomas Maestas",
    "cat3": "Sociology Tomorrow!",
    "title": "Machine Learning, Democratized<br />Part I: Google's ML Kit",
    "post": "\n<p class=\"firstparagraph\">\nThe upcoming Android 'P' OS--still in beta and only available on Pixel phones, Essential, and a few others--promises a new era in mobile app development<sup>1</sup>  Most features, like expanding Maps' indoor functionality, inclusive Emojis, and a revamped navigation bar are all nice, but one element of the build empowers app developers' access to machine-learning code: \n</p>\n<p class=\"quote\"> With  ML, i.e. machine-learning, Kit, app developers can use Google’s machine learning tasks within their own apps. ML Kit allows developers to use the camera for face detection, landmark recognition, text recognition, and a host of other recognition features.<sup>2</sup></p>\n<p>\nSo, in conceptual terms, this means developing app-data models that are <i>optimized for mobile inference</i>. This means that the long process of acquiring enough training data to optimize an app's design or behavior (generally or specifically user personalization), can now be shortened with better quantity and quality of training data &aacute; la machine learning. So in concrete terms, the past 15 years' of Google ML research is now distilled into (again, still beta) an SDK (software developers' kit) that facilitates dev integration without needing to hand-make a model to access the run-time environment. \n</p>\n<p>In other words, past server-side inferences now jump to the mobile device, and tap into   on-device machine learning library framework and toolkit--i.e. TensorFlowLite. This jump-starts customized application of machine learning already in production--that is, Android devices' <i>Neural Networks API</i> and <i>iOS' Metal</i>.  \n</p>\n<p>What makes this new programming horizon most interesting is that an equally new feature, called \"Actions\" and \"Slices\",  allows for certain app features to be accessed by the phone itself outside of the app. A May 8th Verge article explains:\n\n</p>\n<p class=\"quote\">\nGoogle is introducing developers to a couple of terms: “Actions” and “Slices.” They are essentially deep links into apps that are able to surface in other parts of the operating system. Actions are analogous to Actions on Google Assistant; Slices are a subset that can show the app’s own UI when you type out a global search on the phone.\n<br /><br />\nThe idea behind both of these concepts is to break out the different pieces of the apps you use into the larger operating system. Samat calls it the “decomposition of apps,” though without the connotations of death. “Yeah, you want to go the app,” he says, “but actually what you want to do is go to your house or reorder from Instacart.”\n<br /><br />\nDevelopers will need to build some frameworks into their apps to make Actions and Slices available to the system. When they do, the AI in Android P will try to understand what those apps can actually do and suggest those actions to you. “When you modularize the app, it’s not just an API call,” Samat says. “You have these components that can be understood by the system, predicted by the system, and then rendered by the system.”<sup>3</sup>\n</p>\n<p>So what does this mean? Better, higher-quality time spent with your work or play, rather than hopping from one icon to the next for each and every task...",
    "blogcite": "\n\n  <p class=\"footnotes\">1.\n\n  <a href=\"https://developer.android.com/preview/devices/\"   target=\"_blank\"> https://developer.android.com/preview/devices/</a>\n \n  </p>\n  <p class=\"footnotes\">2.\n\n  <a href=\"https://www.digitaltrends.com/mobile/google-android-p-news/\"   target=\"_blank\"> https://www.digitaltrends.com/mobile/google-android-p-news/</a>\n \n  </p>\n  <p class=\"footnotes\">3.\n\n  <a href=\"https://www.theverge.com/2018/5/8/17327302/android-p-update-new-features-changes-video-google-io-2018\"   target=\"_blank\"> https://www.theverge.com/2018/5/8/17327302/android-p-update-new-features-changes-video-google-io-2018</a>\n \n  </p>\n  "
  },
  {
    "id": "1",
    "did": "06-15-18",
    "date": "June 15, 2018",
    "author": "by Thomas Maestas",
    "cat3": "Musing Blockchain",
    "title": " The Spectre of a Headless Horseman:<br /> Why  Sociologists <i> are<span class=\"new\">n't </span></i> Key Players in Data Analysis within the Domain of Blockchain Technologies?<br /><span class=\"new\">A Re-Do of my <s >Feb 10,2018</s> post</span>",
    "post": "<p class=\"firstparagraph\">Blockchain technologies, i.e. Government contracts, Business contracts, Bitcoin and other\n\ncryptocurrencies, all rely on network graph theory, both on the low-level programming technology (peer-to-peer global\n\nip networks) across the spectrum to high-level interfaces for institutional, corporate, individual needs and uses.\n\nThese blockchain &quot;network&quot; analyses depend on highly variable--and simultaneous--network changes, node\n\nchanges, and link changes; and, the latter three may arbitrarily change interdependantly or not.</p>\n\n\n\n<p>Therefore, blockchain technologies must first accomodate  complex node variables, including one- or two-way contracts (relationships) that\n\n depend on<i> arbitrarily hierarchical mappings and conditional data structures.</i> Secondly, blockchain tech must face analytical\n\nchallenges that arise from informal practices<sup>1</sup><span class=\"new\">--you can survey opinions, but how do you measure whim?</span>\nThe organizational nodes (employees) choose to deviate from their employment roles&#39; protocol <span class=\"new\">because it it is sunny outside, or maybe because the traffic was long today, or because a butterfly's wing-swish cooled a rash decision down to reason.  That small detail often trumps statistical patterns of efficiency, convenience, company culture, and multiple other levels of analysis of human factors.</p>\n\n\n\n<p>Sociologists Meyer &amp; Rowan&#39;s (1977)\n\n<i>New Institutionalism</i> explains how employees change practices and decouple\n\n<i>actual</i> organizational structure from recorded rules, as a function of organizational size, time, convenience,\n\netc. Noone can argue against this wall of reason. <span class=\"new\"><i> The problem is not the reason, the problem is the static, frozen wall called Social Science Theory, constructed from a pastiche of different meanings</i> and arbitrary theoretical starting points.  <span class=\"new\">The esteemed Scholar of Comparative Politics, Dr. Ellen M. Immergut, undermined modern sociology concepts in 1998--a logical blow from which Sociology has never recovered (nor yet faced). She writes:</span>\n</p>\n<p class=\"quote new\">\nFurther confusion has arisen because the new institutionalists do not propose one generally accepted definition of an institution, nor do they appear to share a common research program or methodology. In fact, three separate branches of scholarship--rational choice, organizational theory, and historical institutionalism -- all lay claim to the label, seemingly without adhering to an overarching theoretical framework.<sup>3</sup></p>\n<p class=\"new\">\nIn other words, the long-standing Civil War within the discipline of Sociology (beginning with Functionalists' irreconcilable contradictions of Conflict Theorists' entire World-View--and vice-versa). From this initial schism begins the disassembling of the discipline--as it stands until today. \nAll of that talent and no single vision to harness a lasting explanatory platform.  And this is <i>before</i> addressing--from a Scientific Method Paradigm--the problem of continually new, unknown constraints on data that must be intimately understood without falling back to the old, \"USA Today\" habits of 'Theoretical Relativism'.</p>\n</span>\n<p>\nSo, how do we recognize unwritten, soft rules and behaviors of a bank, a person,\n\nor a company&#39;s internal bot?</p> \n\n<p>The hard sciences domain of Software Engineering, Computer Science, and Mathematics have brilliantly brought the\n\nworld the blockchain tool, based on a <span class=\"new\"><i>technical, numerical aptitude--numeracy--for which the Hard Sciences can and must share and propogate it's technical expertise and higher standard of metric truth</i><s style=\"color:purple\" class=\"strike-purple\"> not contribute everything, especially relating with</s> to the other sciences that are still lagging behind--namely The Discipline of Sociology</s> toward acclimating to the modern age's social priorities and needs. Ask yourself, how well do 1,000 top blockchain-related programmers understand the multi-dimensional layers of hierarchical social, corporate, and governmental relationship networks--probably 700 of the 1,000. And how many social scientists can understand the technological sciences? Probably 200 out of 1,000. This means that <i>a chunk of the scientific displines suffer from acute innumeracy</i>. So how do we bridge this massive knowledge gap between qualitative meaning in the smart-contract?</span></p>\n\n<p>In the past, the layers of abstraction from raw technological tool to societal use was refined, improved, integrated through multiple layers of &quot;middlemen&quot;, such as lawyers, corporate lawyers, government institutions, non-governmental, non-profit and for-profit actors. Blockchain technology, by its very nature, erases the middlemen. Suddenly, one programmer, for example, is writing the same healthcare insurance crypto-contract, that last month an entire team of hospital employees spent a month writing; then overseeing and managing different facets of this same thing.</p>\n\n\n\n<p>However, the crypto-contract, once deployed to the blockchain, auto-manages the rest, forever or for the life of\nthe contract. Therefore, rather than redoing the trials and errors of 200 years&#39; Sociology Network Analysts&#39;\nresearch and analytical development. <span class=\"new\"> Therefore, much of the social scientists have arrived at the end of the line of technology, still shackled to analog methodology relegated to the Sine and Cosine of progress; while the World leaves it behind, led by the Hard Sciences of Software Engineering--the new social fabric of the 21st Century. So, can the anthropological and social domains survive this existential threat to any authority--that depends if the Hard Sciences, Gatekeepers of Empirical Science will extend an open door and pro-actively share technical instructions for the soft sciences.  Therefore, the social sciences are not safe hiding at home, within the academic\ntower--far removed from the pace of societal and technological change.  \n </p>\n \n\n<p class=\"new\">The point is this: The innumeracy of the Soft Sciences increasingly loses authority, with the less it can prove at the Command Line Interface. So, how will an analog academic field in the early 21st century compete with artifical intelligence? Problems grow exponentially in the modern age, and only the sciences with  machine-learnig on their side can expect to thrive by applying extraordinary applications of machine-learning to network theories. <span class=\"new\">\n Sociologists deal with real-time, logical and hierarchical network mappings that appear arbitrary, yet are characterized by fixed patterns. This implies a higher level of competency to accurately judge a point-of-view without the ability to directly consult machine learning. <i>This is a Code or Be Coded moment in the life trajectory of the social sciences.</i></span></p>\n\n\n\n<p>  <i>the Power  of the Social Sciences, even while paraliyzed, cannot be underestimated:</i> No other academic field than sociology has advanced into the details, and endless network rabbit-holes that characterize societal behavior. Not until this second millenial decade could the marriage of Large Number Statistical Theory\n\nbecome consumated with the brilliance of early 1900&#39;s Sociological French Network Theories, like Maurice Halbswach&#39;s\n\nwork on the clearly defined network patterns of a society&#39;s Collective Memory.</p>\n\n\n\n<p>So, current sociology, having collected and refined knowledge on network arbitrariness, such that Economic&#39;s &quot;irrational\n\nbehaviors&quot; and Mathematical &quot;complexity models&quot; do not\n\n<i>touch to the bone</i> the meaning, the intersectionality of network analysis, which must incorporate simultaneous\n\nnode changes (person gets job /or/ does not get job), network changes (All get jobs /or/ only 3 of 15 network groups\n\nget jobs), and most importantly the\n\n<i>relationship</i> changes (all jobs always useful /or/ half of job groups no longer useful) across time and fixed.</p>\n\n\n\n<p>Fine. So, why is Sociology&#39;s network theory so valuable, yet inaccessible, beyond just the network insights gleaned from 19th and\n\n20th centuries&#39; network problems?  European sociology came of age in the analog social era, while North\n\nAmerican Sociology only recently come of age (Quebec in the 1960&#39;s [post-1968], U.S. in the 1990&#39;s[post-1999],\n\nin the digital social era. Therefore, the problem-solving patterns of past sociology are inherently small-data and\n\nmore qualitative analysis, and thus only Sociology incorporates &quot;human-ness&quot; into the billion rows and\n\ncolumns of quantitative--numbers-only--analysis.</p>\n\n\n\n<p>For example, Oxford-developed S.I.E.N.A. Software accomplishes this task. SIENA--named for Simulation Investigation\n\nfor Empirical Network Analysis--software calculates the real-time values, direction, and conditions of each relationship\n\n(link) in a network, simultaneously as each node, network, or alter-link changes or is changed; with this, it is\n\npossible to isolate directional, conditional\n\n<i>influence change</i> in real-time. Real-time sounds impossible, however, the SIENA documentation\n\n<sup  >2</sup> describes its program algorithm to the statistical analysis of network data, with the focus on social networks.</p>\n\n\n\n<p>An easy example to grasp this is the concept of whether a person\n\n<i>self-selects </i>(e.g., due to subconscious leanings) into a group and thus matches to fruition the group&#39;s\n\nbehavior with little group influence? Or does this same person join a group and emulates the group&#39;s behavior,\n\nby the group&#39;s influence over time. Sociological network analysis, using Snjder&#39;s SIENA software, achieves\n\nthe impossible with the closed, directed graph networks that characterize blockchain technology. The network graph\n\ncan be here understood as entire (complete) networks (i.e, the blockchain in its entirety without hard forks), not\n\nas personal (egocentered) networks: Using this SIENA model allows for the necessary assumptions that a set of nodes\n\n(social actors) is given, and all ties (links) between these nodes are known - except perhaps for a moderate amount \nof missing data</p> \n\n<p>If, and only if, this level of analysis may be achieved, the blockchain development may follow a linear, directed\n\npath of maturity with social and world needs.<span class=\"new\"> Until   Social Science Network Theorists stop from basing their numerical analysis on the mutable sand of theory, rather than theory based on the   foundation of numerical science, <i>any attempt at conclusion...you guessed it...cannot be conclusive.</i>So, the social sciences must consult the hard sciences, otherwise they risk squandering countless years of talented theorists' work; <i>the discipline's executive functions are cut off from it's increasingly inaccessible (and increasingly powerful) knowledge base.</i> --Such a talented, powerful Thoroughbred of a Science, that still wanders without a head for technical direction.</span></p>\n",
    "blogcite": "\n<p class=\"footnotes\">1. \n<a href=\"http://www.journals.uchicago.edu/doi/abs/10.1086/226550\"   target=\"_blank\"> http://www.journals.uchicago.edu/doi/abs/10.1086/226550</a>\n \n\n</p>\n\n<p> \n2. \n<a href=\"https://www.stats.ox.ac.uk/~snijders/siena/\"  target=\"_blank\"> https://www.stats.ox.ac.uk/~snijders/siena/</a>\n<br />\n<p class=\"footnotes\">3. The Theoretical Core of the New Institutionalism, Ellen M. Immergut: Politics &amp; Society, Vol. 26, Issue I, pp. 5-34 \n<a href=\"http://journals.sagepub.com/doi/abs/10.1177/0032329298026001002?journalCode=pasa\n\"  target=\"_blank\">http://journals.sagepub.com/doi/abs/10.1177/0032329298026001002?journalCode=pasa\n</a>\n</p>\n"
  }
]